[
    {
        "id": 1,
        "term_id": 1,
        "revision": 1,
        "platform": 1,
        "lang": "ja_JP",
        "title": "ネットワークテスト利用規約/チャットサービスに関する注意事項/プライバシーポリシー",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』ネットワークテスト利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、当社が定める以下の事項が適用されます。\n本サービスに係るガイドライン、各種取り決め、取引条件の表示、利用上の注意等（以下「ガイドライン」といいます）は、本規約の解釈を示し、または本規約の一部を構成するものとなります。また、ガイドラインと本規約の規定内容が矛盾抵触する場合には、ガイドラインが優先して適用されます。\n本サービスのご利用にあたっては、関連する第三者との契約または規約等についても遵守していただく必要があります。\n\n\n1. ネットワークテストについて\n\n1.1 このネットワークテストは、本サービスの機能・動作・サーバ負荷テスト等、正式サービスの運用試験を目的としており、一部使用できないサービスや機能があります。\n\n1.2 ネットワークテストの日程および内容は予告なく変更される場合があります。\n\n1.3 ネットワークテストへの参加にあたっては、バンダイナムコIDの会員登録が必要です。\n\n1.4 日本に居住されている方のみ、ネットワークテストに参加いただけます。\n\n1.5 ネットワークテストは無料でプレイできますが、通信料等はお客様のご負担となります。\n\n1.6 ネットワークテストでのプレイデータは、実施期間の終了後にすべて削除されます。正式サービスにプレイデータを引き継ぐことはできません。\n\n1.7 正式サービス開始の有無、仕様、価格、開始時期等については当社の任意となります。\n\n1.8 ネットワークテストでは、動作が不安定になることやサーバに接続できない等の不具合が生じ、円滑にプレイできない可能性があります。\n\n1.9 メンテナンス、不具合またはネットワーク障害により、予告なく一時停止または中断が発生する場合があります。\n\n1.10 プログラムの更新等により、予告なく全部もしくは一部のプレイデータが初期化され、またはゲームバランスが大きく変更される可能性があります。\n\n\n2. 未成年者による利用について\n\n2.1 お客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本規約を確認し、法定代理人の同意を得てから本規約に同意してください。\n\n2.2 未成年のお客様が、法定代理人の同意がないにもかかわらず同意があると偽って本サービスを利用した場合、年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合には、その未成年のお客様またはその法定代理人は、本サービスにおける一切の法律行為を取消すことができません。\n\n2.3 本規約に同意した時点で未成年であったお客様が、成年に達した後に本サービスを利用した場合、未成年であった間の利用行為を追認したものとみなされます。\n\n2.4 当社は、お客様の年齢に応じて、本サービスの全部または一部の利用を制限する場合があります。制限の対象および内容は、本サービス内で別途お知らせします。\n\n\n3. 本サービスについて\n\n3.1 本サービスのご利用にあたっては、バンダイナムコIDの会員登録が必要です。\n\n3.2 お客様は、日本国内でのみ本サービスをご利用いただけます。\n\n3.3 本サービスはインターネットに接続できる環境でご利用ください。なお、本サービスは無料でプレイできますが、通信料等はお客様のご負担となります。\n\n\n4. 本サービスの停止・プレイデータのリセットについて\n\n4.1 メンテナンス、不具合またはネットワーク障害により、予告なく一時停止または中断が発生する場合があります。\n\n4.2 当社は、前項に定める本サービスの一時停止または中断によりお客様に損害が生じた場合であっても、いかなる責任も負わないものとします。 \n\n\n5. お問い合わせ\n\n5.1 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ 窓口にて受け付けます。\n\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n6. 当社からの通知\n\n6.1 当社からお客様に対する通知  は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n\n6.2お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n\n7. アカウント\n\n7.1 お客様は、本サービスに関するお客様のアカウント（プレイデータおよびパスワードを含み、以下「アカウント」といいます。）を適切に管理するものとし、その利用および管理について一切の責任を負うものとします。また、本サービスと連携するサービスのアカウントについても同様とします。\n\n7.2 本サービスおよびアカウントは、当社がお客様に非独占的に利用を許諾しているものであり、お客様は当社が定めた利用範囲内に限りこれらを利用することができます。\n\n7.3 当社は、お客様のアカウントを利用して行われた本サービスの利用をお客様による利用とみなすことができます。また、アカウントの正当な利用者が不明な場合、当社は、当該アカウントを実際に利用している方をアカウントの正当な利用者とみなすことができます。\n\n\n8. プレイデータ\n\n8.1 お客様は、アカウントまたはそれに含まれるデジタルアイテム、ユーザー名、レベル、ランク、ステータス、称号その他のプレイデータ（以下「プレイデータ」といいます。）に関して所有権、知的財産権その他の権利を取得することはありません。また、プレイデータは、当社が権利を有しお客様に非独占的に許諾するデジタルデータに過ぎず、法令にて定められている場合を除きいかなる金銭的価値を有しません。\n \n8.2 お客様が利用されているプレイデータの内容または数量が、本サービスのご利用状況と比較して誤っていることが判明した場合、当社は、お客様に対して事前に通知することなくこれを修正することができます。\n \n8.3 お客様のプレイデータに含まれるユーザー名、レベル、ランク、ステータス、称号等は、本サービス内において他のお客様に公開されることがあります。\n\n\n9.  バンダイナムコIDの利用  \n\n9.１ 本サービスは、バンダイナムコIDを用いてデータ管理等を行っており、本サービスの利用に際しては、バンダイナムコIDを取得していただく必要があります。\n\n9.2 お客様が複数のバンダイナムコIDを保有されている場合であっても、本サービスにおいて２以上のバンダイナムコIDを利用いただくことはできません。\n\n9.3 お客様のバンダイナムコIDサービスの会員資格が失効となった場合、またはお客様がバンダイナムコIDサービスの会員登録を解除した場合、本サービスは一切利用できません。また、一度バンダイナムコIDサービスの会員資格が失効となり、または会員登録を解除しますと、サービス内データ（※）は一切復元できません。\n（※）「サービス内データ」とは、バンダイナムコIDに関連付ける形で記録・蓄積された本サービスにおける一切の情報（本サービス内で入手した全てのコンテンツおよびプレイデータ、ならびに本サービス内でお客様が投稿した文字、画像等の情報を含みます）をいいます。\n\n9.4  バンダイナムコIDに関するお問い合わせは、下記連絡先よりお問い合わせください。\n\n＜バンダイナムコIDお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n10. サービスの変更について\n\n10.1 当社は、お客様への予告を行うことなく、本サービス、アカウントまたはプレイデータの内容、仕様および価格等を変更することができます。\n\n10.2 当社は、お客様への予告を行うことなく、本サービスの提供を停止、中止または終了することがあります。\n\n\n11. 権利について\n\n11.1 本サービス（本サービスに含まれる発明、考案、意匠、商標、標章、画像、映像、文章、プログラムその他の一切の情報等を含みます。）に係る知的財産権その他の一切の権利は、当社または当社がその利用の許諾を得ている第三者に帰属します。\n\n11.2 お客様は、本サービスに関して当社とお客様の間で生じたいかなる権利または義務を、貸与、交換、譲渡、売買もしくは質入してはならず、また、方法を問わず第三者に利用させてはならないものとします。また、お客様は当該権利義務またはアカウントを他のお客様その他の第三者に相続することはできません。\n\n\n12. 情報の取扱いについて\n\n12.1 本サービスを通じてお客様からいただいたコメント、フィードバック、不具合等の報告、プレイデータ等、本サービスを利用したことにより発生する情報等に関する一切の権利は当社に帰属し、今後のゲーム開発および運営に活用いたします。\n\n12.2 当社は、本サービスの分析および改善を目的として、お客様のハードウェア、ソフトウェアその他利用環境に関する情報を、お客様の個別の同意を得ることなく自動取得できるものとします。\n\n\n13. 著作物の利用について\n\n13.1 本サービスのゲームプレイを撮影した画像・動画のインターネット上の利用に関しましては、 当社が定める「BLUE PROTOCOL 著作物利用ガイドライン」をお守りください。\n\n\n14. 禁止事項について\n\n14.1 以下に該当する行為または該当するおそれのある行為を一切行ってはなりません。当社が当該行為を確認した場合、お客様に対し事前に通知することなく本サービスの機能制限、プレイデータの修正またはアカウント停止等の措置を行います。なお、当該行為に該当するか否かは、当社の判断によります。\n(1)複数のバンダイナムコIDを利用する行為\n(2)お客様のバンダイナムコIDを第三者に開示または使用させる行為\n(3)他人（家族を含みます）になりすます行為、当社及び当社関連会社・本サービスの関係者になりすます行為、又は他の登録会員のパスワ－ドを不正に使用する行為\n(4)氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報（自分のもの他人のものかは問いません）を投稿する行為並びにニックネームに本名を登録する行為\n(5)当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為\n(6)当社及び当社関連会社、又は第三者を差別又は誹謗中傷し、名誉や信用を毀損する行為\n(7)本サービスのデータを改ざん又は不正に作成する行為\n(8)本サービスの利用を阻害する情報を登録する行為\n(9)本サービスの利用方法として予め想定又は許容される行為以外の行為\n(10)自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用した本サービスの利用及び勧奨する行為\n(11)有害なコンピュータ・プログラム等を公衆送信、頒布又は使用する行為\n(12)本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為\n(13)虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為\n(14)本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為\n(15)本サービスの提供を妨げる行為または誹謗する行為\n(16)本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為\n(17)本サービスに関する当社が未公表の情報を、当社以外の第三者に公開する行為\n(18)アイテムを不正に取得するなど、プログラムの不具合を利用した不正行為（不具合を利用していると当社が判断した行為を含みます）\n(19)リアルマネートレード（RMT）及びこれに類する行為\n(20)犯罪行為又はこれに結びつく行為\n(21)公序良俗又は法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に反する目的で本サービスを利用する行為\n(22)広告宣伝、営業活動その他営利目的で本サービスを利用する行為\n(23)異性との交際を目的として本サービスを利用する行為\n(24)宗教活動及び類似する行為、宗教団体への勧誘行為\n(25)政治活動及び類似する行為、政治団体への勧誘行為\n(26)選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為\n(27)他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為\n(28)わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為\n(29)連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為\n(30)無限連鎖講(ネズミ講) 又はネットワークビジネス等の開設及びこれを勧誘する行為\n(31)脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為\n(32)反社会的勢力等への利益供与行為\n(33)買春・売春を助長する投稿をする行為\n(34)覚せい剤、麻薬等薬物の使用を助長する投稿をする行為(35)アダルト・性風俗産業関連の投稿をする行為\n(35)自殺、自傷行為を助長する投稿をする行為\n(36)著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をする行為\n(37)未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をする行為\n(38)本サービスと無関係な情報を著しい長文として投稿する行為\n(39)異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿する行為\n(40)本サービスの不具合又は不正行為に関する情報を投稿する行為\n(41)アカウントを複数作成する行為\n(42) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避する行為\n(43) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）\n(44) 他のお客様を他のサービスに勧誘または誘導する行為\n(45) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求する行為\n(46)日本国外から本サービスを利用する行為\n(47)当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しない行為。または当社からの協力要請に従わない行為\n(48)本規約に違反すると認められる行為\n(49)前各号に該当するおそれがあると当社が判断する行為および当社が不適切と判断した行為\n \n14.2　お客様が前項に違反して、本サービスの内容を改変し又は他のソフトウェアと結合した場合、その結果についての権利（著作権法第27条及び第28条所定の権利を含みます）は当社に帰属し、お客様は当該権利について、他者に対し、貸与、使用許諾等をしてはならないものとします。\n\n14.3 禁止行為が繰り返された場合、または悪質な禁止行為が一度でもなされた場合には、無期限のアカウント利用停止措置を含めた厳格な対応を行います。これらの対応が行われた場合であっても、当社はこれらの対応を行うに至った理由や経緯等も含め、お客様の個別の質問には回答しない場合があります。  \n\n14.4 お客様が無期限のアカウント利用停止措置を受けた場合、以後、お客様は本サービスを利用することは一切できません。その場合、本サービスの終了時を含め、デジタルアイテム等の現金への払戻しまたは金券等への交換はいたしません。\n\n\n15. 解除について\n\n15.1 お客様が本規約またはガイドラインに違反した場合または当社が別途提供する他のサービスにおいてその利用規約等に違反した場合には、当社は、何ら催告なしに本サービスにかかる契約を解除し、またはお客様に対する本サービスの提供を停止、中止もしくは終了することができます。なお、違反に該当するか否かは当社の判断によります。\n\n15.2 前項に基づき当社が契約を解除した場合においても、お客様は解除日を含むその日までに支払義務の生じた一切の債務について引き続き責任を負います。\n\n\n16. 免責について\n\n16.1 アカウントの利用停止措置、プレイデータの修正その他の本規約またはガイドラインに基づいて実施する当社の対応によって、お客様に何らかの影響が生じた場合においても、当社は当該影響につき責任（利用料金の返還または払戻しを行う責任を含みます。以下同じ。）を負いません。\n\n16.2 当社は、天災地変、社会的動乱、ストライキ、火災、停電、通信インフラの停止その他の当社の支配できない事由に起因してお客様に生じる影響について責任を負いません。\n\n16.3 当社は、本サービスおよび本サービス内で当社が提供する情報について、明示・黙示を問わずその完全性、正確性、商品性、特定目的のための適合性、非侵害性その他のいかなる保証（本サービスがいかなる環境下でも利用可能であること、お客様のプレイデータが反映されること、または本サービスに不具合もしくはエラーがないことに関する保証を含みます。）を行わず、また、責任を負いません。\n\n16.4 お客様のご利用端末の破損、データ消去、紛失、盗難、端末変更もしくは不具合、ご利用端末からのアンインストール、またはパスワードの公開、紛失もしくは忘却等（パスワードの不設定および設定の不備を含みます。）によって、お客様のアカウントの全部または一部が消失し、またはお客様がアカウントへアクセスできなくなった場合においても、当社は責任を負いません。\n\n16.5 当社は、お客様と第三者（他のお客様、決済事業者、本サービス内で表示される広告の広告事業者を含みます。）との間で生じた紛争には関知せず、一切の責任を負いません。また、当社は、第三者の投稿情報、サービス（本サービス内で表示される広告およびその広告の対象となるサービスを含みます。）または行為等について一切の責任を負いません。\n\n16.6 お客様は、本サービスを利用するにあたり、健全な生活環境を乱すような過度の利用を避け、また、お客様の周囲の状況に注意して安全に利用するよう心がけるものとします。当社は、社会通念上適切な範囲を逸脱する本サービスの利用、または本サービスの利用中における事故等によりお客様に生じた社会的、精神的、肉体的な損害について、責任を負いません。\n\n16.7 当社は、お客様に対して適宜情報提供やアドバイスを行うことがありますが、お客様は当該情報やアドバイスをお客様の責任において取扱うものとし、当社はその結果について責任を負いません。\n\n\n17. 損害賠償   \n\n17.1 お客様は、本規約またはガイドラインへの違反その他自己の責めに帰すべき事由により当社に損害を与えた場合、当社に対して当該損害を賠償する責任を負います。\n\n\n18. プライバシーポリシー \n  \n18.1 当社は、本サービスを通じて当社が取得したお客様の個人情報を、別途定める「プライバシーポリシー」に基づき厳重に管理します。\n\n\n19. 本規約の変更について\n\n19.1 当社は、本規約の内容を随時変更できます。当社が本規約に何らかの変更を加える場合には、当該変更について事前に本サービスの公式サイトを通じて通知するものとし、変更後の規約は、本サービスの公式サイト内に掲示することによって効果が生じるものとします。   お客様は、当社からの告知がなくても、本規約の内容を定期的に確認してください。\n\n19.2 お客様が本規約の内容に同意できない場合には、本サービスのご利用を直ちに中止してください。本規約の内容の変更後、お客様が本サービスのご利用を継続した場合、当社は当該変更をお客様が承諾したものとみなします。\n\n\n20. 権利不放棄\n\n20.1 本規約、ガイドラインおよび法令等に基づく権利を当社が行使しない場合であっても、そのことは当該権利の放棄とはならず、当社はかかる権利を依然として行使できます。\n\n21. 分離可能性\n\n21.1 本規約およびガイドラインの一部が法令等に基づき無効と判断された場合であっても、他の規定の有効性には影響しないものとします。\n\n\n22. 準拠法および合意管轄\n\n22.1 本サービス、本規約およびガイドラインは日本法を準拠法とし、これに従い解釈されるものとします。\n\n22.2  本サービス、本規約およびガイドラインに関連してお客様と当社との間で生じた紛争は、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n\n以上\n\n制定　2022年11月1日\n\n\n\n『BLUE PROTOCOL』(以下「本サービス」といいます)にはユーザー同士の情報交換に利用できるチャット機能がございます。\n利用規約および以下のチャットサービスに関する注意事項の内容を確認し、同意したうえでチャットサービスをご利用ください。\nお客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本注意事項を確認し、法定代理人の同意を得てから本注意事項に同意してください。  \n\n■チャットサービスに関する注意事項\n● 利用規約および本注意事項に従ってチャットサービスをご利用ください。\n\n● 株式会社バンダイナムコオンライン(以下「当社」といいます)はお客様と他のお客様または第三者との間で生じた紛争には関知いたしません。また、お客様の投稿情報に関する責任はお客様が負うものとし、当社は責任を負いません。\n\n● 以下に掲げる行為または該当するおそれのある行為は禁止しています。\n(1) 犯罪的行為または公序良俗に反する行為\n(2) 当社または第三者の財産、名誉、プライバシー等の権利を侵害する行為（本名、メールアドレス、電話番号などの個人情報や個人の特定につながる情報を投稿する行為を含む）  \n(3) 不適切な表現行為または虚偽の情報を提供する行為\n(4) 本サービスまたはチャットサービスを不正な目的で利用する行為\n(5) 本サービスまたはチャットサービスの提供を妨げる行為または誹謗する行為\n(6) 本サービスまたはチャットサービスの内容を転載、複製、修正、蓄積または転送する行為\n(7) 本サービスまたはチャットサービスを利用した営利行為\n(8) 他のお客様による本サービスもしくはチャットサービスの利用を妨害し、または当該利用に支障をきたす行為\n(9) 第三者に迷惑を及ぼす行為または不快感を与える行為\n(10) 利用規約に違反する行為または法令に違反する行為\n(11) その他当社が不適切と判断する行為\n\n● お客様の投稿情報は、不特定多数の方が閲覧することがあります。また、チャットサービスの適正な運営のために、当社および運営会社がお客様の投稿情報を閲覧することがあります。\n\n● お客様が利用規約および本注意事項に違反する投稿等をした場合、又は、当社が必要と判断した場合、当社は、当社の判断により、お客様に対して事前に通知することなく、投稿情報の削除、チャットサービスの利用停止、本サービスの利用停止、本サービスの利用契約の解除その他の必要な措置、または必要に応じて政府機関その他の第三者に対する開示 を行うことができます。\n\n● 当社は、お客様の投稿情報について監視、変更・削除等の措置を行う義務を負いません。また、当社がお客様の投稿情報について変更・削除等の措置を行った場合であっても、当社は、当該措置を行うに至った理由および経緯の説明はいたしません。\n\n以上\n\n制定　2022年11月1日\n\n\n\n『BLUE PROTOCOL』プライバシーポリシー\n\n本プライバシーポリシーは、株式会社バンダイナムコオンライン（以下「当社」といいます）のウェブサイト、ゲーム、モバイルアプリケーションその他のオンライン製品およびサービス（総称して以下「対象サービス」といいます）をお客様が利用した場合または他の何らかの形にてお客様と当社との間でやり取りがあった場合におけるお客様に関する情報の当社による収集、保管、利用および開示の方法について、説明するものです。当社は、EU一般データ保護規則の目的上、お客様の個人情報のデータ管理者となります。\n当社は、本プライバシーポリシーを随時変更することがあります。当社は、何らかの変更を加えた場合には、本プライバシーポリシーの冒頭の日付を更新することでその旨をお客様に告知するとともに、場合により追加的な告知（対象サービスのホームページへの告知文の追加またはお客様への通知の送付などによるもの）をお客様に対し行うことがあります。当社における情報の取扱方法、およびご自身のプライバシー保護に資する方法に関し、最新情報を得られるよう、対象サービスへのアクセスのたびにプライバシーポリシーを確認しておくことをお勧めします。\n\nI. 情報の収集\n当社がお客様から収集する情報は、対象サービスごとに異なります。 当社は、識別子、インターネットまたはその他類似のネットワーク活動、対象サービスの利用履歴、位置情報などを収集します。詳細は以下に記載されています。また、収集目的は、「II. 情報の利用」のセクションに記載されています。\n\n1. お客様から当社に提供される情報\n当社は、お客様から当社に直接提供される情報を収集します。たとえば、アカウントの作成、他のユーザーとのやり取り、当社サーバーへの画像のアップロード、カスタマーサポートの依頼、ニュースレターの受信登録、アンケートへの参加その他の方法での当社とのやり取りがお客様によりなされた場合に、当社による情報収集が行われます。当社が収集することのある情報の種類には、お客様のユーザー名、パスワード、電子メールアドレス、写真その他お客様が提供を選択した一切の情報が含まれます。\n\n2. 対象サービスのお客様による利用時に当社が自動的に収集する情報\nお客様による対象サービスへのアクセスまたはその利用に際し、当社は、お客様に関する情報を自動的に収集します。その例としては、以下のものが挙げられます。\na)  利用状況に関する情報：当社は、お客様による対象サービスの利用に関する情報を収集します。これには、当社またはゲームコンソールを提供する事業者がゲーム開始時にお客様へ自動的に付与するゲーミングサービスID、コンプリート済みのレベル、ゲームスコア、対象サービスの利用に費やした時間その他のゲームプレイ情報も含まれます。\nb)  ログ情報：当社は、お客様による対象サービスの利用に関する情報をログに記録します。これには、お客様のブラウザの種別および言語、アクセス回数、閲覧ページ、お客様のIPアドレス、ならびに対象サービスへの移動前にお客様が訪問したウェブサイトも含まれます。\nc)  ハードウェア情報：当社は、お客様が対象サービスへのアクセスに用いたコンピュータ、スマートフォンその他のデバイス（以下「デバイス」といいます）に関する情報を収集します。これには、ハードウェアの型番、オペレーティングシステムおよびバージョン、ブラウザ、モバイルネットワーク情報、デバイスにインストールされている他の対象サービス（モバイルアプリケーション）、MACアドレス、IPアドレス、国際移動体装置識別番号（IMEI）その他の一意デバイス識別子であってお客様のデバイスのオペレーティングシステムにより提供されるものも含まれます。\nd)  位置情報：当社は、お客様のデバイスの地理的位置に関する情報を、対象サービスのお客様による利用の都度、またはかかる情報の収集について他の何らかの方法によるお客様の同意があった都度、収集することがあります。お客様は、ご自身のデバイス上の設定を用いて、こうした位置情報の収集の同意を撤回（拒否）することができます。お客様の位置情報は、収集前に対象サービスにおいて指定された期間にわたり、保存されます。\ne)  クッキー（Cookie）その他のトラッキング技術により収集される情報：当社は、様々な技術を用いて情報（個人情報も含む）を収集しています。その例としては、お客様のデバイスへのクッキーの送信も含まれます。クッキーは、お客様のデバイスのハードドライブ上またはメモリー内に保存される小さなデータファイルであり、対象サービスおよびお客様の体験の向上、対象サービスにおいて人気のある領域および機能の特定、ならびに訪問数の算定に際し、当社の助けとなるものです。\nf)  お客様の傾向分析情報：当社は、お客様の嗜好、特性、行動および本サービスの使用実績などの情報に基づいて傾向分析をし、お客様の同意を得て、その分析結果を他の情報と組み合わせて利用します。\n\n3. 当社が第三者から収集する情報\n当社は、対象サービスの実施に必要である限りにおいて、第三者からも情報を取得することがあり、また、当該情報同士を組み合わせたり、当該情報と対象サービスを通じて収集した情報とを組み合わせたりすることもあります。たとえば、当社は、ゲームコンソールまたはiOSもしくはAndroidその他のプラットフォームを提供する事業者（以下「プラットフォーマー」といいます）から、お客様のゲームランキングおよび達成状況を収集することがあります。お客様が第三者のプラットフォーム（FacebookやTwitterなど）を通じてアカウントを作成またはログインした場合、当社は、当該プラットフォームがお客様から得た同意に従って、お客様の名前、誕生日、プロフィール写真などの特定の情報にアクセスすることができます。また、お客様がソーシャルメディア上で対象サービスに関する感想や他の情報を公開した場合、当社は、当該公開情報（ただし、当該ソーシャルメディア上でお客様が使用しているユーザー名は含みません。）を収集することがあります。さらに、お客様がアプリ購入を完了した場合、当社は、お客様のデバイスのオペレーティングシステムを提供する事業者（以下「OSプロバイダー」といいます）が当社に代わって当該購入を処理する際に、当該OSプロバイダーからお客様に関する情報を収集することがあります。ただし、当社は、OSプロバイダーからお客様の支払方法に関する情報を受領することはありません。\n\nII. 情報の利用\n当社は、お客様の同意がある場合、または次のいずれかにとって必要な範囲である場合に限り、お客様の情報の収集、保管および利用を行います。(i) お客様と当社との間の契約を履行するため、(ii) 当社の法的義務を遵守するため、または (iii) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため。当社は、当社の正当な事業上の利益とお客様の保護法益との衡量を慎重に行っています。この利益衡量に関してご不明な点がありましたら、後述の問い合わせ先宛てにご連絡ください。\n特に、当社（または当社の委託先）は、お客様に関する情報を、以下の目的のため、当該目的の達成に必要とされる期間にわたり、収集、保管および利用することがあります。\n\na)  お客様と当社との間の契約を履行するため\n-対象サービスの提供のため。\n-対象サービスに関するお客様からのコメント、問い合わせおよび依頼に対応し、関連情報を提供するため。\n-対象サービスにおいてお客様のアカウント登録を行うとともに、お客様のアカウント管理を支援するため。\n-その他対象サービスに限らずお客様からのコメント、問い合わせおよび依頼に対応し、カスタマーサービスを提供するため。\n-技術上の告知、アップデート、セキュリティアラートおよびサポートのほか、事務手続上のメッセージをお客様に送信するため。\n-当社の主催するコンテストへの参加の処理およびその懸賞金の提供のため。\nb) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため\n-当社の法律上および規制上の義務を遵守するために当社に必要であるまたは許可されている他の一切の目的のため。\n-対象サービスに関連する傾向、利用状況およびアクティビティのモニタリングと分析のため。\n-対象サービスに関連する詐欺的、不正または違法な活動を検出し、調査しかつ/または防止するため。\n-法定代理人の許可を取得するため。\n-サービス内においてコンテキスト広告（ターゲティング広告を除く）を提供するため。\nc) 同意がある場合\n-対象サービスに関連する傾向、利用状況およびアクティビティをモニタリング・分析し、お客様のニーズを把握して優れたサービスをお客様に提供するため。たとえば、当社は、お客様がソーシャルメディア上で公開した対象サービスに関する感想や他の情報を、第三者が提供する分析ツールを用いて単独で、またはゲームプレイ情報などの他の情報と組み合わせて分析し、お客様のニーズを把握して新たなサービスの提供に役立てることがあります。\n-当社または当社のグループ会社もしくは取引先により提供される製品、サービス、提案、プロモーション、報奨およびイベント・キャンペーンなどに関してお客様に告知や通知（イベント・キャンペーンなどの当選通知を含みます）を行うため。また、お客様の興味関心に合うと当社が判断する広告、ニュース、情報その他のマーケティング資料を提供するため。\n-当社が第三者から取得した情報を連携または組み合わせたりすることによって各対象サービスごとの収益傾向の分析、お客様の属性別統計データの作成、新しいゲームやサービスの創出、その他の分析を行うため。\n-対象サービス内のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の関心の高い広告の提供\n  ・広告および当社のサービスに関連するお客様の傾向、利用状況などのモニタリングおよび分析\n  ・他のお客様から収集した情報とリンクまたは組み合わせることでお客様のニーズを理解したうえで、よりパーソナライズされた広告の提供\n  ・第三者のサービスプロバイダーから提供される情報とお客様から収集する情報を組み合わせることによる、本サービスを利用するユーザーのカテゴリー別傾向分析\n-対象サービス外のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の情報を当社が提携する広告会社の情報と組み合わせ、お客様の属性別統計データを作成すること\n  ・当社（グループ会社含む）のゲーム  ・サービスの広告をご案内するため、お客様の情報を当社のグループ会社、広告代理店および配信広告プラットフォームへ広告出稿および分析を目的として提供すること\n  ・その他の広告分析やパフォーマンスの測定を実施すること\n\nIII. 情報の共有\n当社は、第三者（国内外のグループ会社を含む当社の委託先を除きます）との間においてお客様の個人情報の共有、転送および交換を行いません。ただし、法律により許容されている場合、またはお客様から当社への同意がある場合は、この限りではありません。その場合でも、当社は、お客様の個人情報を第三者に販売することはありません。以上を遵守したうえで、当社は、以下のとおり、または本プライバシーポリシーの他の規定に基づいて、お客様に関する個人情報に当たらない情報（当社内でお客様を識別できない情報）を共有することがあります。\na) 他のユーザーとの間での対象サービスにおけるインタラクティブ形式の領域（マルチプレイヤー、チャットまたは共有機能など）への参加をお客様が選択することで、お客様に関する情報を、他のユーザーとの間で共有する場合。尚、個人を識別できるデータ（お客様の氏名など）を対象サービスにおけるユーザー名として使用することは、禁止します。\nb) 当社の従業員、グループ会社、ベンダー、コンサルタント、その他の外部サービスプロバイダーであって当社のための業務遂行に際し当該情報へのアクセスを必要とするもの（たとえば、開発者、支払処理業者、ウェブサイトホスティングサービス業者、または情報ストレージおよび処理サービス業者も含みます）との間で、必要な限度でお客様に関する情報を共有する場合。\nc) 法的手続または情報提供要請への応答に際し、その開示が、適用のある法律、規則もしくは規制（たと えば、政府当局、規制機関または司法裁判所も含みます）に従ったものであるかまたは他の何らかの態様でかかる法律、規則もしくは規制により義務付けられている場合。\nd) お客様の保護法益と当社の正当な利益を比較衡量したうえで、お客様の行為が当社のユーザー契約もしくはポリシーに反していると認めるに足る、または当社、当社ユーザーもしくは他者の権利、財産および安全を保護するに足る合理的根拠がある場合。\ne) 当社事業の全部もしくは一部の合併、会社資産の売却、資金調達、または他の会社による買収に関連してお客様に関する情報を共有する法的根拠がある場合。\nf) お客様の同意または指示に基づく場合。\n\nIV. 第三者により提供される広告・分析サービス\n当社は、第三者による分析サービスの提供および対象サービス内での広告の配信を許可することがあります。これらの者は、お客様のデバイスおよびお客様による対象サービスの利用に関する情報を自動的に収集するテクノロジーを用いることがあります。かかる情報には、IPアドレス、デバイス識別子、対象サービス内のページでの滞在時間、および対象サービス内でクリックされたリンクも含まれます。かかる情報は、対象サービスの機能の維持、改善および分析など、ならびにお客様の興味関心に合う可能性のあるコンテキスト広告およびターゲティング広告の配信などのために、当社および当該第三者により利用されることがあります。かかる第三者によるお客様の情報の利用には、当該第三者各自のプライバシーポリシーが適用されることとなり、当社は、第三者のプライバシーポリシーについて管理権を有しないとともに責任を負いません。\n対象サービスによっては、ゲームおよび収益化の傾向分析、プレイヤーのカテゴリー別の傾向分析、新たなゲームおよびサービスの作成、その他解析の実施のために、お客様の事前同意を得たうえで、対象サービスの利用状況に関する情報と、当社の他のゲームから収集された情報、当社グループ会社のゲームから収集された情報その他第三者から収集された情報とを組み合わせることがあります。また、当社は、 お客様の同意または指示に基づく場合、当社のゲームを通じてそのゲーム外で配信する広告のために一定の情報を利用することがあります。これには、お客様に関する情報と当社の広告パートナーから取得した情報との組み合わせによりプレイヤーのカテゴリー別の傾向分析を行うこと、当社（および当社のグループ会社）のゲームおよびサービスについての当該ゲーム外での広告配信のために、お客様に関する情報を当社の広告代理店および広告配信プラットフォームに提供すること、ならびに他の何らかの方法で広告解析およびパフォーマンスメトリックの解析を実施することも含まれます。\nインターネットを利用した広告の詳細、またはお客様のウェブ閲覧情報が行動ターゲティング広告の目的で使用されることのオプトアウトは、以下いずれかのURLからご利用できます：http://optout.networkadvertising.org\nhttp://www.aboutads.info/choices\nヨーロッパのユーザーは、以下URLにアクセスすることによりターゲット広告の受信をオプトアウトすることができます：\nhttp://www.youronlinechoices.eu/\n当社のサービスにアクセスするために使用する各デバイスおよびブラウザで選択を更新する必要があります。\n\nV. ソーシャル共有機能\n対象サービスにより、お客様におけるソーシャルメディアとの間での活動の共有または対象サービスのリンクを可能とするソーシャル共有機能その他のツールが提供されることがあります。かかる機能を利用することで、ソーシャルメディアプラットフォームにおけるお客様の設定内容に応じて、お客様の友だちまたは公衆との情報共有が可能となります。ソーシャル共有機能に関連するデータの収集および処理の目的ならびに範囲に関する詳細については、当該ソーシャルメディアプラットフォームのプライバシーポリシーをご確認ください。\n\nVI. セキュリティ\n当社は、お客様に関する情報の消失、盗難、不正なアクセス、開示、改変ならびに破損からの保護に資する技術上および組織上の合理的措置を講じています。ただし、インターネット上の伝送のいずれも、セキュアである旨を保証できるものではなく、当社は、お客様からインターネット上で当社に伝送されるいかなる個人情報についてもセキュリティを保証することはできません。\n\nVII. データの保管および削除\n対象サービスを通じて収集された個人情報その他のデータは、いずれも、上記II.の目的にとって必要がなくなった場合には、識別不能化または削除されます。ただし、さらなる保持が法律により義務付けられている場合は、この限りではありません。 \n\nVIII. 国外への転送\n当社がお客様から収集する個人情報の転送、保存および処理は、通常の場合、日本国内で行われますが、場合により、当社は、日本またはGDPRと同等のレベルの個人情報保護制度を有する外国や、その他お客様の国の法律と同一レベルでのデータ保護を提供できない外国の第三者に、お客様の個人情報を開示することがあります。また、当社は、お客様の個人情報を、当社（および当社のグループ会社）または外部事業者が日本国外に設置したサーバで保存する場合があります。ただし、当社は、国外を所在地とする第三者にお客様の個人情報を開示したり、国外でお客様の個人情報を保存したりする場合には、お客様の個人情報が保存され、または取り扱われる国または地域における個人情報の保護に関する制度を把握した上で、当該情報の利用が各地域の法律に従ったものとなる状況を確保するための合理的措置を講じます。\n当社は、以下の国・地域のいずれかに所在する第三者にお客様の情報を開示することがあります。\na) United States of America\nb) United Arab Emirates\nc) Republic of India\nd) Republik Indonesia\ne) Ukraine\nf) Commonwealth of Australia\ng) Canada\nh) Kingdom of Cambodia\ni) Republic of Singapore\nj) Swiss Confederation\nk) Kingdom of Thailand\nl) Republic of Korea\nm) Taiwan\nn) Republic of Turkey\no) New Zealand\np) Republic of the Philippines\nq) Federative Republic of Brazil\nr) Hong Kong\ns) Malaysia\nt) United Mexican States\nu) Lao People's Democratic Republic\nv) Argentine Republic\nw) Principality of Andorra\nx) State of Israel\ny) Oriental Republic of Uruguay\nz) United Kingdom of Great Britain and Northern Ireland\naa) Bailiwick of Jersey\nbb) Bailiwick of Guernsey\ncc) Isle of Man\ndd) Faroe Islands\nee) State of Qatar\nff) Republic of Costa Rica\ngg) Republic of Tunisia\nhh) Republic of Panama\nii) Republic of Peru\njj) Republic of South Africa\nkk) Kingdom of Morocco\nll) Mongolia\n\n前項の各国・地域における個人情報の保護に関する制度の概要は、以下をご参照ください。\na) 個人情報保護委員会 　https://www.ppc.go.jp/index.html\nb) 外国における個人情報の保護に関する制度等の調査 　https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/\nc) GDPR（一般データ保護規則）越境データ移転　https://www.ppc.go.jp/enforcement/infoprovision/laws/GDPR/\n\nIX. 第三者のサイト\n対象サービスには、第三者により運営されている他のウェブサイトまたはサービスへのリンクが含まれていることがあります。本プライバシーポリシーは対象サービスのみに適用されるものであり、第三者がそのウェブサイトを通じて収集、保管および利用することのある個人情報について当社が責任を負うことはできませんので、その旨ご留意ください。お客様において、訪問先の各ウェブサイトのプライバシーポリシーに必ず目を通す必要があります。\n\nX. プッシュ通知/アラート\n当社は、プッシュ通知またはアラートをお客様のデバイスに送信することがあります。お客様は、ご自身のデバイスの通知設定を変更することにより、かかるメッセージ送信をいつでも非アクティブ化することができます。プロモーション用コンテンツ付きのプッシュ通知またはアラートが当社から送信されるのは、当該メッセージの受領についてお客様のデバイスにおけるお客様による事前オプトインがあった後に限られます。\n\nXI. データ保護の権利\n当社は、お客様（お客様が未成年の場合においてはお客様の法定代理人も同様です）から請求があったときには、法令に従い、適切に対応いたします。適用法上のお客様の権利に含まれ得るものの例としては、以下が挙げられます。\na) お客様において、お客様の個人情報または当社によるその第三者への提供の記録の開示を当社に求める場合。\nb) 当社が保有するお客様の個人情報が事実でないために、お客様において当社にその訂正、追加または削除を求める場合。\nc) 当社が違法にお客様の個人情報を取得し、利用し、または第三者に提供しているとして、お客様において当社にその利用もしくは第三者への提供の停止または消去を求める場合。\nd) 当社においてお客様の個人情報を利用する必要がなくなった、または当社が保有するお客様の個人情報について漏えい・滅失・毀損などが生じた、その他当社によるお客様の個人情報の取扱いによってお客様の権利または正当な利益が害されるおそれがあるなどの理由により、お客様において当社に個人情報の利用もしくは第三者への提供の停止または消去を求める場合。\ne) また、お客様は、当社の正当な利益に基づくお客様の個人情報の処理について、いつでも異議申立ての権利を有します。\nf) 当社がお客様の個人情報をダイレクトマーケティングの目的で処理する場合、お客様は、いつでも当該処理について異議申立ての権利を有します。これには、ダイレクトマーケティングに関係する限りにおいてはお客様のカテゴリーの傾向分析目的も含みます。お客様がダイレクトマーケティング目的での処理に異議を申し立てた場合、その後、当社は、当該目的でのお客様の個人情報の処理を行いません。この場合においても、当社は、両者間で継続中の取引関係に関する限りにおいて、取引上または関係上のメッセージを引き続きお客様に送信することがあります。\ng) お客様はこれらの権利を行使することにより、当社から他のユーザーと区別および差別されることはありません。\nこれらの請求を行うには、下記XII.の当社問い合わせ窓口より、申請いただく必要があります。なお、法定代理人その他の代理人による請求の場合、別途当社の指定する代理権を証する資料を郵送または送信いただく必要があります。\nお客様に対する個人情報の利用目的の通知および個人情報またはその第三者への提供の記録の開示の請求につきましては、別途当社窓口よりご案内する金額の手数料をいただきます。\nお客様は、お客様からの依頼に対する当社の対応方法がお客様にとって満足のいくものではなかった場合には、お客様の居住国に不服を申し立てることのできる監督当局が存在する場合、当該監督当局に不服を申し立てることができます。当社は、かかる権利がお客様により行使された場合においても、異なるレベルのサービスを提供するわけではありません。ただし、お客様は、対象サービスの適切な機能の確保にとって必要となる情報の収集の削除または収集停止を依頼した場合には、対象サービスの全部または一部の利用ができなくなることがあります。\nお客様がバンダイナムコIDを有している場合においてご自身のアカウントの閲覧または削除を希望するときは、ご自身のバンダイナムコIDにサインインしたうえで、https://www.bandainamcoid.com/portal/resignの説明内容に沿って手続をお願いいたします。お客様がご自身のアカウントを削除した後においては、お客様のアカウントに関係する一切の個人情報が削除され、お客様はバンダイナムコIDサービスにアクセスできなくなります。\n\nXII. 問い合わせ先\n本プライバシーポリシーまたは当社の方針に関してご不明な点などがございましたら、以下の当社窓口までお問い合わせください。\n株式会社バンダイナムコオンライン\n担当部署：個人情報対外窓口\n〒108-0014 東京都港区芝5-37-8\nprivacy@bandainamco-ol.co.jp\n\n以上\n制定　2022年11月1日",
        "sort_id": 1
    }
]