#ifndef UE4SS_SDK_SkyBlue_HPP
#define UE4SS_SDK_SkyBlue_HPP

#include "SkyBlue_enums.hpp"

struct FAcceptedQuestInfo
{
    int32 QuestIndex;                                                                 // 0x0000 (size: 0x4)
    EQuestStatus Status;                                                              // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    int32 CurStep;                                                                    // 0x0008 (size: 0x4)
    char padding_1[0x4];                                                              // 0x000C (size: 0x4)
    FString Progress;                                                                 // 0x0010 (size: 0x10)
    FQuestProgressInfo ProgressInfo;                                                  // 0x0020 (size: 0x10)
    int32 ClearCount;                                                                 // 0x0030 (size: 0x4)
    int32 SelfContributionPoint;                                                      // 0x0034 (size: 0x4)
    int32 TeamContributionPoint;                                                      // 0x0038 (size: 0x4)
    int32 DamageRate;                                                                 // 0x003C (size: 0x4)
    int32 RankingRank;                                                                // 0x0040 (size: 0x4)
    char padding_2[0x4];                                                              // 0x0044 (size: 0x4)
    int64 UpdatedAt;                                                                  // 0x0048 (size: 0x8)
    int64 RevivalAt;                                                                  // 0x0050 (size: 0x8)
    int32 ResponseCode;                                                               // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FAchievementMasterData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    int32 SortId;                                                                     // 0x0004 (size: 0x4)
    FSBTextTableHash Name;                                                            // 0x0008 (size: 0x4)
    FSBTextTableHash Desc;                                                            // 0x000C (size: 0x4)
    int32 LargeCategoryId;                                                            // 0x0010 (size: 0x4)
    int32 MediumCategoryId;                                                           // 0x0014 (size: 0x4)
    bool Flag;                                                                        // 0x0018 (size: 0x1)
    ESBAchievementMasterTitleFlag TitleFlag;                                          // 0x0019 (size: 0x1)
    char padding_0[0x2];                                                              // 0x001A (size: 0x2)
    int32 Rank;                                                                       // 0x001C (size: 0x4)
    int32 ObjectKind;                                                                 // 0x0020 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0024 (size: 0x4)
    FString ObjectId;                                                                 // 0x0028 (size: 0x10)
    int32 ObjectNum;                                                                  // 0x0038 (size: 0x4)
    int32 ValidConditionId;                                                           // 0x003C (size: 0x4)
    int32 ValidConditionKind;                                                         // 0x0040 (size: 0x4)
    int32 ValidConditionKindValue;                                                    // 0x0044 (size: 0x4)
    FString TermId;                                                                   // 0x0048 (size: 0x10)
    int32 EvaluationType;                                                             // 0x0058 (size: 0x4)
    char padding_2[0x4];                                                              // 0x005C (size: 0x4)
    FDateTime Date;                                                                   // 0x0060 (size: 0x8)
    TArray<FString> RewardIdList;                                                     // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAkEventSwitch
{
    class UAkAudioEvent* Event;                                                       // 0x0000 (size: 0x8)
    TArray<FAkSwitch> Switch;                                                         // 0x0008 (size: 0x10)
    ESBAkEventLOD LOD;                                                                // 0x0018 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0019 (size: 0x3)
    float DelayTime;                                                                  // 0x001C (size: 0x4)

}; // Size: 0x20

struct FAkEventVariables
{
    class UAkAudioEvent* Event;                                                       // 0x0000 (size: 0x8)
    TArray<FAkSwitch> Switch;                                                         // 0x0008 (size: 0x10)
    FName AttachName;                                                                 // 0x0018 (size: 0x8)
    bool AutoDestroy;                                                                 // 0x0020 (size: 0x1)
    bool StopWhenOwnerDestroyed;                                                      // 0x0021 (size: 0x1)
    ESBAkEventLOD LOD;                                                                // 0x0022 (size: 0x1)
    char padding_0[0x5];                                                              // 0x0023 (size: 0x5)
    TArray<FSBAkRTPC> RTPC;                                                           // 0x0028 (size: 0x10)
    float DelayTime;                                                                  // 0x0038 (size: 0x4)
    bool bCanReuseAkComponent;                                                        // 0x003C (size: 0x1)

}; // Size: 0x40

struct FAkSwitch
{
    FString SwitchGroup;                                                              // 0x0000 (size: 0x10)
    FString SwitchState;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAlbumImageInfoData
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    FString ImagePath;                                                                // 0x0010 (size: 0x10)
    FString ThumbnailPath;                                                            // 0x0020 (size: 0x10)
    bool isUsed;                                                                      // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FAnimalWaitParamInfo
{
    FName AnimalName;                                                                 // 0x0000 (size: 0x8)
    class UDataTable* WaitParamTable;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAppearanceWeaponSticker
{
    int32 AppearanceWeaponId;                                                         // 0x0000 (size: 0x4)
    EAppearanceWeaponStickerType StickerType;                                         // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    int32 DurationHours;                                                              // 0x0008 (size: 0x4)
    int32 DurationMinutes;                                                            // 0x000C (size: 0x4)

}; // Size: 0x10

struct FArenaMissionAchieve
{
    EArenaMissionAchieveType Type;                                                    // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float TotalDealDamage;                                                            // 0x0004 (size: 0x4)
    int32 DealDamageAmount;                                                           // 0x0008 (size: 0x4)
    int32 CriticalAmount;                                                             // 0x000C (size: 0x4)
    int32 SkillAmount;                                                                // 0x0010 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0014 (size: 0x4)
    FString KillEnemyId;                                                              // 0x0018 (size: 0x10)
    int32 KillEnemyAmount;                                                            // 0x0028 (size: 0x4)
    int32 ImagineAmount;                                                              // 0x002C (size: 0x4)
    int32 CastSkill;                                                                  // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FArenaMissionInfo
{
    TArray<FArenaMissionAchieve> Achieves;                                            // 0x0000 (size: 0x10)
    TArray<FDataTableRowHandle> StatusAlimentHandle;                                  // 0x0010 (size: 0x10)
    float TimeLimit;                                                                  // 0x0020 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0024 (size: 0x4)
    FText RewardText;                                                                 // 0x0028 (size: 0x18)
    bool bCleared;                                                                    // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FArenaMissionProgressInfo
{
    float TotalDealDamage;                                                            // 0x0000 (size: 0x4)
    int32 DealDamageAmount;                                                           // 0x0004 (size: 0x4)
    int32 CriticalHitAmount;                                                          // 0x0008 (size: 0x4)
    int32 SkillHitAmount;                                                             // 0x000C (size: 0x4)
    int32 KillEnemyAmount;                                                            // 0x0010 (size: 0x4)
    int32 ImagineAmount;                                                              // 0x0014 (size: 0x4)
    int32 CastSkill;                                                                  // 0x0018 (size: 0x4)
    bool bCleared;                                                                    // 0x001C (size: 0x1)

}; // Size: 0x20

struct FAutoStampWordData
{
    FString StampId;                                                                  // 0x0000 (size: 0x10)
    FString FixedPhraseId;                                                            // 0x0010 (size: 0x10)
    ESBAutoMessageTarget MessageTarget;                                               // 0x0020 (size: 0x1)
    bool bIsActive;                                                                   // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FAutoWordUserSetting
{
    TMap<class EAutoWordEventType, class FAutoStampWordData> WordDataList;            // 0x0000 (size: 0x50)
    bool IsDisableAutoStamp;                                                          // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FBattleLevelSyncCommonInfo
{
    int32 Level;                                                                      // 0x0000 (size: 0x4)
    int32 StackBNum;                                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FBattleMemberInfoSend
{
    FString UserId;                                                                   // 0x0000 (size: 0x10)
    FString CharacterId;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBattleMemberLevelSyncInfo
{
    FString UserId;                                                                   // 0x0000 (size: 0x10)
    FString CharacterId;                                                              // 0x0010 (size: 0x10)
    TArray<FBattleLevelSyncCommonInfo> Weapons;                                       // 0x0020 (size: 0x10)
    TArray<FBattleLevelSyncCommonInfo> ImagineActives;                                // 0x0030 (size: 0x10)
    TArray<FBattleLevelSyncCommonInfo> ImaginePassives;                               // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FBeamCollisionOverrideSection
{
    float OverrideSectionEndDist;                                                     // 0x0000 (size: 0x4)
    float OverrideSectionRadius;                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FBerserkerComponentSettings
{
    char padding_0[0x2];                                                              // 0x0000 (size: 0x0)
}; // Size: 0x2

struct FBlockingCollisionActor
{
    char padding_0[0x4];                                                              // 0x0000 (size: 0x0)
}; // Size: 0x4

struct FCameraComponentLocationData
{
    FName SocketName;                                                                 // 0x0000 (size: 0x8)
    float OffsetZ;                                                                    // 0x0008 (size: 0x4)
    bool bIsLocationWeightedAverage;                                                  // 0x000C (size: 0x1)

}; // Size: 0x10

struct FCameraComponentLocationOffsetParam
{
    float ElapsedDeltaTime;                                                           // 0x0000 (size: 0x4)
    float DeltaTime;                                                                  // 0x0004 (size: 0x4)
    FVector Location;                                                                 // 0x0008 (size: 0xC)

}; // Size: 0x14

struct FCameraZoomLevelParam
{
    FString CameraID;                                                                 // 0x0000 (size: 0x10)
    float ZoomLevel;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FCharaClassInfo
{
    ESBClassType Role;                                                                // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 Exp;                                                                        // 0x0004 (size: 0x4)
    int32 ClassMaxDamage;                                                             // 0x0008 (size: 0x4)
    int32 ExtraExp;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FCharaConfigInfo
{
    ESBOperateMode OperateMode;                                                       // 0x0000 (size: 0x1)
    bool OperateModeHelpVisibility;                                                   // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FCharaCreateBoneScaleList
{
    class USBCharaCreateBoneScaleData* C000;                                          // 0x0000 (size: 0x8)
    class USBCharaCreateBoneScaleData* M000;                                          // 0x0008 (size: 0x8)
    class USBCharaCreateBoneScaleData* M100;                                          // 0x0010 (size: 0x8)
    class USBCharaCreateBoneScaleData* M200;                                          // 0x0018 (size: 0x8)
    class USBCharaCreateBoneScaleData* M300;                                          // 0x0020 (size: 0x8)
    class USBCharaCreateBoneScaleData* M400;                                          // 0x0028 (size: 0x8)
    class USBCharaCreateBoneScaleData* M500;                                          // 0x0030 (size: 0x8)
    class USBCharaCreateBoneScaleData* F000;                                          // 0x0038 (size: 0x8)
    class USBCharaCreateBoneScaleData* F100;                                          // 0x0040 (size: 0x8)
    class USBCharaCreateBoneScaleData* F200;                                          // 0x0048 (size: 0x8)
    class USBCharaCreateBoneScaleData* F300;                                          // 0x0050 (size: 0x8)
    class USBCharaCreateBoneScaleData* F400;                                          // 0x0058 (size: 0x8)
    class USBCharaCreateBoneScaleData* F500;                                          // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FCharaEquipInfo
{
    TArray<FCharaEquipItemInfo> EquipItems;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharaEquipItemCharaCreateInfo
{
    ESBCharaEquipType EquipType;                                                      // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FString PartsName;                                                                // 0x0008 (size: 0x10)
    int32 ColorIndex;                                                                 // 0x0018 (size: 0x4)
    int32 ColorSaturation;                                                            // 0x001C (size: 0x4)
    int32 ColorValue;                                                                 // 0x0020 (size: 0x4)
    int32 MaterialId;                                                                 // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FCharaEquipItemInfo
{
    bool EquipFlag;                                                                   // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 ItemIndex;                                                                  // 0x0004 (size: 0x4)
    int32 ColorIndex;                                                                 // 0x0008 (size: 0x4)
    int32 ColorSaturation;                                                            // 0x000C (size: 0x4)
    int32 ColorValue;                                                                 // 0x0010 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0014 (size: 0x4)
    FString ItemUniqueId;                                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCharaSkillMasteryInfo
{
    int32 SkillId;                                                                    // 0x0000 (size: 0x4)
    int32 SkillLevel;                                                                 // 0x0004 (size: 0x4)
    ESkillTreeAbilityType AbilityType;                                                // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCharacterCraftRecepi
{
    int32 RecepiId;                                                                   // 0x0000 (size: 0x4)
    bool IsCrafted;                                                                   // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FCircleEffectParameter
{
    float CircleRadius;                                                               // 0x0000 (size: 0x4)
    FVector CircleSoundOffset;                                                        // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FClimbingPoint
{
    int32 PointID;                                                                    // 0x0000 (size: 0x4)
    int32 GroupId;                                                                    // 0x0004 (size: 0x4)
    FVector LocationOffset;                                                           // 0x0008 (size: 0xC)
    FRotator RotationOffset;                                                          // 0x0014 (size: 0xC)
    float SearchRadius;                                                               // 0x0020 (size: 0x4)
    bool IsSwimmingSearch;                                                            // 0x0024 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0025 (size: 0x3)
    TArray<int32> LinkPointIDList;                                                    // 0x0028 (size: 0x10)
    TEnumAsByte<EClimbingEndPointType> ExitPointType;                                 // 0x0038 (size: 0x1)
    bool Active;                                                                      // 0x0039 (size: 0x1)

}; // Size: 0x40

struct FCollisionHitSetting
{
    bool bIsDisableSelfHit;                                                           // 0x0000 (size: 0x1)
    bool bIsOnlyTargetHit;                                                            // 0x0001 (size: 0x1)
    bool bIsInfinitePierce;                                                           // 0x0002 (size: 0x1)
    char padding_0[0x1];                                                              // 0x0003 (size: 0x1)
    uint8 bIsEnableBlockingHitCheck;                                                  // 0x0004 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0005 (size: 0x3)
    bool bIsEnableHitCover;                                                           // 0x0008 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0009 (size: 0x3)
    FProjectileHitCoverConfig HitCoverConfig;                                         // 0x000C (size: 0x4)
    uint8 bIsHitTargetLimitOnlyOverlap;                                               // 0x0010 (size: 0x1)
    uint8 bIsDisableReHitDelay;                                                       // 0x0010 (size: 0x1)
    uint8 bIsShareHit;                                                                // 0x0010 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0011 (size: 0x3)
    FProjectileShareHitSetting ShareHitConfig;                                        // 0x0014 (size: 0x8)
    uint8 bIsEnableHitForCharacterGround;                                             // 0x001C (size: 0x1)
    uint8 bIsEnableHitFromGroundDist;                                                 // 0x001C (size: 0x1)
    char padding_4[0x3];                                                              // 0x001D (size: 0x3)
    float EnableHitFromGroundDist;                                                    // 0x0020 (size: 0x4)
    uint8 bIsHitOnlyFirstFrame;                                                       // 0x0024 (size: 0x1)
    uint8 bIsEnableSelfHitSlow;                                                       // 0x0024 (size: 0x1)
    uint8 bIsEnableWeakPointHit;                                                      // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FCollisionHitSettingExtended : public FCollisionHitSetting
{
    char padding_0[0x30];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x30

struct FCollisionOnOffData
{
    float Time;                                                                       // 0x0000 (size: 0x4)
    ECollisionOnOff OnOff;                                                            // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FCommonCharacterSave
{
    FString CharacterId;                                                              // 0x0000 (size: 0x10)
    FCraftSave CraftSave;                                                             // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FCommunicateSettingInfo
{
    FString Comment;                                                                  // 0x0000 (size: 0x10)
    ESBTensionTagType TensionTag;                                                     // 0x0010 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0011 (size: 0x7)
    FString CharacterId;                                                              // 0x0018 (size: 0x10)
    FString CharacterShortId;                                                         // 0x0028 (size: 0x10)
    FString CharacterName;                                                            // 0x0038 (size: 0x10)
    ESBClassType ClassType;                                                           // 0x0048 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0049 (size: 0x7)
    TArray<FSBActivityData> Activities;                                               // 0x0050 (size: 0x10)
    ESBProfilePublicSettingType GlobalPublicSetting;                                  // 0x0060 (size: 0x1)
    ESBProfilePublicSettingType BattleInfoPublicSetting;                              // 0x0061 (size: 0x1)
    ESBProfilePublicSettingType ActivitiesPublicSetting;                              // 0x0062 (size: 0x1)
    char padding_2[0x1];                                                              // 0x0063 (size: 0x1)
    int32 AchievementSelected;                                                        // 0x0064 (size: 0x4)
    TArray<FPlayerProfilePhotoTrimmingInfo> PhotoTrimmingInfo;                        // 0x0068 (size: 0x10)
    FString LocationName;                                                             // 0x0078 (size: 0x10)
    FString ZoneId;                                                                   // 0x0088 (size: 0x10)
    FPlayerProfileClassListData ClassDataList;                                        // 0x0098 (size: 0x10)
    bool SendCardFromParty;                                                           // 0x00A8 (size: 0x1)
    bool SendCardReceiveCard;                                                         // 0x00A9 (size: 0x1)
    char padding_3[0x2];                                                              // 0x00AA (size: 0x2)
    int32 ReceiveLikePoint;                                                           // 0x00AC (size: 0x4)
    FSBPlatformInfo PlatformInfo;                                                     // 0x00B0 (size: 0x20)
    TArray<int32> AwardIdList;                                                        // 0x00D0 (size: 0x10)
    int32 AdventureCardFrameId;                                                       // 0x00E0 (size: 0x4)
    int32 CharacterCardFrameId;                                                       // 0x00E4 (size: 0x4)
    int32 AdventureCardBackGroundColorId;                                             // 0x00E8 (size: 0x4)
    bool IsHidden;                                                                    // 0x00EC (size: 0x1)

}; // Size: 0xF0

struct FCompleteQuestDelegateParam
{
    int32 QuestIndex;                                                                 // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FAcceptedQuestInfo AcceptedQuestInfo;                                             // 0x0008 (size: 0x60)
    int32 Exp;                                                                        // 0x0068 (size: 0x4)
    int32 Money;                                                                      // 0x006C (size: 0x4)
    int32 Energy;                                                                     // 0x0070 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0074 (size: 0x4)
    TMap<int32, int32> Items;                                                         // 0x0078 (size: 0x50)
    TArray<FUnlockedQuestInfo> UnlockQuests;                                          // 0x00C8 (size: 0x10)

}; // Size: 0xD8

struct FCompleteQuestResponseData
{
    int32 QuestIndex;                                                                 // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    uint64 UpdatedAt;                                                                 // 0x0008 (size: 0x8)
    int32 ClearCount;                                                                 // 0x0010 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0014 (size: 0x4)
    int64 RevivalAt;                                                                  // 0x0018 (size: 0x8)
    TArray<FOwnItemInfo> Items;                                                       // 0x0020 (size: 0x10)
    int32 Money;                                                                      // 0x0030 (size: 0x4)
    int32 Engram;                                                                     // 0x0034 (size: 0x4)
    int32 BP;                                                                         // 0x0038 (size: 0x4)
    int32 ClassExp;                                                                   // 0x003C (size: 0x4)
    FSBExtraExpParse ClassExtraExp;                                                   // 0x0040 (size: 0x18)
    int32 BPPoint;                                                                    // 0x0058 (size: 0x4)
    int32 RoseOrbFree;                                                                // 0x005C (size: 0x4)
    TArray<FSBMailStampCategories> Stamps;                                            // 0x0060 (size: 0x10)
    TArray<FSBOwnEmoteData> Emotes;                                                   // 0x0070 (size: 0x10)
    TArray<FCharacterCraftRecepi> ImagineRecipes;                                     // 0x0080 (size: 0x10)
    TArray<FCharacterCraftRecepi> CraftRecipes;                                       // 0x0090 (size: 0x10)
    TArray<int32> RecipeSet;                                                          // 0x00A0 (size: 0x10)
    TArray<int32> GainedAchievementIds;                                               // 0x00B0 (size: 0x10)
    TArray<FSBCharacterToken> Tokens;                                                 // 0x00C0 (size: 0x10)
    TArray<FSBLiquidMemoryInfo> LiquidMemory;                                         // 0x00D0 (size: 0x10)
    TArray<int32> AdventureBoardIds;                                                  // 0x00E0 (size: 0x10)
    int32 VanishedMoney;                                                              // 0x00F0 (size: 0x4)
    int32 VanishedExp;                                                                // 0x00F4 (size: 0x4)
    int32 VanishedCoins;                                                              // 0x00F8 (size: 0x4)
    int32 VanishedCurrencies;                                                         // 0x00FC (size: 0x4)
    int32 VanishedGc;                                                                 // 0x0100 (size: 0x4)
    char padding_2[0x4];                                                              // 0x0104 (size: 0x4)
    TArray<int32> VanishedAchievements;                                               // 0x0108 (size: 0x10)
    TArray<FSBCharacterToken> VanishedTokens;                                         // 0x0118 (size: 0x10)
    TArray<FOwnItemInfo> SoldItems;                                                   // 0x0128 (size: 0x10)
    int32 SoldProfit;                                                                 // 0x0138 (size: 0x4)
    char padding_3[0x4];                                                              // 0x013C (size: 0x4)
    int32 ResponseCode;                                                               // 0x0140 (size: 0x4)

}; // Size: 0x148

struct FConfigSaveData_GraphicsUser
{
    FString PlayerId;                                                                 // 0x0000 (size: 0x10)
    bool bIsShowNamePlateParty;                                                       // 0x0010 (size: 0x1)
    bool bIsShowNamePlateOther;                                                       // 0x0011 (size: 0x1)
    bool bIsAlwaysShowFieldHUD;                                                       // 0x0012 (size: 0x1)
    TEnumAsByte<ESBPlayerVisibleLimit::Type> PlayerVisibleType;                       // 0x0013 (size: 0x1)
    bool bIsTeamTagVisible;                                                           // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FConfigSaveData_VFX
{
    TMap<class ESBBattleEffectVisibleCategory, class FConfigSaveData_VFXItem> VisibleType; // 0x0000 (size: 0x50)
    bool IsCustom;                                                                    // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FConfigSaveData_VFXItem
{
    bool Category;                                                                    // 0x0000 (size: 0x1)
    bool AttackDirectingVfx;                                                          // 0x0001 (size: 0x1)
    bool AreaAttackVfx;                                                               // 0x0002 (size: 0x1)
    bool AreaHealVfx;                                                                 // 0x0003 (size: 0x1)
    bool RangeAttackVfx;                                                              // 0x0004 (size: 0x1)
    bool BattleImagineVfx;                                                            // 0x0005 (size: 0x1)
    bool ULTVfx;                                                                      // 0x0006 (size: 0x1)

}; // Size: 0x7

struct FContactListData
{
    FString PlayerId;                                                                 // 0x0000 (size: 0x10)
    FString CharacterId;                                                              // 0x0010 (size: 0x10)
    FString CharacterName;                                                            // 0x0020 (size: 0x10)
    FString FaceIconUrl;                                                              // 0x0030 (size: 0x10)
    int32 ClassLevel;                                                                 // 0x0040 (size: 0x4)
    ESBClassType ClassType;                                                           // 0x0044 (size: 0x1)
    bool bIsFriend;                                                                   // 0x0045 (size: 0x1)
    bool bIsActive;                                                                   // 0x0046 (size: 0x1)
    char padding_0[0x1];                                                              // 0x0047 (size: 0x1)
    FString ShotComment;                                                              // 0x0048 (size: 0x10)
    int32 LeftDay;                                                                    // 0x0058 (size: 0x4)
    char padding_1[0x4];                                                              // 0x005C (size: 0x4)
    FString TimesLeft;                                                                // 0x0060 (size: 0x10)
    ESBTensionTagType TensionTag;                                                     // 0x0070 (size: 0x1)
    bool IsOnline;                                                                    // 0x0071 (size: 0x1)
    bool CanSendCard;                                                                 // 0x0072 (size: 0x1)
    bool bSendLike;                                                                   // 0x0073 (size: 0x1)
    int32 OnlineStatus;                                                               // 0x0074 (size: 0x4)
    FSBPlatformInfo PlatformInfo;                                                     // 0x0078 (size: 0x20)
    bool bPartyMember;                                                                // 0x0098 (size: 0x1)
    bool bPartyLeader;                                                                // 0x0099 (size: 0x1)
    char padding_2[0x6];                                                              // 0x009A (size: 0x6)
    FString LastLogin;                                                                // 0x00A0 (size: 0x10)
    FDateTime LastExchangeDate;                                                       // 0x00B0 (size: 0x8)
    FDateTime FriendRegistratedDate;                                                  // 0x00B8 (size: 0x8)

}; // Size: 0xC0

struct FCostumeData
{
    int32 ColorIndex;                                                                 // 0x0000 (size: 0x4)
    int32 MaterialId;                                                                 // 0x0004 (size: 0x4)
    int32 ColorSaturation;                                                            // 0x0008 (size: 0x4)
    int32 ColorValue;                                                                 // 0x000C (size: 0x4)
    bool IsTermLimited;                                                               // 0x0010 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0011 (size: 0x7)
    FDateTime ExpiryDateTime;                                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FCraftMasterData
{
    int32 RecepiId;                                                                   // 0x0000 (size: 0x4)
    bool IsItem;                                                                      // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    int32 OutItemId;                                                                  // 0x0008 (size: 0x4)
    int32 OutItemNum;                                                                 // 0x000C (size: 0x4)
    int32 UseTicketUnit;                                                              // 0x0010 (size: 0x4)
    int32 MinLevel;                                                                   // 0x0014 (size: 0x4)
    int32 MaxLevel;                                                                   // 0x0018 (size: 0x4)
    int32 BonusRate;                                                                  // 0x001C (size: 0x4)
    int32 GrateSuccessGrantsFloor;                                                    // 0x0020 (size: 0x4)
    int32 GrateSuccessGrantsCeil;                                                     // 0x0024 (size: 0x4)
    int32 Money;                                                                      // 0x0028 (size: 0x4)
    int32 Difficulty;                                                                 // 0x002C (size: 0x4)
    bool IsAutoRelease;                                                               // 0x0030 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0031 (size: 0x7)
    FString KillerPerkPickId;                                                         // 0x0038 (size: 0x10)
    FCraftSlotRate SlotRate;                                                          // 0x0048 (size: 0x20)
    TArray<FCraftNeedItems> NeedItems;                                                // 0x0068 (size: 0x10)
    FString EventTermId;                                                              // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FCraftNeedItems
{
    int32 ItemId;                                                                     // 0x0000 (size: 0x4)
    int32 Num;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCraftSave
{
    FString CharacterId;                                                              // 0x0000 (size: 0x10)
    bool CraftMachineStorage;                                                         // 0x0010 (size: 0x1)
    bool ImagineCraftStorage;                                                         // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FCraftSlotRate
{
    int32 Slot1BaseRate;                                                              // 0x0000 (size: 0x4)
    int32 Slot2BaseRate;                                                              // 0x0004 (size: 0x4)
    int32 Slot3BaseRate;                                                              // 0x0008 (size: 0x4)
    int32 Slot4BaseRate;                                                              // 0x000C (size: 0x4)
    int32 Slot1BonusRate;                                                             // 0x0010 (size: 0x4)
    int32 Slot2BonusRate;                                                             // 0x0014 (size: 0x4)
    int32 Slot3BonusRate;                                                             // 0x0018 (size: 0x4)
    int32 Slot4BonusRate;                                                             // 0x001C (size: 0x4)

}; // Size: 0x20

struct FCraftToken
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    ESBCraftTokenType Type;                                                           // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    int32 Ratio;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCustomFlagInfo
{
    FString Name;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FDelayValidHitOverlapCauseInfo
{
    char padding_0[0xA8];                                                             // 0x0000 (size: 0x0)
}; // Size: 0xA8

struct FDemoSoundData
{
    char padding_0[0x28];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x28

struct FDigitalSignageMasterData
{
    FString GroupId;                                                                  // 0x0000 (size: 0x10)
    FString TermId;                                                                   // 0x0010 (size: 0x10)
    FString TextureName;                                                              // 0x0020 (size: 0x10)
    EDigitalSignageDataType DataType;                                                 // 0x0030 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0031 (size: 0x3)
    int32 TextureCnt;                                                                 // 0x0034 (size: 0x4)
    int32 Priority;                                                                   // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FDigitalSignageTextrueParam
{
    FString TextureName;                                                              // 0x0000 (size: 0x10)
    EDigitalSignageDataType DataType;                                                 // 0x0010 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0011 (size: 0x3)
    int32 TextureCnt;                                                                 // 0x0014 (size: 0x4)
    FString TarmId;                                                                   // 0x0018 (size: 0x10)
    int32 Priority;                                                                   // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDungeonClearConditionInfo
{
    TArray<FDungeonClearConditionStepInfo> Steps;                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDungeonClearConditionItemInfo
{
    EDungeonClearConditionType Type;                                                  // 0x0000 (size: 0x1)
    bool bProgressTextOverride;                                                       // 0x0001 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0002 (size: 0x2)
    FName EnemyId;                                                                    // 0x0004 (size: 0x8)
    int32 EnemyAmount;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FDungeonClearConditionProgressInfo
{
    TArray<FDungeonClearConditionProgressStepInfo> Steps;                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDungeonClearConditionProgressItemInfo
{
    int32 KillEnemyCount;                                                             // 0x0000 (size: 0x4)
    bool bCleared;                                                                    // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FDungeonClearConditionProgressStepInfo
{
    TArray<FDungeonClearConditionProgressItemInfo> ProgressItems;                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDungeonClearConditionStepInfo
{
    TArray<FDungeonClearConditionItemInfo> ConditionItems;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FEditorStreamingDependencies
{
    FName BaseLevel;                                                                  // 0x0000 (size: 0x8)
    TArray<FName> DependentLevels;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FEffectActorParameter
{
    uint8 bIsEnable;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftClassPtr<ASBProjectileEffect> EffectActor;                                   // 0x0008 (size: 0x28)
    uint8 bIsAttach;                                                                  // 0x0030 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0031 (size: 0x3)
    EProjectileEffectAttachTargetType AttachTargetType;                               // 0x0034 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0035 (size: 0x3)
    FName AttachPointName;                                                            // 0x0038 (size: 0x8)
    FVector Offset;                                                                   // 0x0040 (size: 0xC)
    FRotator RotOffset;                                                               // 0x004C (size: 0xC)
    uint8 bIsLinkDestroyOnAttached;                                                   // 0x0058 (size: 0x1)
    uint8 bIsLinkDestroy;                                                             // 0x0058 (size: 0x1)

}; // Size: 0x60

struct FEnemyDeadNotifyInfo
{
    FString EnemyId;                                                                  // 0x0000 (size: 0x10)
    int32 EnemyLevel;                                                                 // 0x0010 (size: 0x4)
    int32 Engram;                                                                     // 0x0014 (size: 0x4)
    int32 Exp;                                                                        // 0x0018 (size: 0x4)
    int32 ExtraExp;                                                                   // 0x001C (size: 0x4)
    int32 Money;                                                                      // 0x0020 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0024 (size: 0x4)
    TArray<FEnemyDropItemInfo> PassiveDropItems;                                      // 0x0028 (size: 0x10)
    TArray<FSBCharacterToken> DropEventTokens;                                        // 0x0038 (size: 0x10)
    TArray<FOwnItemInfo> IgnoredItems;                                                // 0x0048 (size: 0x10)
    FDateTime Timestamp;                                                              // 0x0058 (size: 0x8)
    TArray<FSBDungeonSupply> PassiveDropSupply;                                       // 0x0060 (size: 0x10)
    bool IsDropRateUpLiquidMemoryEfficacyApplied;                                     // 0x0070 (size: 0x1)
    bool IsExpUpLiquidMemoryEfficacyApplied;                                          // 0x0071 (size: 0x1)

}; // Size: 0x78

struct FEnemyDropItemInfo
{
    FString UniqueId;                                                                 // 0x0000 (size: 0x10)
    int32 StorageNumber;                                                              // 0x0010 (size: 0x4)
    EItemType ItemType;                                                               // 0x0014 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0015 (size: 0x3)
    int32 ItemIndex;                                                                  // 0x0018 (size: 0x4)
    int32 Amount;                                                                     // 0x001C (size: 0x4)
    int32 DiffAmount;                                                                 // 0x0020 (size: 0x4)
    bool bIsIdentified;                                                               // 0x0024 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0025 (size: 0x3)
    double DefaultOrder;                                                              // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FEnemyParamMasterData
{
    FName EnemyId;                                                                    // 0x0000 (size: 0x8)
    FSBTextTableHash NameId;                                                          // 0x0008 (size: 0x4)
    FName AppearanceId;                                                               // 0x000C (size: 0x8)
    FSBEnemyAppearanceData AppearanceData;                                            // 0x0014 (size: 0x74)
    TArray<FSBEnemyLevelParamData> LevelParams;                                       // 0x0088 (size: 0x10)
    TArray<FSBEnemyDropItemData> DropItems;                                           // 0x0098 (size: 0x10)
    TArray<FSBEnemySkillParamData> SkillParams;                                       // 0x00A8 (size: 0x10)
    int32 BossClass;                                                                  // 0x00B8 (size: 0x4)
    float ElemDmgBias;                                                                // 0x00BC (size: 0x4)
    float DurabilityScale;                                                            // 0x00C0 (size: 0x4)
    int32 ResistRate;                                                                 // 0x00C4 (size: 0x4)
    int32 ResistDot;                                                                  // 0x00C8 (size: 0x4)
    int32 EnemyLibActiveTime;                                                         // 0x00CC (size: 0x4)
    ESBBattleBGMType BattleBGMType;                                                   // 0x00D0 (size: 0x1)

}; // Size: 0xD8

struct FEquipableClass
{
    TArray<bool> Classes;                                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FEquipedArtsInfo
{
    ESBClassType ClassType;                                                           // 0x0000 (size: 0x1)
    ESBPlayerArtsType ArtsType;                                                       // 0x0001 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0002 (size: 0x2)
    int32 ArtsId;                                                                     // 0x0004 (size: 0x4)
    int32 SlotId;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FEquipedArtsListInfo
{
    TArray<FEquipedArtsInfo> InfoList;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FExchangeShopExchangingItemInfo
{
    FExchangeShopItemInfo ExchangeItemInfo;                                           // 0x0000 (size: 0x28)
    int32 ExchangeNum;                                                                // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FExchangeShopItemInfo
{
    FString ShopId;                                                                   // 0x0000 (size: 0x10)
    int32 Index;                                                                      // 0x0010 (size: 0x4)
    EItemType ItemType;                                                               // 0x0014 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0015 (size: 0x3)
    int32 ItemIndex;                                                                  // 0x0018 (size: 0x4)
    int32 ItemNum;                                                                    // 0x001C (size: 0x4)
    int32 BravePointCost;                                                             // 0x0020 (size: 0x4)
    int32 ExchangeLimit;                                                              // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FFieldActorBuffPointByMapNotifyInfo
{
    int32 FreeBuffPointId;                                                            // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FString FreeBuffTag;                                                              // 0x0008 (size: 0x10)
    FString GameContentId;                                                            // 0x0018 (size: 0x10)
    char padding_1[0x10];                                                             // 0x0028 (size: 0x10)
    ESBFreeBuffPointView PointView;                                                   // 0x0038 (size: 0x1)
    bool IsActivate;                                                                  // 0x0039 (size: 0x1)
    char padding_2[0x6];                                                              // 0x003A (size: 0x6)
    FDateTime UpdateAt;                                                               // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FFieldActorBuffPointNotifyInfo
{
    FString MapName;                                                                  // 0x0000 (size: 0x10)
    FString FreeBuffPointId;                                                          // 0x0010 (size: 0x10)
    FDateTime InteractAt;                                                             // 0x0020 (size: 0x8)
    TArray<ESBFreeBuffPointType> BuffTypes;                                           // 0x0028 (size: 0x10)
    FDateTime EndBuffAt;                                                              // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FFieldActorBuffPointRespawnCheckResult
{
    FString MapName;                                                                  // 0x0000 (size: 0x10)
    FString FreeBuffPointId;                                                          // 0x0010 (size: 0x10)
    TArray<FSBLiquidMemoryInfo> LiquidMemoryInfos;                                    // 0x0020 (size: 0x10)
    bool bIsLiquidMemoryInfoValid;                                                    // 0x0030 (size: 0x1)
    bool IsReturnCity;                                                                // 0x0031 (size: 0x1)
    bool IsInteracted;                                                                // 0x0032 (size: 0x1)

}; // Size: 0x38

struct FFieldActorPickupNotifyInfo
{
    FString MapName;                                                                  // 0x0000 (size: 0x10)
    FString GatherPointId;                                                            // 0x0010 (size: 0x10)
    FDateTime GatheredAt;                                                             // 0x0020 (size: 0x8)
    FDateTime RespawnAt;                                                              // 0x0028 (size: 0x8)
    int32 Money;                                                                      // 0x0030 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0034 (size: 0x4)
    TArray<FOwnItemInfo> PassiveDropItems;                                            // 0x0038 (size: 0x10)
    TArray<FOwnItemInfo> IgnoredItems;                                                // 0x0048 (size: 0x10)
    int32 OverLimitCurrencies;                                                        // 0x0058 (size: 0x4)
    int32 OverLimitBPCoin;                                                            // 0x005C (size: 0x4)
    TArray<FSBLiquidMemoryInfo> LiquidMemoryInfos;                                    // 0x0060 (size: 0x10)
    bool bIsLiquidMemoryInfoValid;                                                    // 0x0070 (size: 0x1)
    ESBTreasureBoxRarity GatherType;                                                  // 0x0071 (size: 0x1)
    ESBDayTime TimeZone;                                                              // 0x0072 (size: 0x1)
    bool bIsBonusAdd;                                                                 // 0x0073 (size: 0x1)

}; // Size: 0x78

struct FFieldActorRespawnCheckResult
{
    FString MapName;                                                                  // 0x0000 (size: 0x10)
    FString GatherPointId;                                                            // 0x0010 (size: 0x10)
    TArray<FSBLiquidMemoryInfo> LiquidMemoryInfos;                                    // 0x0020 (size: 0x10)
    bool bIsLiquidMemoryInfoValid;                                                    // 0x0030 (size: 0x1)
    bool IsFiexedRespawn;                                                             // 0x0031 (size: 0x1)
    bool IsReturnCity;                                                                // 0x0032 (size: 0x1)
    bool IsGathered;                                                                  // 0x0033 (size: 0x1)

}; // Size: 0x38

struct FFilterGroup
{
    TArray<TEnumAsByte<EItemFilterType::Type>> Filters;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameServerMasterData
{
    FString MapName;                                                                  // 0x0000 (size: 0x10)
    FString Address;                                                                  // 0x0010 (size: 0x10)
    FString Name;                                                                     // 0x0020 (size: 0x10)
    bool bIsAlive;                                                                    // 0x0030 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0031 (size: 0x3)
    int32 ClientCount;                                                                // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FGameplayCameraSettings : public FTableRowBase
{
    bool Active;                                                                      // 0x0008 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0009 (size: 0x7)
    FString CameraID;                                                                 // 0x0010 (size: 0x10)
    FPlayerCameraData CameraData;                                                     // 0x0020 (size: 0x178)
    TEnumAsByte<ECameraPriority> CameraPriority;                                      // 0x0198 (size: 0x1)

}; // Size: 0x1B0

struct FGatherPointLotResult
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int32 Amount;                                                                     // 0x0004 (size: 0x4)
    ESBTreasureBoxRewardType Type;                                                    // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGroundHitEffectByMaterial
{
    TEnumAsByte<EPhysicalSurface> SurfaceType;                                        // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> HitParticle;                                      // 0x0008 (size: 0x28)
    TSoftClassPtr<ASBProjectileEffect> HitActor;                                      // 0x0030 (size: 0x28)
    FAkEventSwitch AkEventSwitch;                                                     // 0x0058 (size: 0x20)

}; // Size: 0x78

struct FGuildActivity
{
    EGuildActivityType Kind;                                                          // 0x0000 (size: 0x1)
    char padding_0[0x97];                                                             // 0x0001 (size: 0x97)
    FDateTime CreatedAt;                                                              // 0x0098 (size: 0x8)

}; // Size: 0xA0

struct FGuildChangeData
{
    FString Comment;                                                                  // 0x0000 (size: 0x10)
    TArray<ESBGuildActivityTime> ActivityTime;                                        // 0x0010 (size: 0x10)
    TEnumAsByte<EGuildAcceptType::Type> AcceptType;                                   // 0x0020 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0021 (size: 0x7)
    TArray<TEnumAsByte<EGuildAttribute::Type>> Attributes;                            // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FGuildData
{
    FString GuildId;                                                                  // 0x0000 (size: 0x10)
    FString GuildShortId;                                                             // 0x0010 (size: 0x10)
    FString GuildName;                                                                // 0x0020 (size: 0x10)
    FString GuildShortName;                                                           // 0x0030 (size: 0x10)
    FString Comment;                                                                  // 0x0040 (size: 0x10)
    bool IsEntry;                                                                     // 0x0050 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0051 (size: 0x7)
    FString LeaderName;                                                               // 0x0058 (size: 0x10)
    TArray<ESBGuildActivityTime> ActivityTime;                                        // 0x0068 (size: 0x10)
    TEnumAsByte<EGuildAcceptType::Type> AcceptType;                                   // 0x0078 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0079 (size: 0x7)
    TArray<TEnumAsByte<EGuildAttribute::Type>> Attributes;                            // 0x0080 (size: 0x10)
    int32 MemberNow;                                                                  // 0x0090 (size: 0x4)
    int32 MemberMax;                                                                  // 0x0094 (size: 0x4)
    int32 Experience;                                                                 // 0x0098 (size: 0x4)
    char padding_2[0x4];                                                              // 0x009C (size: 0x4)
    FDateTime CreatedAt;                                                              // 0x00A0 (size: 0x8)
    int32 RenameTokenNum;                                                             // 0x00A8 (size: 0x4)
    int32 leader_ps_only;                                                             // 0x00AC (size: 0x4)
    int32 ps_only;                                                                    // 0x00B0 (size: 0x4)

}; // Size: 0xB8

struct FGuildData_CS
{
    ESBPlatformType LastGuildNameEditorPlatformType;                                  // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FString LastGuildNameEditorPlatformOnlineID;                                      // 0x0008 (size: 0x10)
    FString LastGuildNameEditorUserId;                                                // 0x0018 (size: 0x10)
    FString LastGuildNameEditorCharacterId;                                           // 0x0028 (size: 0x10)
    ESBPlatformType LeaderPlatformType;                                               // 0x0038 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0039 (size: 0x7)
    FString LeaderPlatformOnlineID;                                                   // 0x0040 (size: 0x10)
    ESBPlatformType LastCommentEditorPlatformType;                                    // 0x0050 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0051 (size: 0x7)
    FString LastCommentEditorPlatformOnlineID;                                        // 0x0058 (size: 0x10)
    FString LastCommentEditorUserId;                                                  // 0x0068 (size: 0x10)
    FString LastCommentEditorCharacterId;                                             // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FGuildEntryData
{
    FString EntryId;                                                                  // 0x0000 (size: 0x10)
    FString GuildId;                                                                  // 0x0010 (size: 0x10)
    FString GuildName;                                                                // 0x0020 (size: 0x10)
    FString GuildTag;                                                                 // 0x0030 (size: 0x10)
    FString UserId;                                                                   // 0x0040 (size: 0x10)
    FString CharacterId;                                                              // 0x0050 (size: 0x10)
    FString CharacterName;                                                            // 0x0060 (size: 0x10)
    int32 ClassLevel;                                                                 // 0x0070 (size: 0x4)
    ESBClassType ClassType;                                                           // 0x0074 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0075 (size: 0x3)
    FString Comment;                                                                  // 0x0078 (size: 0x10)
    bool IsInvite;                                                                    // 0x0088 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0089 (size: 0x3)
    int32 DaysLeft;                                                                   // 0x008C (size: 0x4)
    FString TimesLeft;                                                                // 0x0090 (size: 0x10)
    bool IsPSOnly_Target;                                                             // 0x00A0 (size: 0x1)

}; // Size: 0xA8

struct FGuildMemberData
{
    FString GuildId;                                                                  // 0x0000 (size: 0x10)
    FString MemberUserId;                                                             // 0x0010 (size: 0x10)
    FString MemberCharacterId;                                                        // 0x0020 (size: 0x10)
    FString CharacterName;                                                            // 0x0030 (size: 0x10)
    int32 ClassLevel;                                                                 // 0x0040 (size: 0x4)
    ESBClassType ClassType;                                                           // 0x0044 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0045 (size: 0x3)
    FString FaceIcon;                                                                 // 0x0048 (size: 0x10)
    FString Comment;                                                                  // 0x0058 (size: 0x10)
    TEnumAsByte<EGuildMemberRole::Type> GuildMemberRole;                              // 0x0068 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0069 (size: 0x7)
    FString LastLogin;                                                                // 0x0070 (size: 0x10)
    bool bNowOnline;                                                                  // 0x0080 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0081 (size: 0x3)
    int32 OnlineStatus;                                                               // 0x0084 (size: 0x4)
    FString EntryId;                                                                  // 0x0088 (size: 0x10)
    bool bSendLike;                                                                   // 0x0098 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0099 (size: 0x7)
    FSBPlatformInfo PlatformInfo;                                                     // 0x00A0 (size: 0x20)
    bool bPartyMember;                                                                // 0x00C0 (size: 0x1)
    bool bPartyLeader;                                                                // 0x00C1 (size: 0x1)
    bool bFriend;                                                                     // 0x00C2 (size: 0x1)
    ESBTensionTagType TensionTag;                                                     // 0x00C3 (size: 0x1)
    bool isAdventureCardSend;                                                         // 0x00C4 (size: 0x1)
    bool isAdventureCardDoneSend;                                                     // 0x00C5 (size: 0x1)
    char padding_4[0x2];                                                              // 0x00C6 (size: 0x2)
    FDateTime LastLogInDataTime;                                                      // 0x00C8 (size: 0x8)
    FDateTime FriendRegistratedDate;                                                  // 0x00D0 (size: 0x8)

}; // Size: 0xD8

struct FGuildRank
{
    int32 Rank;                                                                       // 0x0000 (size: 0x4)
    int32 NeedExp;                                                                    // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGuildRankUnlockMaster
{
    int32 Rank;                                                                       // 0x0000 (size: 0x4)
    FSBTextTableHash TextId;                                                          // 0x0004 (size: 0x4)
    FSBTextTableHash DescID;                                                          // 0x0008 (size: 0x4)

}; // Size: 0x20

struct FGuildRepData
{
    FString GuildId;                                                                  // 0x0000 (size: 0x10)
    FString GuildName;                                                                // 0x0010 (size: 0x10)
    FString GuildShortName;                                                           // 0x0020 (size: 0x10)
    FString LastGuildNameEditorCharacterId;                                           // 0x0030 (size: 0x10)
    FString LastCommentEditorCharacterId;                                             // 0x0040 (size: 0x10)
    TEnumAsByte<EGuildMemberRole::Type> GuildMemberRole;                              // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FHairColorByRegion
{
    ESBCharaCreateColorHue Hue;                                                       // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 MinValue;                                                                   // 0x0004 (size: 0x4)
    int32 MaxValue;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FHairColorLUT
{
    TArray<FColor> Color;                                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FHoldingArrowEffectSetting
{
    FSBPlayingEffect PlayingEffect;                                                   // 0x0010 (size: 0xC8)

}; // Size: 0xE0

struct FImagineLevelData
{
    int32 Level;                                                                      // 0x0000 (size: 0x4)
    int32 NextExp;                                                                    // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FImagineParameter
{
    int32 Level;                                                                      // 0x0000 (size: 0x4)
    int32 Attack;                                                                     // 0x0004 (size: 0x4)
    int32 Defense;                                                                    // 0x0008 (size: 0x4)
    int32 STR;                                                                        // 0x000C (size: 0x4)
    int32 VIT;                                                                        // 0x0010 (size: 0x4)
    int32 DEX;                                                                        // 0x0014 (size: 0x4)
    int32 INT;                                                                        // 0x0018 (size: 0x4)
    int32 MND;                                                                        // 0x001C (size: 0x4)
    int32 Skill;                                                                      // 0x0020 (size: 0x4)
    int32 Attribute;                                                                  // 0x0024 (size: 0x4)
    float StatusTimescale;                                                            // 0x0028 (size: 0x4)
    int32 StatusId1;                                                                  // 0x002C (size: 0x4)
    float AbilityScale1;                                                              // 0x0030 (size: 0x4)
    int32 StatusId2;                                                                  // 0x0034 (size: 0x4)
    float AbilityScale2;                                                              // 0x0038 (size: 0x4)
    int32 StatusId3;                                                                  // 0x003C (size: 0x4)
    float AbilityScale3;                                                              // 0x0040 (size: 0x4)
    int32 StatusId4;                                                                  // 0x0044 (size: 0x4)
    float AbilityScale4;                                                              // 0x0048 (size: 0x4)
    int32 HyouiStatusId1;                                                             // 0x004C (size: 0x4)
    float HyouiAbilityScale1;                                                         // 0x0050 (size: 0x4)
    int32 HyouiStatusId2;                                                             // 0x0054 (size: 0x4)
    float HyouiAbilityScale2;                                                         // 0x0058 (size: 0x4)
    int32 HyouiStatusId3;                                                             // 0x005C (size: 0x4)
    float HyouiAbilityScale3;                                                         // 0x0060 (size: 0x4)
    int32 HyouiStatusId4;                                                             // 0x0064 (size: 0x4)
    float HyouiAbilityScale4;                                                         // 0x0068 (size: 0x4)

}; // Size: 0x6C

struct FItemEfficacy
{
    EItemEfficacyType Type;                                                           // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 EfficacyId;                                                                 // 0x0004 (size: 0x4)
    FItemEfficacyTypeMasterData TypeData;                                             // 0x0008 (size: 0xC)
    int32 PerkId;                                                                     // 0x0014 (size: 0x4)
    int32 Value;                                                                      // 0x0018 (size: 0x4)
    int32 Value2;                                                                     // 0x001C (size: 0x4)
    FString ProjectileId;                                                             // 0x0020 (size: 0x10)
    int32 Time;                                                                       // 0x0030 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0034 (size: 0x4)
    FString EffectId;                                                                 // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FItemEfficacyTypeMasterData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    EItemEfficacyType EfficacyType;                                                   // 0x0004 (size: 0x1)
    EItemEffictionType EffictionType;                                                 // 0x0005 (size: 0x1)
    bool bCanUseCity;                                                                 // 0x0006 (size: 0x1)
    bool bCanUseStorage;                                                              // 0x0007 (size: 0x1)
    bool bAllowUseOtherItem;                                                          // 0x0008 (size: 0x1)
    bool bRegisterShortcut;                                                           // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FItemMasterData
{
    bool CanUse;                                                                      // 0x0000 (size: 0x1)
    bool bDungeonOnly;                                                                // 0x0001 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0002 (size: 0x2)
    int32 Index;                                                                      // 0x0004 (size: 0x4)
    EItemType Type;                                                                   // 0x0008 (size: 0x1)
    ESBRarity Rarity;                                                                 // 0x0009 (size: 0x1)
    char padding_1[0x2];                                                              // 0x000A (size: 0x2)
    FSBTextTableHash Name;                                                            // 0x000C (size: 0x4)
    FSBTextTableHash Desc;                                                            // 0x0010 (size: 0x4)
    int32 ItemLevel;                                                                  // 0x0014 (size: 0x4)
    int32 ItemExp;                                                                    // 0x0018 (size: 0x4)
    int32 PricePlayerSells;                                                           // 0x001C (size: 0x4)
    int32 PricePlayerBuys;                                                            // 0x0020 (size: 0x4)
    int32 StackStorageNum;                                                            // 0x0024 (size: 0x4)
    FItemEfficacy Efficacy;                                                           // 0x0028 (size: 0x48)
    float RecastTime;                                                                 // 0x0070 (size: 0x4)
    FSBTextTableHash ItemEffectDescTextId;                                            // 0x0074 (size: 0x4)
    bool IsNoDissolution;                                                             // 0x0078 (size: 0x1)
    bool IsAccounting;                                                                // 0x0079 (size: 0x1)
    bool NoSaleFlag;                                                                  // 0x007A (size: 0x1)
    bool IsSupplyItem;                                                                // 0x007B (size: 0x1)
    bool IsFusionItem;                                                                // 0x007C (size: 0x1)
    char padding_2[0x3];                                                              // 0x007D (size: 0x3)
    int32 SortId;                                                                     // 0x0080 (size: 0x4)
    int32 AdventurerRank;                                                             // 0x0084 (size: 0x4)
    EItemObtainRouteType ObtainRoute;                                                 // 0x0088 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0089 (size: 0x3)
    FSBTextTableHash ObtainRouteId;                                                   // 0x008C (size: 0x4)
    bool IdentifiedByDefault;                                                         // 0x0090 (size: 0x1)
    char padding_4[0x3];                                                              // 0x0091 (size: 0x3)
    FName UnidentifiedIconName;                                                       // 0x0094 (size: 0x8)
    FSBTextTableHash UnidentifiedName;                                                // 0x009C (size: 0x4)
    FSBTextTableHash UnidentifiedDesc;                                                // 0x00A0 (size: 0x4)
    EItemCategory Category;                                                           // 0x00A4 (size: 0x1)
    char padding_5[0x3];                                                              // 0x00A5 (size: 0x3)
    FAppearanceWeaponSticker AppearanceWeaponSticker;                                 // 0x00A8 (size: 0x10)
    FString EventTermId;                                                              // 0x00B8 (size: 0x10)
    ESBClassType LimitClass;                                                          // 0x00C8 (size: 0x1)
    bool bRareProduction;                                                             // 0x00C9 (size: 0x1)

}; // Size: 0xD0

struct FLikeSend
{
    FString UserId;                                                                   // 0x0000 (size: 0x10)
    FString CharacterId;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FLineEffectPointParameter
{
    FVector StartPointOffset;                                                         // 0x0000 (size: 0xC)
    FVector EndPointOffset;                                                           // 0x000C (size: 0xC)

}; // Size: 0x18

struct FLockOnCameraInfo
{
    bool bUseFarInfo;                                                                 // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FLockOnCameraRotateInfo NearInfo;                                                 // 0x0008 (size: 0x40)
    FLockOnCameraRotateInfo FarInfo;                                                  // 0x0048 (size: 0x40)

}; // Size: 0x88

struct FLockOnCameraRotateInfo
{
    float Offset;                                                                     // 0x0000 (size: 0x4)
    float RotateStartAngle;                                                           // 0x0004 (size: 0x4)
    bool bUseRotateSpeedCurve;                                                        // 0x0008 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0009 (size: 0x7)
    TSoftObjectPtr<UCurveFloat> RotateSpeedCurve;                                     // 0x0010 (size: 0x28)
    float RotateSpeed;                                                                // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FLockOnCameraSettings : public FGameplayCameraSettings
{
    ESBLockOnCameraLookPoint LookPoint;                                               // 0x01B0 (size: 0x1)
    char padding_0[0x7];                                                              // 0x01B1 (size: 0x7)
    FLockOnCameraInfo PitchCameraInfo;                                                // 0x01B8 (size: 0x88)
    FLockOnCameraInfo YawCameraInfo;                                                  // 0x0240 (size: 0x88)

}; // Size: 0x2C8

struct FMagicianModifyMaxHPMP
{
    int32 SkillLevel;                                                                 // 0x0000 (size: 0x4)
    float ModifyPercentMaxHP;                                                         // 0x0004 (size: 0x4)
    float ModifyAddMaxMP;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMapInterruptQuestInfo
{
    FName QuestID;                                                                    // 0x0000 (size: 0x8)
    FString QuestName;                                                                // 0x0008 (size: 0x10)
    FVector QuestPointActorLocation;                                                  // 0x0018 (size: 0xC)

}; // Size: 0x28

struct FMapPinInfo
{
    int32 PinIndex;                                                                   // 0x0000 (size: 0x4)
    EMapPinType PinType;                                                              // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    FString PinnedMapZoneId;                                                          // 0x0008 (size: 0x10)
    FVector2D PinnedLocationXY;                                                       // 0x0018 (size: 0x8)
    FVector PinnedWorldPosition;                                                      // 0x0020 (size: 0xC)
    char padding_1[0x4];                                                              // 0x002C (size: 0x4)
    FString Comment;                                                                  // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMapPinListInfo
{
    TArray<FMapPinInfo> MapPinList;                                                   // 0x0000 (size: 0x10)
    bool IsPinDataLoadedFromDB;                                                       // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FMasterImagineLevel
{
    FString LevelType;                                                                // 0x0000 (size: 0x10)
    TArray<FImagineLevelData> LevelData;                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMasterImagineMaterial
{
    EItemType ItemType;                                                               // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 ItemId;                                                                     // 0x0004 (size: 0x4)
    int32 Amount;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMasterImagineParams
{
    FString ParamType;                                                                // 0x0000 (size: 0x10)
    TArray<FImagineParameter> Params;                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMasterImaginePerkTable
{
    FString TableId;                                                                  // 0x0000 (size: 0x10)
    TArray<int32> Perks;                                                              // 0x0010 (size: 0x10)
    TArray<float> Rates;                                                              // 0x0020 (size: 0x10)
    char padding_0[0x8];                                                              // 0x0030 (size: 0x8)
    TArray<int32> PerkWeights;                                                        // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FMasterImagineRecepi
{
    int32 RecepiId;                                                                   // 0x0000 (size: 0x4)
    int32 ImagineId;                                                                  // 0x0004 (size: 0x4)
    int32 AdventurerRank;                                                             // 0x0008 (size: 0x4)
    bool AutoRelease;                                                                 // 0x000C (size: 0x1)
    char padding_0[0x3];                                                              // 0x000D (size: 0x3)
    int32 Price;                                                                      // 0x0010 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0014 (size: 0x4)
    TArray<FMasterImagineMaterial> Materials;                                         // 0x0018 (size: 0x10)
    FString EventTermId;                                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMasterToken
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FSBTextTableHash Name;                                                            // 0x0004 (size: 0x4)
    FSBTextTableHash Desc;                                                            // 0x0008 (size: 0x4)
    ESBTokenPossessionType PossessionType;                                            // 0x000C (size: 0x1)
    ESBTokenCategory Category;                                                        // 0x000D (size: 0x1)
    char padding_0[0x2];                                                              // 0x000E (size: 0x2)
    int32 SortId;                                                                     // 0x0010 (size: 0x4)
    ESBTokenPurchaseType PurchaseType;                                                // 0x0014 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0015 (size: 0x3)
    int32 MaxAmount;                                                                  // 0x0018 (size: 0x4)
    char padding_2[0x4];                                                              // 0x001C (size: 0x4)
    FString PlaceToConsume;                                                           // 0x0020 (size: 0x10)
    FString TermId;                                                                   // 0x0030 (size: 0x10)
    ESBTokenRecoveryType RecoveryType;                                                // 0x0040 (size: 0x1)
    ESBTokenDayOfWeek RecoveryDayOfWeek;                                              // 0x0041 (size: 0x1)
    char padding_3[0x2];                                                              // 0x0042 (size: 0x2)
    int32 RecoveryMin;                                                                // 0x0044 (size: 0x4)
    int32 RecoverySec;                                                                // 0x0048 (size: 0x4)
    int32 RecoveryAmount;                                                             // 0x004C (size: 0x4)
    ESBTokenOverflowType OverflowType;                                                // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FMasterTokenUse
{
    int32 TokenID;                                                                    // 0x0000 (size: 0x4)
    ESBTokenPlaceToConsumeType PlaceToConsume;                                        // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FMovieSceneChoiceDialogSectionData : public FMovieSceneChannel
{
    TArray<FFrameNumber> Times;                                                       // 0x0008 (size: 0x10)
    TArray<FSBChoiceDialogPayload> KeyValues;                                         // 0x0018 (size: 0x10)

}; // Size: 0x88

struct FMssageRestrictionParam
{
    int32 RestrictionFromLogNum;                                                      // 0x0000 (size: 0x4)
    float RestrictionFromLogSec;                                                      // 0x0004 (size: 0x4)
    float RestrictionMessageSec;                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMultiCraftData
{
    TArray<FOwnItemInfo> OutItems;                                                    // 0x0000 (size: 0x10)
    TArray<FOwnItemInfo> UseMaterials;                                                // 0x0010 (size: 0x10)
    bool IsCritical;                                                                  // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FMyCharacterWeaponData
{
    FString WeaponItemUniqueId;                                                       // 0x0000 (size: 0x10)
    int32 WeaponItemIndex;                                                            // 0x0010 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0014 (size: 0x4)
    FString WeaponName;                                                               // 0x0018 (size: 0x10)
    int32 WeaponLevel;                                                                // 0x0028 (size: 0x4)
    float WeaponAura;                                                                 // 0x002C (size: 0x4)
    ESBRarity WeaponRarity;                                                           // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FNavDataInfo
{
    FName NavMeshName;                                                                // 0x0000 (size: 0x8)
    int32 VolatileNavMeshVersion;                                                     // 0x0008 (size: 0x4)
    int32 CachedPolyBaseNum;                                                          // 0x000C (size: 0x4)
    int32 CachedPolyNum;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FNavMeshInWaterDepthSetting
{
    char padding_0[0x8];                                                              // 0x0000 (size: 0x0)
}; // Size: 0x8

struct FNotifyProjectileByCondition
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    FNotityProjectile NotifyConfig;                                                   // 0x0010 (size: 0x20)

}; // Size: 0x30

struct FNotifyProjectileByTag
{
    FName AnimationTagName;                                                           // 0x0000 (size: 0x8)
    FNotityProjectile NotifyConfig;                                                   // 0x0008 (size: 0x20)

}; // Size: 0x28

struct FNotifyProjectileConfigPackage
{
    FNotityProjectile NotifyConfig;                                                   // 0x0000 (size: 0x20)
    TArray<FNotifyProjectileByTag> NotifyByTagArray;                                  // 0x0020 (size: 0x10)
    TArray<FNotifyProjectileByCondition> NotifyByConditionArray;                      // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FNotifyStateChangeEmissiveColorTarget
{
    int32 WeaponIndex;                                                                // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<int32> MaterialIndex;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FNotifySwitchVisibilityTarget
{
    bool bChangeToVisible;                                                            // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TArray<FName> TargetComponentName;                                                // 0x0008 (size: 0x10)
    TArray<FName> TargetComponentTag;                                                 // 0x0018 (size: 0x10)
    TArray<int32> TargetMaterialID;                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FNotityProjectile
{
    FSBProjectileSelectHandle ProjectileSelectHandle;                                 // 0x0000 (size: 0x18)
    FName SpawnSocketName;                                                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FNpcColorByRegion
{
    TArray<FHairColorByRegion> HairColor;                                             // 0x0000 (size: 0x10)
    TArray<FSkinColorByRegion> SkinColor;                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FNpcInSensorActor
{
    class AActor* Actor;                                                              // 0x0000 (size: 0x8)
    float Length;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FNpcNavPathData
{
    FVector Point;                                                                    // 0x0000 (size: 0xC)
    float SnapRadius;                                                                 // 0x000C (size: 0x4)
    float SnapHeight;                                                                 // 0x0010 (size: 0x4)
    uint8 bUseSnapHeight;                                                             // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FNpcPathPointData
{
    FVector Point;                                                                    // 0x0000 (size: 0xC)
    FVector Tangent;                                                                  // 0x000C (size: 0xC)

}; // Size: 0x18

struct FOtherMessageRenderTarget
{
    class UTextureRenderTarget2D* RenderTarget;                                       // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FOwnItemInfo
{
    FString UniqueId;                                                                 // 0x0000 (size: 0x10)
    int32 ItemIndex;                                                                  // 0x0010 (size: 0x4)
    int32 Amount;                                                                     // 0x0014 (size: 0x4)
    int32 AmountBonus;                                                                // 0x0018 (size: 0x4)
    int32 AddedAmount;                                                                // 0x001C (size: 0x4)
    int32 StorageNumber;                                                              // 0x0020 (size: 0x4)
    EItemType ItemType;                                                               // 0x0024 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0025 (size: 0x3)
    double DefaultOrder;                                                              // 0x0028 (size: 0x8)
    FSBWeaponItemData WeaponData;                                                     // 0x0030 (size: 0x50)
    FCostumeData CostumeData;                                                         // 0x0080 (size: 0x20)
    FSBCharacterImagineData ImagineData;                                              // 0x00A0 (size: 0x18)
    FSBCharacterMountImagineData MountImagineData;                                    // 0x00B8 (size: 0x28)
    TArray<FSBTokenOverLimit> TokenData;                                              // 0x00E0 (size: 0x10)
    bool bItemLock;                                                                   // 0x00F0 (size: 0x1)
    bool bIsIdentified;                                                               // 0x00F1 (size: 0x1)
    char padding_1[0x1];                                                              // 0x00F2 (size: 0x1)
    bool bUsed;                                                                       // 0x00F3 (size: 0x1)
    bool bBilling;                                                                    // 0x00F4 (size: 0x1)
    bool bIsNew;                                                                      // 0x00F5 (size: 0x1)
    bool bIsBppIrredeemable;                                                          // 0x00F6 (size: 0x1)

}; // Size: 0xF8

struct FParticleParameter
{
    uint8 bIsEnable;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> Particle;                                         // 0x0008 (size: 0x28)
    TSoftObjectPtr<UParticleSystem> SimulatedParticle;                                // 0x0030 (size: 0x28)
    uint8 bIsAttach;                                                                  // 0x0058 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0059 (size: 0x3)
    EProjectileEffectAttachTargetType AttachTargetType;                               // 0x005C (size: 0x1)
    char padding_2[0x3];                                                              // 0x005D (size: 0x3)
    FName AttachPointName;                                                            // 0x0060 (size: 0x8)
    FVector Offset;                                                                   // 0x0068 (size: 0xC)
    FRotator RotOffset;                                                               // 0x0074 (size: 0xC)
    uint8 bIsAutoDestroy;                                                             // 0x0080 (size: 0x1)
    uint8 bIsLinkDestroy;                                                             // 0x0080 (size: 0x1)
    uint8 bIsDisableAutoDestroyWhenProjectileDestroy;                                 // 0x0080 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0081 (size: 0x3)
    float InitialScale;                                                               // 0x0084 (size: 0x4)
    uint8 bIsNotInheritanceScale;                                                     // 0x0088 (size: 0x1)
    char padding_4[0x3];                                                              // 0x0089 (size: 0x3)
    ESBEColorOverride OverrideEColor;                                                 // 0x008C (size: 0x1)

}; // Size: 0x90

struct FPathConfig
{
    EPathDirection PathDirection;                                                     // 0x0000 (size: 0x1)
    EPathTarget PathTarget;                                                           // 0x0001 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0002 (size: 0x2)
    float Width;                                                                      // 0x0004 (size: 0x4)
    uint8 LinkBeginEnd;                                                               // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPhotoModeSaveUploadImage
{
    class UTexture2DDynamic* Texture;                                                 // 0x0000 (size: 0x8)
    TArray<uint8> PNGData;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPhotoModeUploadedImageInfo
{
    FString CharacterId;                                                              // 0x0000 (size: 0x10)
    FString ImagePath;                                                                // 0x0010 (size: 0x10)
    bool bIsLocked;                                                                   // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FPioneerAbilityList
{
    TArray<FSBWarehouseAbilityListUIInfo> AbilityList;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPlayerAwardData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FDateTime CreateAt;                                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPlayerCameraArmLengthData
{
    float MinArmLength;                                                               // 0x0000 (size: 0x4)
    float MaxArmLength;                                                               // 0x0004 (size: 0x4)
    float DefaultArmLength;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPlayerCameraBlendCurveData
{
    TSoftObjectPtr<UCurveFloat> BlendInCurve;                                         // 0x0000 (size: 0x28)
    bool UseBlendOutCurve;                                                            // 0x0028 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0029 (size: 0x7)
    TSoftObjectPtr<UCurveFloat> BlendOutCurve;                                        // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FPlayerCameraBlendTimeData
{
    float BlendInTime;                                                                // 0x0000 (size: 0x4)
    bool UseBlendOutTime;                                                             // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    float BlendOutTime;                                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPlayerCameraData : public FTableRowBase
{
    ESBCameraType CameraType;                                                         // 0x0008 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0009 (size: 0x3)
    float FOV;                                                                        // 0x000C (size: 0x4)
    FCameraComponentLocationData ComponentLocationData;                               // 0x0010 (size: 0x10)
    FPlayerCameraZoomData ZoomData;                                                   // 0x0020 (size: 0x10)
    FPlayerCameraOffsetData CameraOffsetData;                                         // 0x0030 (size: 0x18)
    FSBPitchRotationOffsetData PitchRotationOffsetData;                               // 0x0048 (size: 0x30)
    FPlayerCameraArmLengthData ArmLengthData;                                         // 0x0078 (size: 0xC)
    FPlayerCameraLagData LagData;                                                     // 0x0084 (size: 0x20)
    FPlayerCameraBlendTimeData BlendTimeData;                                         // 0x00A4 (size: 0xC)
    FPlayerCameraBlendCurveData BlendCurveData;                                       // 0x00B0 (size: 0x58)
    FPlayerCameraPitchData PitchData;                                                 // 0x0108 (size: 0x8)
    FPlayerCameraResetYawData ResetYawData;                                           // 0x0110 (size: 0x3)
    char padding_1[0x1];                                                              // 0x0113 (size: 0x1)
    FPlayerCameraRotationLimitData RotationLimitData;                                 // 0x0114 (size: 0x10)
    FPlayerCameraRotationSpeedData RotationSpeedData;                                 // 0x0124 (size: 0x10)
    FPlayerCameraTransparentDistanceData TransparentDistanceData;                     // 0x0134 (size: 0x10)
    char padding_2[0x4];                                                              // 0x0144 (size: 0x4)
    FPlayerCameraEndData EndData;                                                     // 0x0148 (size: 0x18)
    ESBKeepCameraAimLocation KeepAimLocation;                                         // 0x0160 (size: 0x1)
    bool IsLockonSuspend;                                                             // 0x0161 (size: 0x1)

}; // Size: 0x178

struct FPlayerCameraEndData
{
    TArray<FName> KeepCameraAnimTags;                                                 // 0x0000 (size: 0x10)
    float WaitTagCheckDeltaTime;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPlayerCameraLagData
{
    bool EnableCameraLag;                                                             // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float MinLengthCameraLagSpeed;                                                    // 0x0004 (size: 0x4)
    float MaxLengthCameraLagSpeed;                                                    // 0x0008 (size: 0x4)
    bool EnableCameraRotationLag;                                                     // 0x000C (size: 0x1)
    char padding_1[0x3];                                                              // 0x000D (size: 0x3)
    float MinLengthCameraRotationLagSpeed;                                            // 0x0010 (size: 0x4)
    float MaxLengthCameraRotationLagSpeed;                                            // 0x0014 (size: 0x4)
    float MinLengthCameraLagMaxDistance;                                              // 0x0018 (size: 0x4)
    float MaxLengthCameraLagMaxDistance;                                              // 0x001C (size: 0x4)

}; // Size: 0x20

struct FPlayerCameraOffsetData
{
    FVector MinLengthCameraOffset;                                                    // 0x0000 (size: 0xC)
    FVector MaxLengthCameraOffset;                                                    // 0x000C (size: 0xC)

}; // Size: 0x18

struct FPlayerCameraPitchData
{
    bool UseDefaultPitch;                                                             // 0x0000 (size: 0x1)
    bool UseResetPitch;                                                               // 0x0001 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0002 (size: 0x2)
    float Pitch;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPlayerCameraResetYawData
{
    bool BlendInResetYaw;                                                             // 0x0000 (size: 0x1)
    bool UseBlendOutResetYaw;                                                         // 0x0001 (size: 0x1)
    bool BlendOutResetYaw;                                                            // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FPlayerCameraRotationLimitData
{
    float PitchLimitMax;                                                              // 0x0000 (size: 0x4)
    float PitchLimitMin;                                                              // 0x0004 (size: 0x4)
    float YawLimitMax;                                                                // 0x0008 (size: 0x4)
    float YawLimitMin;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPlayerCameraRotationSpeedData
{
    float RotationSpeedYaw;                                                           // 0x0000 (size: 0x4)
    float RotationSpeedPitch;                                                         // 0x0004 (size: 0x4)
    float RotationSpeedYaw_Mouse;                                                     // 0x0008 (size: 0x4)
    float RotationSpeedPitch_Mouse;                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPlayerCameraTransparentDistanceData
{
    bool UseCameraDistanceTransparentParam;                                           // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    FSBCameraDistanceTransparentParam CameraDistanceTransparentParam;                 // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FPlayerCameraZoomData
{
    float ZoomDuration;                                                               // 0x0000 (size: 0x4)
    float ZoomStep;                                                                   // 0x0004 (size: 0x4)
    float ZoomStick;                                                                  // 0x0008 (size: 0x4)
    bool IsBlendInOverwriteZoomLevel;                                                 // 0x000C (size: 0x1)
    bool IsBlendOutOverwriteZoomLevel;                                                // 0x000D (size: 0x1)
    bool IsZoomLevelSave;                                                             // 0x000E (size: 0x1)

}; // Size: 0x10

struct FPlayerCastSkillInfo
{
    char padding_0[0xC];                                                              // 0x0000 (size: 0x0)
}; // Size: 0xC

struct FPlayerProfileBgImageInfo
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    EPhotoType PhotoType;                                                             // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    FString BgImagePath;                                                              // 0x0008 (size: 0x10)
    FVector2D BgImageSelectedAreaPos;                                                 // 0x0018 (size: 0x8)
    FVector2D BgImageSize;                                                            // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPlayerProfileClassData
{
    ESBClassType ClassType;                                                           // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 ClassExp;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPlayerProfileClassListData
{
    TArray<FPlayerProfileClassData> DataList;                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPlayerProfileMenuDetailData
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString LocationName;                                                             // 0x0010 (size: 0x10)
    FString Comment;                                                                  // 0x0020 (size: 0x10)
    ESBClassType ClassType;                                                           // 0x0030 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0031 (size: 0x7)
    FString PlayerId;                                                                 // 0x0038 (size: 0x10)
    FString CharacterId;                                                              // 0x0048 (size: 0x10)
    FString CharacterShortId;                                                         // 0x0058 (size: 0x10)
    FString ZoneId;                                                                   // 0x0068 (size: 0x10)
    bool Active;                                                                      // 0x0078 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0079 (size: 0x7)
    FOwnItemInfo EquipItemWepaon;                                                     // 0x0080 (size: 0xF8)
    TArray<FOwnItemInfo> EquipItemCostumes;                                           // 0x0178 (size: 0x10)
    TArray<FOwnItemInfo> EquipItemAccessories;                                        // 0x0188 (size: 0x10)
    TArray<FOwnItemInfo> EquipItemUnderWear;                                          // 0x0198 (size: 0x10)
    ESBProfilePublicSettingType GlobalPublicSetting;                                  // 0x01A8 (size: 0x1)
    char padding_2[0x7];                                                              // 0x01A9 (size: 0x7)
    FString ContentId;                                                                // 0x01B0 (size: 0x10)
    int32 AchievementSelected;                                                        // 0x01C0 (size: 0x4)
    char padding_3[0x4];                                                              // 0x01C4 (size: 0x4)
    TArray<FPlayerProfilePhotoTrimmingInfo> PhotoTrimmingInfo;                        // 0x01C8 (size: 0x10)
    FString SessionId;                                                                // 0x01D8 (size: 0x10)
    FString GameContentId;                                                            // 0x01E8 (size: 0x10)
    char padding_4[0x10];                                                             // 0x01F8 (size: 0x10)
    int32 OnlineStatus;                                                               // 0x0208 (size: 0x4)
    char padding_5[0x4];                                                              // 0x020C (size: 0x4)
    FPlayerProfileClassListData ClassDataList;                                        // 0x0210 (size: 0x10)
    int32 AdventurerRank;                                                             // 0x0220 (size: 0x4)
    int32 TotalPower;                                                                 // 0x0224 (size: 0x4)
    bool IsSendLIke;                                                                  // 0x0228 (size: 0x1)
    ESBTensionTagType TensionTag;                                                     // 0x0229 (size: 0x1)
    bool isFriend;                                                                    // 0x022A (size: 0x1)
    bool IsDoneSendAdvCard;                                                           // 0x022B (size: 0x1)
    bool IsCanSendAdvCard;                                                            // 0x022C (size: 0x1)
    char padding_6[0x3];                                                              // 0x022D (size: 0x3)
    FString GuildName;                                                                // 0x0230 (size: 0x10)
    FString GuildId;                                                                  // 0x0240 (size: 0x10)
    FSBPlatformInfo PlatformInfo;                                                     // 0x0250 (size: 0x20)
    int32 Warning;                                                                    // 0x0270 (size: 0x4)
    char padding_7[0x4];                                                              // 0x0274 (size: 0x4)
    TArray<int32> AwardIdList;                                                        // 0x0278 (size: 0x10)
    int32 AdventureCardFrameId;                                                       // 0x0288 (size: 0x4)
    int32 FaceFrameId;                                                                // 0x028C (size: 0x4)
    int32 BackGroundColorId;                                                          // 0x0290 (size: 0x4)

}; // Size: 0x298

struct FPlayerProfilePhotoTrimmingInfo
{
    EPhotoType TrimmingType;                                                          // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FString PhotoModeImageId;                                                         // 0x0008 (size: 0x10)
    FVector2D TrimmingCoordinate;                                                     // 0x0018 (size: 0x8)
    float Scale;                                                                      // 0x0020 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0024 (size: 0x4)
    FString ImagePath;                                                                // 0x0028 (size: 0x10)
    FString ThumbnailPath;                                                            // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FPlayerProfileSummaryData
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString LocationName;                                                             // 0x0010 (size: 0x10)
    ESBTensionTagType TensionTag;                                                     // 0x0020 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0021 (size: 0x7)
    FString Comment;                                                                  // 0x0028 (size: 0x10)
    int32 ClassLevel;                                                                 // 0x0038 (size: 0x4)
    ESBClassType ClassType;                                                           // 0x003C (size: 0x1)
    char padding_1[0x3];                                                              // 0x003D (size: 0x3)
    FString PlayerId;                                                                 // 0x0040 (size: 0x10)
    FString CharacterId;                                                              // 0x0050 (size: 0x10)
    FString ZoneId;                                                                   // 0x0060 (size: 0x10)
    bool Active;                                                                      // 0x0070 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0071 (size: 0x7)
    FString ContentId;                                                                // 0x0078 (size: 0x10)
    char padding_3[0x10];                                                             // 0x0088 (size: 0x10)
    bool Friend;                                                                      // 0x0098 (size: 0x1)
    bool DoneSend;                                                                    // 0x0099 (size: 0x1)
    bool CanBeSend;                                                                   // 0x009A (size: 0x1)
    bool Blocked;                                                                     // 0x009B (size: 0x1)
    char padding_4[0x4];                                                              // 0x009C (size: 0x4)
    FString FaceIconUrl;                                                              // 0x00A0 (size: 0x10)
    int32 LeftDay;                                                                    // 0x00B0 (size: 0x4)
    char padding_5[0x4];                                                              // 0x00B4 (size: 0x4)
    FString TimesLeft;                                                                // 0x00B8 (size: 0x10)
    bool bSendLike;                                                                   // 0x00C8 (size: 0x1)
    char padding_6[0x3];                                                              // 0x00C9 (size: 0x3)
    int32 OnlineStatus;                                                               // 0x00CC (size: 0x4)
    FSBPlatformInfo PlatformInfo;                                                     // 0x00D0 (size: 0x20)
    bool bPartyMember;                                                                // 0x00F0 (size: 0x1)
    bool bPartyLeader;                                                                // 0x00F1 (size: 0x1)
    char padding_7[0x6];                                                              // 0x00F2 (size: 0x6)
    FString LastLogin;                                                                // 0x00F8 (size: 0x10)
    FDateTime FriendRegistratedDate;                                                  // 0x0108 (size: 0x8)
    bool to_blocked;                                                                  // 0x0110 (size: 0x1)

}; // Size: 0x118

struct FPlayerScore
{
    TMap<ASBPlayerCharacter*, float> PlayerScoreMap;                                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FProjectileAreaAttackConfig
{
    FSBProjectileSelectHandle RapidProjectileSelectHandle;                            // 0x0000 (size: 0x18)
    int32 RapidNum;                                                                   // 0x0018 (size: 0x4)
    float RapidInterval;                                                              // 0x001C (size: 0x4)
    float EffectiveRadius;                                                            // 0x0020 (size: 0x4)
    uint8 bIsUpperSphere;                                                             // 0x0024 (size: 0x1)
    uint8 bIsAdjustGround;                                                            // 0x0024 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0025 (size: 0x3)
    EProjectileAreaAttackSpawnOrder Order;                                            // 0x0028 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0029 (size: 0x3)
    uint8 bIsDestroyWhenCantLaunch;                                                   // 0x002C (size: 0x1)

}; // Size: 0x30

struct FProjectileAttachInfo
{
    uint8 bIsAttach;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0xB];                                                              // 0x0001 (size: 0xB)
    uint8 bIsAttachBone;                                                              // 0x000C (size: 0x1)
    char padding_1[0x3];                                                              // 0x000D (size: 0x3)
    int16 AttachSocketIndex;                                                          // 0x0010 (size: 0x2)
    char padding_2[0x6];                                                              // 0x0012 (size: 0x6)
    class USceneComponent* AttachComp;                                                // 0x0018 (size: 0x8)
    int8 WeaponIndex;                                                                 // 0x0020 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0021 (size: 0x3)
    FVector_NetQuantize AttachTransLocation;                                          // 0x0024 (size: 0xC)
    FRotator AttachTransRotator;                                                      // 0x0030 (size: 0xC)

}; // Size: 0x40

struct FProjectileBaseParameter
{
    class AActor* Spawner;                                                            // 0x0068 (size: 0x8)

}; // Size: 0x70

struct FProjectileBeamConfig
{
    FProjectileRapidConfig ImpactSpawnProjectile;                                     // 0x0000 (size: 0x48)
    FProjectileBeamDirection BeamDirectionType;                                       // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FProjectileBeamEffectConfig
{
    ESBProjectileBeamDirectingType BeamType;                                          // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    FName TargetVectorName;                                                           // 0x0004 (size: 0x8)
    char padding_1[0x4];                                                              // 0x000C (size: 0x4)
    TSoftObjectPtr<UParticleSystem> BeamParticle;                                     // 0x0010 (size: 0x28)
    TSoftClassPtr<ASBProjectileEffect> BeamActor;                                     // 0x0038 (size: 0x28)
    TSoftObjectPtr<UParticleSystem> BeamEndParticle;                                  // 0x0060 (size: 0x28)
    uint8 bIsGenerateImpactPointParticle;                                             // 0x0088 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0089 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> ImpactPointParticle;                              // 0x0090 (size: 0x28)
    TSoftClassPtr<ASBProjectileEffect> ImpactPointActor;                              // 0x00B8 (size: 0x28)
    uint8 bIsDeactivateImpactPointParticle;                                           // 0x00E0 (size: 0x1)
    char padding_3[0x7];                                                              // 0x00E1 (size: 0x7)
    FAkEventSwitch ImpactStartAkEventSwitch;                                          // 0x00E8 (size: 0x20)
    FAkEventSwitch ImpactEndAkEventSwitch;                                            // 0x0108 (size: 0x20)
    FProjectileBeamImpactTrailConfig BeamImpactTrailConfig;                           // 0x0128 (size: 0x50)
    FAkEventSwitch StartAkEventSwitch;                                                // 0x0178 (size: 0x20)
    FAkEventSwitch EndAkEventSwitch;                                                  // 0x0198 (size: 0x20)

}; // Size: 0x1B8

struct FProjectileBeamImpactTrailConfig
{
    uint8 bIsTrailDecal;                                                              // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UMaterialInterface> DecalMaterial;                                 // 0x0008 (size: 0x28)
    float PaintDecalLength;                                                           // 0x0030 (size: 0x4)
    FRotator PaintDecalOffsetRot;                                                     // 0x0034 (size: 0xC)
    FVector PaintDecalSize;                                                           // 0x0040 (size: 0xC)
    float PaintDecalLifeTime;                                                         // 0x004C (size: 0x4)

}; // Size: 0x50

struct FProjectileBoxCollisionParam : public FProjectileCollisionParamBase
{
    FVector BoxExtent;                                                                // 0x001C (size: 0xC)
    TArray<FSBConditionCheckFloatParam> ModifySizeList;                               // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FProjectileCameraShake
{
    float Time;                                                                       // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TSubclassOf<class UCameraShakeBase> ShakeClass;                                   // 0x0008 (size: 0x8)
    float Scale;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FProjectileCapsuleCollisionParam : public FProjectileCollisionParamBase
{
    float Radius;                                                                     // 0x001C (size: 0x4)
    float Height;                                                                     // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FProjectileChainConfigBase
{
    FDataTableRowHandle ProjectileConfigHandle1;                                      // 0x0008 (size: 0x10)
    FDataTableRowHandle ProjectileConfigHandle2;                                      // 0x0018 (size: 0x10)
    uint8 bIsGenerate;                                                                // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FProjectileCollisionParamBase
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    FRotator Rotation;                                                                // 0x000C (size: 0xC)
    ESBProjectileCollisionSpecificUseType SpecificUseType;                            // 0x0018 (size: 0x1)
    ESBProjectileCollisionSpecificGroup SpecificGroup;                                // 0x0019 (size: 0x1)

}; // Size: 0x1C

struct FProjectileCylinderMeshConfig
{
    float Radius;                                                                     // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBConditionCheckFloatParam> ModifyRadiusList;                             // 0x0008 (size: 0x10)
    float Height;                                                                     // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FProjectileDelayPlay
{
    char padding_0[0x150];                                                            // 0x0000 (size: 0x0)
}; // Size: 0x150

struct FProjectileDestroyConditionConfig
{
    uint8 bIsEnableLifeCheck;                                                         // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float LifeTime;                                                                   // 0x0004 (size: 0x4)
    TArray<FSBConditionCheckFloatParam> AddLifeTimeList;                              // 0x0008 (size: 0x10)
    uint8 bIsEnableDistanceCheck;                                                     // 0x0018 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0019 (size: 0x3)
    float DestroyDistance;                                                            // 0x001C (size: 0x4)
    TArray<FSBConditionCheckIntParam> DestroyDistanceAdjustList;                      // 0x0020 (size: 0x10)
    uint8 bIsEnableHeightCheck;                                                       // 0x0030 (size: 0x1)
    uint8 bIsEnableTotalDistance;                                                     // 0x0030 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0031 (size: 0x3)
    float DestroyTotalDistance;                                                       // 0x0034 (size: 0x4)
    uint8 bIsEnableGroundHitCheck;                                                    // 0x0038 (size: 0x1)
    uint8 bIsEnableAliveAnimTag;                                                      // 0x0038 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0039 (size: 0x7)
    TArray<FName> AliveAnimTagArray;                                                  // 0x0040 (size: 0x10)
    uint8 bIsDestroyTogeghterWithSpawner;                                             // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FProjectileDynamicBeamCollision
{
    float BeamCollisionRadius;                                                        // 0x0000 (size: 0x4)
    float BeamCollisionLength;                                                        // 0x0004 (size: 0x4)
    uint8 bDontExpandBeam;                                                            // 0x0008 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0009 (size: 0x3)
    float BeamCollisionExpandSpeed;                                                   // 0x000C (size: 0x4)
    TArray<FBeamCollisionOverrideSection> OverrideSectionData;                        // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FProjectileDynamicCollision
{
    TArray<FProjectileSphereCollisionParam> SphereArray;                              // 0x0000 (size: 0x10)
    TArray<FProjectileCapsuleCollisionParam> CapsuleArray;                            // 0x0010 (size: 0x10)
    TArray<FProjectileBoxCollisionParam> BoxArray;                                    // 0x0020 (size: 0x10)
    TArray<FSBProjectileMeshCollision> MeshArray;                                     // 0x0030 (size: 0x10)
    FProjectileDynamicBeamCollision BeamCollision;                                    // 0x0040 (size: 0x20)

}; // Size: 0x60

struct FProjectileEffectParam
{
    uint8 bRequestAuthorityLocalSpawn;                                                // 0x0000 (size: 0x1)
    uint8 bAlreadySpawnEffect;                                                        // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TArray<FProjectileEffectParamVector> VectorParamArray;                            // 0x0008 (size: 0x10)
    class AActor* ActorParamTarget;                                                   // 0x0018 (size: 0x8)
    TArray<FProjectileEffectParamActor> ActorParamArray;                              // 0x0020 (size: 0x10)

}; // Size: 0x38

struct FProjectileEffectParamActor
{
    FName ActorParamName;                                                             // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FProjectileEffectParamVector
{
    FName VectorParamName;                                                            // 0x0000 (size: 0x8)
    FVector_NetQuantize VectorParam;                                                  // 0x0008 (size: 0xC)

}; // Size: 0x14

struct FProjectileForecastConfig
{
    float ForecastDelayTime;                                                          // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FSBProjectileSelectHandle ForecastSelectProjectile;                               // 0x0008 (size: 0x18)
    float DelayTime;                                                                  // 0x0020 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0024 (size: 0x4)
    FSBProjectileSelectHandle MainSelectProjectile;                                   // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FProjectileGroundCollisionConfig
{
    uint8 bIsEnableGroundCollision;                                                   // 0x0000 (size: 0x1)
    uint8 bIsUseBImagineCollisionPreset;                                              // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float HalfHeight;                                                                 // 0x0004 (size: 0x4)
    float Radius;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FProjectileGroundHitEffectConfig
{
    uint8 bIsGenerateGroundHitEffect;                                                 // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    EHitEffectSpawnPosType SpawnPosType;                                              // 0x0004 (size: 0x1)
    EHitEffectSpawnRotType SpawnRotType;                                              // 0x0005 (size: 0x1)
    char padding_1[0x2];                                                              // 0x0006 (size: 0x2)
    FVector SpawnPosOffset;                                                           // 0x0008 (size: 0xC)
    FRotator SpawnRotOffset;                                                          // 0x0014 (size: 0xC)
    uint8 bIsAdjustGroundPos;                                                         // 0x0020 (size: 0x1)
    uint8 bIsReverseRotation;                                                         // 0x0020 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0021 (size: 0x3)
    FName HitActorSocketName;                                                         // 0x0024 (size: 0x8)
    float InitialScale;                                                               // 0x002C (size: 0x4)
    uint8 bIsNotInheritanceScale;                                                     // 0x0030 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0031 (size: 0x7)
    TArray<FGroundHitEffectByMaterial> SwitchEffect;                                  // 0x0038 (size: 0x10)
    uint8 bIsNotExistPlayDefault;                                                     // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FProjectileHitChainConfig : public FProjectileChainConfigBase
{
    uint8 bIsGenerateAttackHit;                                                       // 0x0030 (size: 0x1)
    uint8 bIsOnlyGenerateSBCharacterHit;                                              // 0x0030 (size: 0x1)
    uint8 bIsGenerateGroundHit;                                                       // 0x0030 (size: 0x1)
    uint8 bIsGenerateBattleAreaWall;                                                  // 0x0030 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0031 (size: 0x3)
    EHitEffectSpawnPosType SpawnPosType;                                              // 0x0034 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0035 (size: 0x3)
    FVector SpawnPosOffset;                                                           // 0x0038 (size: 0xC)
    uint8 bIsAdjustGroundPos;                                                         // 0x0044 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0045 (size: 0x3)
    EHitEffectSpawnRotType SpawnRotType;                                              // 0x0048 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0049 (size: 0x3)
    uint8 bIsReverseRotation;                                                         // 0x004C (size: 0x1)
    uint8 bIsExcludeHitFromChainHitActor;                                             // 0x004C (size: 0x1)
    uint8 bIsRepeatChainOnAttackHit;                                                  // 0x004C (size: 0x1)
    char padding_4[0x3];                                                              // 0x004D (size: 0x3)
    TArray<FSBConditionCheckParam> PermitConditionList;                               // 0x0050 (size: 0x10)
    FName HitActorSocketName;                                                         // 0x0060 (size: 0x8)
    EProjectileHitChainChangeTarget TargetSelectRule;                                 // 0x0068 (size: 0x1)

}; // Size: 0x70

struct FProjectileHitCoverConfig
{
    uint8 bIsExclusiveSpawner;                                                        // 0x0000 (size: 0x1)

}; // Size: 0x4

struct FProjectileHitEffectConfig
{
    uint8 bIsGenerateHitEffect;                                                       // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> HitParticle;                                      // 0x0008 (size: 0x28)
    EHitEffectSpawnPosType SpawnType;                                                 // 0x0030 (size: 0x1)
    EHitEffectSpawnRotType SpawnRotType;                                              // 0x0031 (size: 0x1)
    char padding_1[0x2];                                                              // 0x0032 (size: 0x2)
    FVector HitEffectOffset;                                                          // 0x0034 (size: 0xC)
    uint8 bIsEnableHitPositionGround;                                                 // 0x0040 (size: 0x1)
    uint8 bIsReverseRotation;                                                         // 0x0040 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0041 (size: 0x3)
    FName HitActorSocketName;                                                         // 0x0044 (size: 0x8)
    FName HitActorParameterName;                                                      // 0x004C (size: 0x8)
    float InitialScale;                                                               // 0x0054 (size: 0x4)
    uint8 bIsNotInheritanceScale;                                                     // 0x0058 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0059 (size: 0x7)
    FAkEventSwitch AkEventSwitch;                                                     // 0x0060 (size: 0x20)

}; // Size: 0x80

struct FProjectileHitResult
{
    FHitResult HitResult;                                                             // 0x0000 (size: 0x88)
    class AActor* ShieldHitActor;                                                     // 0x0088 (size: 0x8)
    class UPrimitiveComponent* ShieldHitComponent;                                    // 0x0090 (size: 0x8)
    uint8 bIsGuardHit;                                                                // 0x0098 (size: 0x1)
    uint8 bIsGuardFailed;                                                             // 0x0098 (size: 0x1)
    uint8 bIsWeakPointHit;                                                            // 0x0098 (size: 0x1)

}; // Size: 0xA0

struct FProjectileHomingConfig
{
    uint8 bIsHoming;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    EHomingType HomingType;                                                           // 0x0004 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0005 (size: 0x3)
    float HomingAccelerationMagnitude;                                                // 0x0008 (size: 0x4)
    float HomingBeginTime;                                                            // 0x000C (size: 0x4)
    float HomingEndTime;                                                              // 0x0010 (size: 0x4)
    FVector HomingOffsetPos;                                                          // 0x0014 (size: 0xC)
    float HomingCorrectionAngle;                                                      // 0x0020 (size: 0x4)
    float HomingCorrectionAngle2;                                                     // 0x0024 (size: 0x4)
    float HomingEffectiveCorrectionAngle;                                             // 0x0028 (size: 0x4)
    float HomingEffectiveCorrectionAngle2;                                            // 0x002C (size: 0x4)
    uint8 bIsCancelHomingEffectiveCorrectionAngle;                                    // 0x0030 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0031 (size: 0x3)
    float CancelHomingBeginTime;                                                      // 0x0034 (size: 0x4)
    float CancelHomingEndTime;                                                        // 0x0038 (size: 0x4)
    uint8 bIsDisableHomingHeight;                                                     // 0x003C (size: 0x1)
    uint8 bIsEnableTargetStop;                                                        // 0x003C (size: 0x1)

}; // Size: 0x40

struct FProjectileMeshConfig
{
    TSoftObjectPtr<USkeletalMesh> SetMesh;                                            // 0x0000 (size: 0x28)
    FVector Location;                                                                 // 0x0028 (size: 0xC)
    FRotator Rotation;                                                                // 0x0034 (size: 0xC)
    FVector Scale;                                                                    // 0x0040 (size: 0xC)
    FRotator RotateSpeed;                                                             // 0x004C (size: 0xC)
    uint8 bIsUseInstigatorActiveWeapon;                                               // 0x0058 (size: 0x1)
    uint8 bIsUseWeaponIndex;                                                          // 0x0058 (size: 0x1)

}; // Size: 0x60

struct FProjectileMoveBaseConfig
{
    float InitialSpeed;                                                               // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBConditionCheckFloatParam> InitialSpeedModifyRateList;                   // 0x0008 (size: 0x10)
    float MinSpeed;                                                                   // 0x0018 (size: 0x4)
    float MaxSpeed;                                                                   // 0x001C (size: 0x4)
    uint8 bIsEnableGravity;                                                           // 0x0020 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0021 (size: 0x3)
    float GravityScale;                                                               // 0x0024 (size: 0x4)
    float BeginEffectiveGravityTime;                                                  // 0x0028 (size: 0x4)
    float EndEffectiveGravityTime;                                                    // 0x002C (size: 0x4)
    uint8 bRotationFollowsVelocity;                                                   // 0x0030 (size: 0x1)
    uint8 bRotationFollowsVelocityOwnerYawAtBegin;                                    // 0x0030 (size: 0x1)
    uint8 bLimitDistance;                                                             // 0x0030 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0031 (size: 0x3)
    float LimitTotalDistance;                                                         // 0x0034 (size: 0x4)
    uint8 bStopMoveWhenGroundHit;                                                     // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FProjectileMuzzleEffectConfig
{
    uint8 bIsGenerateMuzzleEffect;                                                    // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> MuzzleEffect;                                     // 0x0008 (size: 0x28)
    uint8 bIsAttach;                                                                  // 0x0030 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0031 (size: 0x3)
    EMuzzleEffectSpawnPosType SpawnType;                                              // 0x0034 (size: 0x1)
    EMuzzleEffectSpawnRotType SpawnRotType;                                           // 0x0035 (size: 0x1)
    char padding_2[0x2];                                                              // 0x0036 (size: 0x2)
    FName SocketName;                                                                 // 0x0038 (size: 0x8)
    FVector SpawnPosOffset;                                                           // 0x0040 (size: 0xC)
    FRotator SpawnRotOffset;                                                          // 0x004C (size: 0xC)
    uint8 bIsReverseRotation;                                                         // 0x0058 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0059 (size: 0x3)
    float InitialScale;                                                               // 0x005C (size: 0x4)
    uint8 bIsNotInheritanceScale;                                                     // 0x0060 (size: 0x1)
    char padding_4[0x7];                                                              // 0x0061 (size: 0x7)
    FAkEventSwitch AkEventSwitch;                                                     // 0x0068 (size: 0x20)

}; // Size: 0x88

struct FProjectileOrderedChainConfig : public FProjectileChainConfigBase
{
    EProjectileOrderedChainType OrderedChainType;                                     // 0x0030 (size: 0x1)
    uint8 bIsExclueOtherChainProjectile;                                              // 0x0031 (size: 0x1)
    char padding_0[0x6];                                                              // 0x0032 (size: 0x6)
    FDataTableRowHandle HandleOfOrderedChainHitProjectile;                            // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FProjectilePartyShotRapidConfig
{
    FProjectilePartyShotTargetType TargetPartyType;                                   // 0x0000 (size: 0x1)
    bool bIsIncludeInstantParty;                                                      // 0x0001 (size: 0x1)
    uint8 TargetPartyNum;                                                             // 0x0002 (size: 0x1)
    char padding_0[0x1];                                                              // 0x0003 (size: 0x1)
    float TargetPartyDistanceLimit;                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FProjectilePredictParameter
{
    TArray<class APawn*> PredictCharaList;                                            // 0x0000 (size: 0x10)
    TArray<float> ReachTimeList;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FProjectileRapidConfig
{
    FSBProjectileSelectHandle RapidProjectileSelectHandle;                            // 0x0000 (size: 0x18)
    int32 SimultaneousNum;                                                            // 0x0018 (size: 0x4)
    char padding_0[0x4];                                                              // 0x001C (size: 0x4)
    TArray<FSBConditionCheckIntParam> SimultaneousNumModifyList;                      // 0x0020 (size: 0x10)
    int32 RapidNum;                                                                   // 0x0030 (size: 0x4)
    uint8 bIsInfiniteRapidNum;                                                        // 0x0034 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0035 (size: 0x3)
    float RapidInterval;                                                              // 0x0038 (size: 0x4)
    uint8 bIsDestroyWhenCantLaunch;                                                   // 0x003C (size: 0x1)
    char padding_2[0x3];                                                              // 0x003D (size: 0x3)
    float DestroyWhenCantLaunchDelayTime;                                             // 0x0040 (size: 0x4)
    ESBTargetSelectRule TargetSelectRule;                                             // 0x0044 (size: 0x1)
    ESBTargetChangRule TargetChangeRule;                                              // 0x0045 (size: 0x1)

}; // Size: 0x48

struct FProjectileRapidParam
{
    char padding_0[0x38];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x38

struct FProjectileSelfDeadChainConfig : public FProjectileChainConfigBase
{
    char padding_0[0x30];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x30

struct FProjectileSelfDeadEffectConfig
{
    uint8 bIsGenerateSelfDeadEffect;                                                  // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> SelfDeadParticle;                                 // 0x0008 (size: 0x28)
    uint8 bIsGenerateDurabilityZeroEffect;                                            // 0x0030 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0031 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> DurabilityZeroParticle;                           // 0x0038 (size: 0x28)
    ESelfDeadEffectSpawnRotType SpawnRotType;                                         // 0x0060 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0061 (size: 0x3)
    FRotator RotOffset;                                                               // 0x0064 (size: 0xC)
    uint8 bIsReverseRotation;                                                         // 0x0070 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0071 (size: 0x3)
    float InitialScale;                                                               // 0x0074 (size: 0x4)
    uint8 bIsNotInheritanceScale;                                                     // 0x0078 (size: 0x1)
    char padding_4[0x7];                                                              // 0x0079 (size: 0x7)
    FAkEventSwitch AkEventSwitch;                                                     // 0x0080 (size: 0x20)

}; // Size: 0xA0

struct FProjectileShareHitSetting
{
    float ShareHitTime;                                                               // 0x0000 (size: 0x4)
    EProjectileShareGroup ShareGroup;                                                 // 0x0004 (size: 0x1)
    bool bIsIndependentBySpawner;                                                     // 0x0005 (size: 0x1)

}; // Size: 0x8

struct FProjectileShieldHitEffectConfig
{
    uint8 bIsGenerateHitEffect;                                                       // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> HitParticle;                                      // 0x0008 (size: 0x28)
    float InitialScale;                                                               // 0x0030 (size: 0x4)
    uint8 bIsNotInheritanceScale;                                                     // 0x0034 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0035 (size: 0x3)
    FAkEventSwitch AkEventSwitch;                                                     // 0x0038 (size: 0x20)

}; // Size: 0x58

struct FProjectileShotAngleLimit
{
    uint8 bIsEnable;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    EProjectileBaseDir BaseDirType;                                                   // 0x0004 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0005 (size: 0x3)
    float HalfAngle;                                                                  // 0x0008 (size: 0x4)
    float UpAngle;                                                                    // 0x000C (size: 0x4)
    float DownAngle;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FProjectileSpawnInfo
{
    ESpawnType SpawnType;                                                             // 0x0000 (size: 0x1)
    ESpawnRotType SpawnRotType;                                                       // 0x0001 (size: 0x1)
    EProjectileDirection DirectionType;                                               // 0x0002 (size: 0x1)
    char padding_0[0x1];                                                              // 0x0003 (size: 0x1)
    FName SpawnSocketName;                                                            // 0x0004 (size: 0x8)
    FVector SpawnOffset;                                                              // 0x000C (size: 0xC)
    FRotator SpawnRotOffset;                                                          // 0x0018 (size: 0xC)
    FVector SpawnTargetOffset;                                                        // 0x0024 (size: 0xC)
    uint8 bIsAttach;                                                                  // 0x0030 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0031 (size: 0x3)
    EProjectileNonTargetAction NonTargetAction;                                       // 0x0034 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0035 (size: 0x3)
    float NonTargetSpawnDistanceFront;                                                // 0x0038 (size: 0x4)
    uint8 bIsPenetrateInObstacle;                                                     // 0x003C (size: 0x1)
    uint8 bIsDestroyInObstacle;                                                       // 0x003C (size: 0x1)
    uint8 isObstaclePushedBackToSpawner;                                              // 0x003C (size: 0x1)
    uint8 bIsCheckGround;                                                             // 0x003C (size: 0x1)
    uint8 isDisalbeScreenViewDirectionObstacleAttackHit;                              // 0x003C (size: 0x1)
    uint8 isOnNaviMeshConnedtedFromOwner;                                             // 0x003C (size: 0x1)
    uint8 bIsReacquireSpawnTransformOnLocal;                                          // 0x003C (size: 0x1)
    char padding_3[0x3];                                                              // 0x003D (size: 0x3)
    FSBProjectileStability Stability;                                                 // 0x0040 (size: 0xC)
    FProjectileShotAngleLimit ShotAngleLimit;                                         // 0x004C (size: 0x14)
    int32 MaxSpawnNum;                                                                // 0x0060 (size: 0x4)
    float SpawnDelayTime;                                                             // 0x0064 (size: 0x4)
    uint8 bIsInheritanceInstigatorScale;                                              // 0x0068 (size: 0x1)

}; // Size: 0x6C

struct FProjectileSpawnNonTargetAction
{
    EProjectileNonTargetAction NonTargetAction;                                       // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float NonTargetSpawnDistanceFront;                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FProjectileSpawnParameter : public FProjectileBaseParameter
{
    FProjectileTargetInfoSet TargetInfoSet;                                           // 0x0070 (size: 0x20)
    char padding_0[0x20];                                                             // 0x0090 (size: 0x20)
    TArray<class AActor*> IgnoreHitActorList;                                         // 0x00B0 (size: 0x10)

}; // Size: 0x108

struct FProjectileSpawnRapidParameter
{
    FVector_NetQuantize TransLocation;                                                // 0x0000 (size: 0xC)
    FRotator TransRotator;                                                            // 0x000C (size: 0xC)
    FVector_NetQuantizeNormal Direction;                                              // 0x0018 (size: 0xC)
    char padding_0[0x4];                                                              // 0x0024 (size: 0x4)
    int64 RequestAuthorityID;                                                         // 0x0028 (size: 0x8)

}; // Size: 0x38

struct FProjectileSpawnRelayParameter
{
    FProjectileSpawnParameter SpawnParam;                                             // 0x0000 (size: 0x108)
    char padding_0[0x10];                                                             // 0x0108 (size: 0x10)
    class USceneComponent* AuthorityClientPlayerTargetComp;                           // 0x0118 (size: 0x8)

}; // Size: 0x138

struct FProjectileSpawnRequiredParameter
{
    FSBProjectileSelectHandle Handle;                                                 // 0x0000 (size: 0x18)
    class AActor* Spawner;                                                            // 0x0018 (size: 0x8)
    class AActor* LastHitActor;                                                       // 0x0020 (size: 0x8)
    FProjectileTargetInfoSet TargetInfoSet;                                           // 0x0028 (size: 0x20)
    TArray<class AActor*> IgnoreHitActorList;                                         // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FProjectileSphereCollisionParam : public FProjectileCollisionParamBase
{
    float Radius;                                                                     // 0x001C (size: 0x4)
    TArray<FSBConditionCheckFloatParam> ModifyRadiusList;                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FProjectileSummonImagineConfig
{
    TSoftClassPtr<AASCharacterBase> SummonImagineCharacter;                           // 0x0000 (size: 0x28)
    FVector ImagineCharacterOffsetPos;                                                // 0x0028 (size: 0xC)
    char padding_0[0x4];                                                              // 0x0034 (size: 0x4)
    class USBCharaCreateData* SummonImagineCCD;                                       // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FProjectileTargetInfoSet
{
    TArray<TWeakObjectPtr<USceneComponent>> TargetCompList;                           // 0x0000 (size: 0x10)
    FVector_NetQuantize TargetPoint;                                                  // 0x0010 (size: 0xC)
    uint8 bValidTargetPoint;                                                          // 0x001C (size: 0x1)

}; // Size: 0x20

struct FProjectileWideShotConfig
{
    char padding_0[0x4];                                                              // 0x0000 (size: 0x0)
}; // Size: 0x4

struct FProjectileWideShotRapidConfig
{
    FProjectileRapidConfig RapidConfig;                                               // 0x0000 (size: 0x48)
    float WideRange;                                                                  // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FQuestBoardQuestData
{
    bool bSeparator;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 QuestIndex;                                                                 // 0x0004 (size: 0x4)
    int32 SortId;                                                                     // 0x0008 (size: 0x4)
    EQuestCategory2 Category2;                                                        // 0x000C (size: 0x1)
    EQuestCategory3 Category3;                                                        // 0x000D (size: 0x1)
    EQuestStatus QuestStatus;                                                         // 0x000E (size: 0x1)
    char padding_1[0x1];                                                              // 0x000F (size: 0x1)
    int32 ClassLevelPrecondition;                                                     // 0x0010 (size: 0x4)
    bool bCanReceive;                                                                 // 0x0014 (size: 0x1)
    bool bNew;                                                                        // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FQuestConditionData
{
    char padding_0[0x10];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x10

struct FQuestConditionStepData
{
    char padding_0[0x30];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x30

struct FQuestConsumeItemData
{
    char padding_0[0x8];                                                              // 0x0000 (size: 0x0)
}; // Size: 0x8

struct FQuestListQuestData
{
    int32 QuestIndex;                                                                 // 0x0000 (size: 0x4)
    int32 SortId;                                                                     // 0x0004 (size: 0x4)
    char padding_0[0x1];                                                              // 0x0008 (size: 0x1)
    EQuestStatus QuestStatus;                                                         // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FQuestMasterData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FName LongId;                                                                     // 0x0004 (size: 0x8)
    int32 SortId;                                                                     // 0x000C (size: 0x4)
    EQuestCategory1 Category1;                                                        // 0x0010 (size: 0x1)
    EQuestCategory2 Category2;                                                        // 0x0011 (size: 0x1)
    EQuestCategory3 Category3;                                                        // 0x0012 (size: 0x1)
    bool bActive;                                                                     // 0x0013 (size: 0x1)
    FSBTextTableHash Name;                                                            // 0x0014 (size: 0x4)
    FSBTextTableHash Desc;                                                            // 0x0018 (size: 0x4)
    FName ThumbnailId;                                                                // 0x001C (size: 0x8)
    char padding_0[0x14];                                                             // 0x0024 (size: 0x14)
    FSBTextTableHash ConditionDetail;                                                 // 0x0038 (size: 0x4)
    FName ClientId;                                                                   // 0x003C (size: 0x8)
    FName ReporterId;                                                                 // 0x0044 (size: 0x8)
    bool bAutoReport;                                                                 // 0x004C (size: 0x1)
    char padding_1[0x3];                                                              // 0x004D (size: 0x3)
    FQuestConditionData ConditionInfo;                                                // 0x0050 (size: 0x10)
    TArray<FRewardInfo> RewardInfoList;                                               // 0x0060 (size: 0x10)
    FQuestUnlockData UnlockData;                                                      // 0x0070 (size: 0x10)
    TArray<FQuestConsumeItemData> ConsumeItems;                                       // 0x0080 (size: 0x10)
    FSBTextTableHash DoneTextId;                                                      // 0x0090 (size: 0x4)
    FSBTextTableHash CloseTextId;                                                     // 0x0094 (size: 0x4)
    FSBTextTableHash DoneSynopsisId;                                                  // 0x0098 (size: 0x4)
    FSBTextTableHash CloseSynopsisId;                                                 // 0x009C (size: 0x4)
    FName CloseLocationId;                                                            // 0x00A0 (size: 0x8)
    bool bIgnoreCompleteJingle;                                                       // 0x00A8 (size: 0x1)
    char padding_2[0x3];                                                              // 0x00A9 (size: 0x3)
    FName TextTableName;                                                              // 0x00AC (size: 0x8)
    int32 RepeatCount;                                                                // 0x00B4 (size: 0x4)
    bool bDebug;                                                                      // 0x00B8 (size: 0x1)
    char padding_3[0x3];                                                              // 0x00B9 (size: 0x3)
    FName AcceptTerm;                                                                 // 0x00BC (size: 0x8)
    FName CompleteTerm;                                                               // 0x00C4 (size: 0x8)
    int32 CompletableCount;                                                           // 0x00CC (size: 0x4)
    FQuestRevivalCondition RevivalCondition;                                          // 0x00D0 (size: 0x30)
    TArray<FRewardInfo> AdditionalRewards;                                            // 0x0100 (size: 0x10)
    bool bCompletableCountNotifyEnable;                                               // 0x0110 (size: 0x1)
    bool bRevivalConditionNotifyEnable;                                               // 0x0111 (size: 0x1)

}; // Size: 0x118

struct FQuestProgressInfo
{
    TArray<FQuestProgressItem> Items;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FQuestProgressItem
{
    int32 ConditionDataId;                                                            // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    int32 StepNo;                                                                     // 0x0008 (size: 0x4)
    bool bTalkNpc;                                                                    // 0x000C (size: 0x1)
    char padding_1[0x3];                                                              // 0x000D (size: 0x3)
    int32 KillEnemyNum;                                                               // 0x0010 (size: 0x4)
    int32 CollectItemNum;                                                             // 0x0014 (size: 0x4)
    int32 ClearIDNum;                                                                 // 0x0018 (size: 0x4)
    bool bArrived;                                                                    // 0x001C (size: 0x1)
    bool bPayedMoney;                                                                 // 0x001D (size: 0x1)
    bool bPlayedEmote;                                                                // 0x001E (size: 0x1)
    bool bActivatedWarpPortal;                                                        // 0x001F (size: 0x1)
    int32 InteractedNum;                                                              // 0x0020 (size: 0x4)
    int32 CraftItemNum;                                                               // 0x0024 (size: 0x4)
    bool bAdventurerRankUp;                                                           // 0x0028 (size: 0x1)
    bool bChallengeQuestStart;                                                        // 0x0029 (size: 0x1)
    char padding_2[0x2];                                                              // 0x002A (size: 0x2)
    int32 FangExpeditionNum;                                                          // 0x002C (size: 0x4)
    int32 StackBNum;                                                                  // 0x0030 (size: 0x4)
    char padding_3[0x4];                                                              // 0x0034 (size: 0x4)
    TArray<FString> AchieveConditions;                                                // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FQuestRevivalCondition
{
    EQuestRevivalConditionType Type;                                                  // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 Hours;                                                                      // 0x0004 (size: 0x4)
    FString OnTime;                                                                   // 0x0008 (size: 0x10)
    int32 OnDays;                                                                     // 0x0018 (size: 0x4)
    uint8 OnWeekdays;                                                                 // 0x001C (size: 0x1)
    char padding_1[0x3];                                                              // 0x001D (size: 0x3)
    FName QuestID;                                                                    // 0x0020 (size: 0x8)
    int32 QuestStep;                                                                  // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FQuestUnlockConditionItem
{
    char padding_0[0x34];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x34

struct FQuestUnlockData
{
    char padding_0[0x10];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x10

struct FRandVal
{
    float FMin;                                                                       // 0x0000 (size: 0x4)
    float FMax;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FRandomTreasureBoxChest
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FSBMasterTreasure MasterTreasureByRandom;                                         // 0x0008 (size: 0x68)
    FString GameContentId;                                                            // 0x0070 (size: 0x10)
    FString Tag;                                                                      // 0x0080 (size: 0x10)
    TArray<FRandomTreasureBoxChestGroupContentId> GroupContentId;                     // 0x0090 (size: 0x10)

}; // Size: 0xA0

struct FRandomTreasureBoxChestContentItems
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    ESBTreasureBoxRewardType ItemType;                                                // 0x0010 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0011 (size: 0x3)
    int32 Amount;                                                                     // 0x0014 (size: 0x4)
    float ItemRarity;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FRandomTreasureBoxChestContents
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    TArray<FRandomTreasureBoxChestContentItems> ItemLists;                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FRandomTreasureBoxChestGroupContentId
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int32 PopNum;                                                                     // 0x0004 (size: 0x4)
    int32 ContentId;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FRandomTreasureBoxChestMapInfo
{
    FString Tag;                                                                      // 0x0000 (size: 0x10)
    FString GameContentId;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FRankingCharacterData
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    int32 TotalPower;                                                                 // 0x0020 (size: 0x4)
    int32 ClassRank;                                                                  // 0x0024 (size: 0x4)
    ESBClassType ClassType;                                                           // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FRankingData
{
    int32 Rank;                                                                       // 0x0000 (size: 0x4)
    int32 Value;                                                                      // 0x0004 (size: 0x4)
    FString CharacterId;                                                              // 0x0008 (size: 0x10)
    FString shortId;                                                                  // 0x0018 (size: 0x10)
    FString Name;                                                                     // 0x0028 (size: 0x10)
    int32 TotalPower;                                                                 // 0x0038 (size: 0x4)
    int32 ClassLevel;                                                                 // 0x003C (size: 0x4)
    ESBClassType ClassType;                                                           // 0x0040 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0041 (size: 0x3)
    int32 Achievement;                                                                // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FRankingHistoryData
{
    FString RankingId;                                                                // 0x0000 (size: 0x10)
    FString RankingGroup;                                                             // 0x0010 (size: 0x10)
    FString RankingName;                                                              // 0x0020 (size: 0x10)
    ESBRankingType RankingType;                                                       // 0x0030 (size: 0x1)
    ESBRankingTargetType RankingTargetType;                                           // 0x0031 (size: 0x1)
    char padding_0[0x6];                                                              // 0x0032 (size: 0x6)
    FString EnableGameMode;                                                           // 0x0038 (size: 0x10)
    FString EnableContentId;                                                          // 0x0048 (size: 0x10)
    ESBClassType EnableClassType;                                                     // 0x0058 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0059 (size: 0x7)
    FString ContentId;                                                                // 0x0060 (size: 0x10)
    ESBClassType ClassType;                                                           // 0x0070 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0071 (size: 0x3)
    int32 Season;                                                                     // 0x0074 (size: 0x4)
    int32 RequiredValue;                                                              // 0x0078 (size: 0x4)
    int32 LimitedNumber;                                                              // 0x007C (size: 0x4)
    int32 LastUpdated;                                                                // 0x0080 (size: 0x4)
    char padding_3[0x4];                                                              // 0x0084 (size: 0x4)
    FString TermId;                                                                   // 0x0088 (size: 0x10)
    FString PublicTermId;                                                             // 0x0098 (size: 0x10)

}; // Size: 0xA8

struct FRankingRewardData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FName Ranking_Id;                                                                 // 0x0004 (size: 0x8)
    FName Content_Id;                                                                 // 0x000C (size: 0x8)
    ESBClassType Class_Type;                                                          // 0x0014 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0015 (size: 0x3)
    int32 From_rank;                                                                  // 0x0018 (size: 0x4)
    int32 To_Rank;                                                                    // 0x001C (size: 0x4)
    TArray<FRankingTablereRewardData> Rewards;                                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FRankingTablereRewardData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FName Master_Rewards_ID;                                                          // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FRawOverlapActorInfo
{
    char padding_0[0x18];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x18

struct FRawOverlapCompCombination
{
    char padding_0[0x10];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x10

struct FReadedMarkData
{
    TArray<FString> ReadedIDArray;                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRecipeSetMasterData
{
    int32 RecipeSetId;                                                                // 0x0000 (size: 0x4)
    FSBTextTableHash RecipeSetNameTextId;                                             // 0x0004 (size: 0x4)
    TArray<int32> RecipeIdList;                                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReportData
{
    FString ReportedPlayerId;                                                         // 0x0000 (size: 0x10)
    FString ReportedCharacterId;                                                      // 0x0010 (size: 0x10)
    FString Message;                                                                  // 0x0020 (size: 0x10)
    int32 Category;                                                                   // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FRewardInfo
{
    int32 RewardId;                                                                   // 0x0000 (size: 0x4)
    EQuestRewardCategory Category;                                                    // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    int32 ClearCountForAdditional;                                                    // 0x0008 (size: 0x4)
    FName MasterRewardsId;                                                            // 0x000C (size: 0x8)
    bool bHidden_flag;                                                                // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FSBAIAttackableArea
{
    FVector Offset;                                                                   // 0x0000 (size: 0xC)
    float MinRange;                                                                   // 0x000C (size: 0x4)
    float MaxRange;                                                                   // 0x0010 (size: 0x4)
    float LeftAngle;                                                                  // 0x0014 (size: 0x4)
    float RightAngle;                                                                 // 0x0018 (size: 0x4)
    float UpperAngle;                                                                 // 0x001C (size: 0x4)
    float LowerAngle;                                                                 // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FSBAIComboOnlySkill
{
    FName StanceName;                                                                 // 0x0000 (size: 0x8)
    TArray<FName> ComboOnlyCommand;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAIComboSequenceTreeNode
{
    TArray<FSBAIComboSequenceTreeNodeNextLink> NextList;                              // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FSBAIComboSequenceTreeNodeNextLink
{
    char padding_0[0x14];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x14

struct FSBAIEnemyActionLotteryRuleHolder
{
    bool bInvertResult;                                                               // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    class USBAIEnemyActionLotteryRule* Rule;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSBAIEnemyActionLotteryRules
{
    ESBAIEnemyActionLotteryLogicalOperationType LogicalOperationType;                 // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBAIEnemyActionLotteryRuleHolder> RuleHolders;                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAIEnemyActionLotteryTable : public FTableRowBase
{
    FName ActionName;                                                                 // 0x0008 (size: 0x8)
    ESBAIEnemyActionLotteryPhase Phase;                                               // 0x0010 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0011 (size: 0x3)
    FName Stance;                                                                     // 0x0014 (size: 0x8)
    ESBAIEnemyActionLotteryPartyBattle PartyBattle;                                   // 0x001C (size: 0x1)
    bool bShareRecast;                                                                // 0x001D (size: 0x1)
    char padding_1[0x2];                                                              // 0x001E (size: 0x2)
    FName RequiredActionName;                                                         // 0x0020 (size: 0x8)
    int32 RequiredNumber;                                                             // 0x0028 (size: 0x4)
    float RangeMin;                                                                   // 0x002C (size: 0x4)
    float RangeMax;                                                                   // 0x0030 (size: 0x4)
    float DurationMin;                                                                // 0x0034 (size: 0x4)
    float DurationMax;                                                                // 0x0038 (size: 0x4)
    ESBAIEnemyActionLotteryPriority Priority;                                         // 0x003C (size: 0x1)
    char padding_2[0x3];                                                              // 0x003D (size: 0x3)
    FName WeightGroup;                                                                // 0x0040 (size: 0x8)
    int32 Weight;                                                                     // 0x0048 (size: 0x4)
    int32 WeightInc;                                                                  // 0x004C (size: 0x4)
    FSBAIEnemyActionLotteryRules AdditionalRules;                                     // 0x0050 (size: 0x18)
    ESBAIEnemyActionLotteryModifierTrigger ModifierTrigger;                           // 0x0068 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0069 (size: 0x7)
    TArray<ESBAIEnemyActionLotteryModifierInstant> ModifierInstants;                  // 0x0070 (size: 0x10)
    ESBAIEnemyActionLotteryPriority ModifierPriority;                                 // 0x0080 (size: 0x1)

}; // Size: 0x88

struct FSBAITacticalSkillRootTask
{
    FString TaskName;                                                                 // 0x0000 (size: 0x10)
    FString MethodName;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBAITacticalSkill_AdditionalEffect
{
    FString StateName;                                                                // 0x0000 (size: 0x10)
    ESBAITacticalSkill_StateType ValueType;                                           // 0x0010 (size: 0x1)
    bool bBoolValue;                                                                  // 0x0011 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0012 (size: 0x2)
    int32 IntValue;                                                                   // 0x0014 (size: 0x4)
    float FloatValue;                                                                 // 0x0018 (size: 0x4)
    ESBAITacticalSkill_StateOperation Operation;                                      // 0x001C (size: 0x1)

}; // Size: 0x20

struct FSBAITacticalSkill_AdditionalPrecondition
{
    FString StateName;                                                                // 0x0000 (size: 0x10)
    ESBAITacticalSkill_StateType ValueType;                                           // 0x0010 (size: 0x1)
    bool bBoolValue;                                                                  // 0x0011 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0012 (size: 0x2)
    int32 IntValue;                                                                   // 0x0014 (size: 0x4)
    float FloatValue;                                                                 // 0x0018 (size: 0x4)
    ESBAITacticalSkill_StateComparison Comparison;                                    // 0x001C (size: 0x1)

}; // Size: 0x20

struct FSBAITacticalSkill_DomainOverride
{
    FAIFwParameterizedHTNDomain Domain;                                               // 0x0000 (size: 0x18)
    bool bOverrideCompound;                                                           // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FSBAITask_FleeFromParams
{
    char padding_0[0x38];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x38

struct FSBAbilityConditionConfig : public FTableRowBase
{
    TSubclassOf<class USBAbilityCondition> Condition;                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSBAbilityConditionID
{
    FName ID;                                                                         // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSBAbilityConditionInfo
{
    FSBAbilityConditionID ConditionId;                                                // 0x0000 (size: 0x8)
    int32 Value;                                                                      // 0x0008 (size: 0x4)
    uint8 bIsForceCondition;                                                          // 0x000C (size: 0x1)

}; // Size: 0x10

struct FSBAbilityConfig : public FTableRowBase
{
    TSubclassOf<class USBAbility> Object;                                             // 0x0008 (size: 0x8)
    ESBAbilityExecuteEnv ExecuteEnv;                                                  // 0x0010 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0011 (size: 0x3)
    int32 MaxTriggers;                                                                // 0x0014 (size: 0x4)
    ESBAbilitySimultaneousActivationControl SimultaneousControl;                      // 0x0018 (size: 0x1)
    ESBAbilityFlags Flag;                                                             // 0x0019 (size: 0x1)
    ESBAbilityEffectiveCategory EffectiveCategory;                                    // 0x001A (size: 0x1)
    ESBBattleEffectiveFeel FeelType;                                                  // 0x001B (size: 0x1)
    FSBBattleStatusEffectID EffectId;                                                 // 0x001C (size: 0x8)
    ESBAbilityCalcSuccessRate CalcSuccessRate;                                        // 0x0024 (size: 0x1)
    ESBBattleStatusResistType ReferenceResistType;                                    // 0x0025 (size: 0x1)
    char padding_1[0x2];                                                              // 0x0026 (size: 0x2)
    uint8 bExclusionLevelDifference;                                                  // 0x0028 (size: 0x1)
    uint8 bApplyAccumulation;                                                         // 0x0028 (size: 0x1)
    uint8 bIsImpossibleSummonMount;                                                   // 0x0028 (size: 0x1)
    uint8 bIsFinishMount;                                                             // 0x0028 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0029 (size: 0x3)
    ESBStatusAilmentIconType IconType;                                                // 0x002C (size: 0x1)
    char padding_3[0x3];                                                              // 0x002D (size: 0x3)
    int32 UIAttribute;                                                                // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FSBAbilityDataInterface
{
    char padding_0[0x8];                                                              // 0x0000 (size: 0x0)
}; // Size: 0x8

struct FSBAbilityEffectData
{
    FSBAbilityMasterID ID;                                                            // 0x0000 (size: 0x4)
    int32 Parts1Value1;                                                               // 0x0004 (size: 0x4)
    int32 Parts1Value2;                                                               // 0x0008 (size: 0x4)
    int32 Parts2Value1;                                                               // 0x000C (size: 0x4)
    int32 Parts2Value2;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FSBAbilityEffectMasterData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int32 AbilityID;                                                                  // 0x0004 (size: 0x4)
    FSBTextTableHash Name;                                                            // 0x0008 (size: 0x4)
    FSBTextTableHash Desc;                                                            // 0x000C (size: 0x4)
    int32 Ability_parts1_Value1;                                                      // 0x0010 (size: 0x4)
    int32 Ability_parts1_Value2;                                                      // 0x0014 (size: 0x4)
    int32 Ability_parts2_Value1;                                                      // 0x0018 (size: 0x4)
    int32 Ability_parts2_Value2;                                                      // 0x001C (size: 0x4)
    int32 LotteryGroupId;                                                             // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FSBAbilityElementStatusReinforceLevelModifySetting
{
    int32 StatusAilmentLevel;                                                         // 0x0000 (size: 0x4)
    float ModifyValue;                                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBAbilityGroupConfig
{
    FSBBattleStatusEffectID EffectId;                                                 // 0x0000 (size: 0x8)
    ESBStatusAilmentIconType IconType;                                                // 0x0008 (size: 0x1)
    ESBAbilityFlags Flag;                                                             // 0x0009 (size: 0x1)
    char padding_0[0x2];                                                              // 0x000A (size: 0x2)
    int32 MaxTriggers;                                                                // 0x000C (size: 0x4)
    ESBAbilitySimultaneousActivationControl SimultaneousControl;                      // 0x0010 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0011 (size: 0x7)
    TArray<ESBBattleEffectiveGroup> ExcludeGroupList;                                 // 0x0018 (size: 0x10)
    uint8 bIsImpossibleSummonMount;                                                   // 0x0028 (size: 0x1)
    uint8 bApplyGroupCalcToAbility;                                                   // 0x0028 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0029 (size: 0x3)
    ESBAbilityCalcSuccessRate CalcSuccessRate;                                        // 0x002C (size: 0x1)
    ESBBattleStatusResistType ReferenceResistType;                                    // 0x002D (size: 0x1)
    char padding_3[0x2];                                                              // 0x002E (size: 0x2)
    uint8 bExclusionLevelDifference;                                                  // 0x0030 (size: 0x1)
    uint8 bApplyAccumulation;                                                         // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FSBAbilityID
{
    FName ID;                                                                         // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSBAbilityLimitParam
{
    uint8 bEnable;                                                                    // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 Max;                                                                        // 0x0004 (size: 0x4)
    int32 Min;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBAbilityMasterData : public FSBAbilityDataInterface
{
    int32 ID;                                                                         // 0x0008 (size: 0x4)
    EAbilityCategoryType Category;                                                    // 0x000C (size: 0x1)
    char padding_0[0x3];                                                              // 0x000D (size: 0x3)
    FName Ability_parts1_Name;                                                        // 0x0010 (size: 0x8)
    FSBTextTableHash Ability_Name1;                                                   // 0x0018 (size: 0x4)
    FName Ability_parts2_Name;                                                        // 0x001C (size: 0x8)
    FSBTextTableHash Ability_Name2;                                                   // 0x0024 (size: 0x4)
    FName Dynamic_Condition1_type;                                                    // 0x0028 (size: 0x8)
    int32 Dynamic_Condition1_value;                                                   // 0x0030 (size: 0x4)
    bool Dynamic_Condition1_forcecondition;                                           // 0x0034 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0035 (size: 0x3)
    float Dynamic_condition1_effectivetime;                                           // 0x0038 (size: 0x4)
    float Dynamic_Condition1_interval;                                                // 0x003C (size: 0x4)

}; // Size: 0x40

struct FSBAbilityMasterID
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSBAbilityModifyData : public FTableRowBase
{
    FDataTableRowHandle RowHandle;                                                    // 0x0008 (size: 0x10)
    TArray<FSBAbilityModifyParam> ModiryParamList;                                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBAbilityModifyParam
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    TArray<FSBAbilityPartsModifyParam> PartsList;                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBAbilityParts
{
    FSBAbilityID AbilityID;                                                           // 0x0000 (size: 0x8)
    int32 Value1;                                                                     // 0x0008 (size: 0x4)
    int32 Value2;                                                                     // 0x000C (size: 0x4)
    uint8 bIndividualRate;                                                            // 0x0010 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0011 (size: 0x3)
    float Rate;                                                                       // 0x0014 (size: 0x4)
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBAbilityPartsModifyParam
{
    FSBAbilityID AbilityID;                                                           // 0x0000 (size: 0x8)
    bool bOverride;                                                                   // 0x0008 (size: 0x1)
    bool bModifyValue1;                                                               // 0x0009 (size: 0x1)
    char padding_0[0x2];                                                              // 0x000A (size: 0x2)
    int32 Value1;                                                                     // 0x000C (size: 0x4)
    class UCurveFloat* Value1Curve;                                                   // 0x0010 (size: 0x8)
    bool bModifyValue2;                                                               // 0x0018 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0019 (size: 0x3)
    int32 Value2;                                                                     // 0x001C (size: 0x4)

}; // Size: 0x20

struct FSBAbilityTextData
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString Desc;                                                                     // 0x0010 (size: 0x10)
    bool bValidAbility1;                                                              // 0x0020 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0021 (size: 0x7)
    FString AbilityEffectName1;                                                       // 0x0028 (size: 0x10)
    bool bValidAbility2;                                                              // 0x0038 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0039 (size: 0x7)
    FString AbilityEffectName2;                                                       // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FSBAbilityValueLimit
{
    ESBAbilityValueLimitType LimitType;                                               // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 Value;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBAccumulationResistSetting
{
    float SuccessRate;                                                                // 0x0000 (size: 0x4)
    float EffectiveTimeRate;                                                          // 0x0004 (size: 0x4)
    float Time;                                                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBAchievementInfo
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSBAchievementLargeCategoryInfo
{
    int32 LargeCategoryId;                                                            // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<int32> MediumCategoryList;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAchievementRewardData
{
    TArray<FOwnItemInfo> DirtyItems;                                                  // 0x0000 (size: 0x10)
    TArray<FOwnItemInfo> SoldItems;                                                   // 0x0010 (size: 0x10)
    TArray<FSBCharacterToken> Tokens;                                                 // 0x0020 (size: 0x10)
    int32 AddLuno;                                                                    // 0x0030 (size: 0x4)
    int32 AddGC;                                                                      // 0x0034 (size: 0x4)
    int32 AddExp;                                                                     // 0x0038 (size: 0x4)
    int32 FreeCurrencies;                                                             // 0x003C (size: 0x4)
    int32 VanishedMoney;                                                              // 0x0040 (size: 0x4)
    int32 VanishedGc;                                                                 // 0x0044 (size: 0x4)
    int32 VanishedExp;                                                                // 0x0048 (size: 0x4)
    int32 VanishedCurrencies;                                                         // 0x004C (size: 0x4)
    TArray<FSBAchievementRewardedStampData> VanishStampDataList;                      // 0x0050 (size: 0x10)
    TArray<int32> AwardIdList;                                                        // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FSBAchievementRewardedStampData
{
    int32 StampId;                                                                    // 0x0000 (size: 0x4)
    bool IsNew;                                                                       // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FSBAchievementSelectCategory
{
    int32 LargeCategory;                                                              // 0x0000 (size: 0x4)
    int32 MidiumCategory;                                                             // 0x0004 (size: 0x4)
    bool IsSelect;                                                                    // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSBActionGamepadKeyPair
{
    TEnumAsByte<ESBKeyConfigAction::Type> Action;                                     // 0x0000 (size: 0x1)
    TEnumAsByte<ESBKeyConfigGamepadKey::Type> Key;                                    // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSBActionKeyboardKeyPair
{
    TEnumAsByte<ESBKeyConfigAction::Type> Action;                                     // 0x0000 (size: 0x1)
    TEnumAsByte<ESBKeyConfigKeyboardKey::Type> Key;                                   // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSBActionMouseKeyPair
{
    TEnumAsByte<ESBKeyConfigAction::Type> Action;                                     // 0x0000 (size: 0x1)
    TEnumAsByte<ESBKeyConfigMouseKey::Type> Key;                                      // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSBActiveArtsID
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSBActiveItemData
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    int32 ItemIndex;                                                                  // 0x0010 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0014 (size: 0x4)
    FDateTime LimitTime;                                                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSBActiveItemList
{
    TArray<FSBActiveItemData> ActiveItems;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSBActiveOutGameBuffDataList
{
    EOutGameBuffType BuffType;                                                        // 0x0000 (size: 0x1)
    char padding_0[0x17];                                                             // 0x0001 (size: 0x17)
    TArray<class USBActiveOutGameBuffData*> BuffDataList;                             // 0x0018 (size: 0x10)

}; // Size: 0x30

struct FSBActivityData
{
    ESBActivityType Type;                                                             // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FDateTime AchieveTime;                                                            // 0x0008 (size: 0x8)
    TArray<FSBActivityDataParam> Params;                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBActivityDataParam
{
    FString Key;                                                                      // 0x0000 (size: 0x10)
    FString Value;                                                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBAddItemData
{
    int32 storage_no;                                                                 // 0x0000 (size: 0x4)
    EItemType item_type;                                                              // 0x0004 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0005 (size: 0x3)
    int32 item_id;                                                                    // 0x0008 (size: 0x4)
    int32 Amount;                                                                     // 0x000C (size: 0x4)
    bool identified;                                                                  // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FSBAdjustRootMotionSettings
{
    FSBCharacterAdjustRootMotionSettings_AdjustVelocity AdjustVelocitySettings;       // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    FSBCharacterAdjustRootMotionSettings_TargetLocation TargetLocationSettings;       // 0x0004 (size: 0x28)
    FSBCharacterAdjustRootMotionSettings_Facing FacingSettings;                       // 0x002C (size: 0x8)
    FSBCharacterAdjustRootMotionSettings_Following FollowingSettings;                 // 0x0034 (size: 0x8)
    FVector ScaleRatio;                                                               // 0x003C (size: 0xC)
    FName TargetLocationOffsetSocketName;                                             // 0x0048 (size: 0x8)
    FVector TargetLocationOffset;                                                     // 0x0050 (size: 0xC)
    bool bEnablePredictTarget;                                                        // 0x005C (size: 0x1)
    char padding_1[0x3];                                                              // 0x005D (size: 0x3)
    int32 TargetIndex;                                                                // 0x0060 (size: 0x4)
    ESBAdjustRootMotionAdjustType AdjustType;                                         // 0x0064 (size: 0x1)
    ESBAdjustRootMotionTargetInterpolationType TargetInterpolationType;               // 0x0065 (size: 0x1)
    char padding_2[0x2];                                                              // 0x0066 (size: 0x2)
    float TargetDistanceRatio;                                                        // 0x0068 (size: 0x4)
    float TargetLocationOffsetZ;                                                      // 0x006C (size: 0x4)
    float RequiredStartLocationOffsetZ;                                               // 0x0070 (size: 0x4)
    float TraceTargetBelowHeight;                                                     // 0x0074 (size: 0x4)
    float AdjustRangeMin;                                                             // 0x0078 (size: 0x4)
    float AdjustRangeMax;                                                             // 0x007C (size: 0x4)
    float YawAngleMax;                                                                // 0x0080 (size: 0x4)
    float PitchAngleMax;                                                              // 0x0084 (size: 0x4)
    bool bUseManualOffset;                                                            // 0x0088 (size: 0x1)
    bool bAdjustWithZAxis;                                                            // 0x0089 (size: 0x1)
    bool bAdjustNavMeshArea;                                                          // 0x008A (size: 0x1)
    bool bCheckNavigationRaycast;                                                     // 0x008B (size: 0x1)
    ESBAdjustRootMotionZAxisMode ZAxisMode;                                           // 0x008C (size: 0x1)
    char padding_3[0x3];                                                              // 0x008D (size: 0x3)
    float FacingRotationRate;                                                         // 0x0090 (size: 0x4)
    float FollowTime;                                                                 // 0x0094 (size: 0x4)
    float FollowRotationRate;                                                         // 0x0098 (size: 0x4)
    float FollowVelocity;                                                             // 0x009C (size: 0x4)
    float PredictTime;                                                                // 0x00A0 (size: 0x4)
    float MinAdjustLength;                                                            // 0x00A4 (size: 0x4)
    float MaxAdjustLength;                                                            // 0x00A8 (size: 0x4)
    float YawMaxAngle;                                                                // 0x00AC (size: 0x4)
    float PitchMaxAngle;                                                              // 0x00B0 (size: 0x4)
    float FrontTargetOffset;                                                          // 0x00B4 (size: 0x4)
    float TopTargetOffset;                                                            // 0x00B8 (size: 0x4)
    float YawRotationRate;                                                            // 0x00BC (size: 0x4)

}; // Size: 0xC0

struct FSBAdventureBoardCondition
{
    FString Condition;                                                                // 0x0000 (size: 0x10)
    FString Progress;                                                                 // 0x0010 (size: 0x10)
    FString MissonId;                                                                 // 0x0020 (size: 0x10)
    bool Complated;                                                                   // 0x0030 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0031 (size: 0x3)
    int32 OrderPriority;                                                              // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FSBAdventureBoardInfo
{
    FSBTextTableHash NameId;                                                          // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBAdventureBoardCondition> ConditionList;                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAdventureBoardListManager
{
    TArray<FSBAdventureBoardParam> BoardParamList;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSBAdventureBoardMissionParamMasterData
{
    FString MissionId;                                                                // 0x0000 (size: 0x10)
    ESBMissionQuestType Type;                                                         // 0x0010 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0011 (size: 0x7)
    FString QuestID;                                                                  // 0x0018 (size: 0x10)
    FString QuestGroupId;                                                             // 0x0028 (size: 0x10)
    FSBTextTableHash NameId;                                                          // 0x0038 (size: 0x4)
    char padding_1[0x4];                                                              // 0x003C (size: 0x4)
    FString MapId;                                                                    // 0x0040 (size: 0x10)
    FString EnemyId;                                                                  // 0x0050 (size: 0x10)
    ESBMissionQuestItemType ItemType;                                                 // 0x0060 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0061 (size: 0x7)
    FString ItemIdString;                                                             // 0x0068 (size: 0x10)
    ESBClassType ClassType;                                                           // 0x0078 (size: 0x1)
    ESBMissionQuestPlaceType PlaceType;                                               // 0x0079 (size: 0x1)
    char padding_3[0x6];                                                              // 0x007A (size: 0x6)
    FString BuffId;                                                                   // 0x0080 (size: 0x10)
    int32 CountBonus;                                                                 // 0x0090 (size: 0x4)
    char padding_4[0x4];                                                              // 0x0094 (size: 0x4)
    FString CountBonusTermId;                                                         // 0x0098 (size: 0x10)

}; // Size: 0xA8

struct FSBAdventureBoardMissionTypeData : public FTableRowBase
{
    ESBAdventureBoardPanelMissionType Type;                                           // 0x0008 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0009 (size: 0x3)
    int32 TypeNameId;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSBAdventureBoardNotifyClearStatus
{
    ESBAdventureBoardClearStatus Status;                                              // 0x0000 (size: 0x1)
    bool IsComplete;                                                                  // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSBAdventureBoardPanelParam
{
    int32 PanelId;                                                                    // 0x0000 (size: 0x4)
    int32 ProgressCnt;                                                                // 0x0004 (size: 0x4)
    ESBAdventureBoardPanelStatus Status;                                              // 0x0008 (size: 0x1)
    bool IsHudDraw;                                                                   // 0x0009 (size: 0x1)
    bool IsNewOpen;                                                                   // 0x000A (size: 0x1)

}; // Size: 0xC

struct FSBAdventureBoardPanelParamMasterData
{
    int32 PanelId;                                                                    // 0x0000 (size: 0x4)
    int32 BoardId;                                                                    // 0x0004 (size: 0x4)
    FVector2D UIPos;                                                                  // 0x0008 (size: 0x8)
    ESBAdventureBoardPanelType Type;                                                  // 0x0010 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0011 (size: 0x7)
    FString MissionId;                                                                // 0x0018 (size: 0x10)
    int32 RequiredCnt;                                                                // 0x0028 (size: 0x4)
    char padding_1[0x4];                                                              // 0x002C (size: 0x4)
    TArray<FName> RewardIdList;                                                       // 0x0030 (size: 0x10)
    TArray<int32> NextPanelList;                                                      // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FSBAdventureBoardPanelUpdateData
{
    int32 BoardId;                                                                    // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FString PanelId;                                                                  // 0x0008 (size: 0x10)
    ESBAdventureBoardPanelStatus Status;                                              // 0x0018 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0019 (size: 0x3)
    int32 ProgressCnt;                                                                // 0x001C (size: 0x4)

}; // Size: 0x20

struct FSBAdventureBoardParam
{
    int32 BoardId;                                                                    // 0x0000 (size: 0x4)
    ESBAdventureBoardStatus Status;                                                   // 0x0004 (size: 0x1)
    bool IsActive;                                                                    // 0x0005 (size: 0x1)
    bool IsFavorite;                                                                  // 0x0006 (size: 0x1)
    bool IsHudDraw;                                                                   // 0x0007 (size: 0x1)
    TArray<FSBAdventureBoardPanelParam> PanelParamList;                               // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAdventureBoardParamMasterData
{
    int32 BoardId;                                                                    // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FString VersionId;                                                                // 0x0008 (size: 0x10)
    FSBTextTableHash NameId;                                                          // 0x0018 (size: 0x4)
    int32 IconID;                                                                     // 0x001C (size: 0x4)
    ESBAdventureBoardType Type;                                                       // 0x0020 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0021 (size: 0x7)
    TArray<FName> CompleteRewardIdList;                                               // 0x0028 (size: 0x10)
    FString ChallengeTermId;                                                          // 0x0038 (size: 0x10)
    FString AcceptanceTermId;                                                         // 0x0048 (size: 0x10)
    ESBClassType ClassType;                                                           // 0x0058 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0059 (size: 0x7)
    TArray<FSBAdventureBoardPanelParamMasterData> PanelParamList;                     // 0x0060 (size: 0x10)
    int32 SortId;                                                                     // 0x0070 (size: 0x4)
    FSBTextTableHash DescID;                                                          // 0x0074 (size: 0x4)

}; // Size: 0x78

struct FSBAdventureBoardRouteParam
{
    int32 StartPanelId;                                                               // 0x0000 (size: 0x4)
    int32 TermPanelId;                                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBAdventureBoardUpdateData
{
    int32 BoardId;                                                                    // 0x0000 (size: 0x4)
    ESBAdventureBoardStatus Status;                                                   // 0x0004 (size: 0x1)
    bool IsActive;                                                                    // 0x0005 (size: 0x1)
    bool IsHudDraw;                                                                   // 0x0006 (size: 0x1)
    bool IsFavorite;                                                                  // 0x0007 (size: 0x1)

}; // Size: 0x8

struct FSBAdventurerRankMasterData
{
    int32 Rank;                                                                       // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<int32> AdventureBoardIdList;                                               // 0x0008 (size: 0x10)
    int32 DistributeAdventureBoardId;                                                 // 0x0018 (size: 0x4)
    char padding_1[0x4];                                                              // 0x001C (size: 0x4)
    TArray<FString> GameContentIds;                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSBAestheShopAppearanceInfo
{
    int32 InfoId;                                                                     // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FSBCharaCreateParameter CharaCreateParameter;                                     // 0x0008 (size: 0x3C0)
    FDateTime DataSaveDateTime;                                                       // 0x03C8 (size: 0x8)

}; // Size: 0x3D0

struct FSBAestheShopCharaParamRestrictionMasterData
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    ESBCharacterGender Gender;                                                        // 0x0010 (size: 0x1)
    ESBAestheShopCharaPartsAndParamEditType EditType;                                 // 0x0011 (size: 0x1)
    char padding_0[0x6];                                                              // 0x0012 (size: 0x6)
    TArray<int32> ParamValueList;                                                     // 0x0018 (size: 0x10)
    int32 ParamMin;                                                                   // 0x0028 (size: 0x4)
    int32 ParamMax;                                                                   // 0x002C (size: 0x4)

}; // Size: 0x30

struct FSBAestheShopCharaPartsIconInfoForSort
{
    int32 SortId;                                                                     // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x0008 (size: 0x28)
    FName AssetId;                                                                    // 0x0030 (size: 0x8)
    FString IconID;                                                                   // 0x0038 (size: 0x10)
    bool bIsNew;                                                                      // 0x0048 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0049 (size: 0x7)
    FString TermId;                                                                   // 0x0050 (size: 0x10)
    int64 TermTicks;                                                                  // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FSBAestheShopCourseMasterData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FSBTextTableHash Name;                                                            // 0x0004 (size: 0x4)
    FSBTextTableHash Desc;                                                            // 0x0008 (size: 0x4)
    char padding_0[0x4];                                                              // 0x000C (size: 0x4)
    FString CourseIconName;                                                           // 0x0010 (size: 0x10)
    bool CanBeCompleted;                                                              // 0x0020 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0021 (size: 0x3)
    int32 TicketId;                                                                   // 0x0024 (size: 0x4)
    int32 TicketConsumeAmount;                                                        // 0x0028 (size: 0x4)
    EAestheShopCourseUsableCategory CategoryGender;                                   // 0x002C (size: 0x1)
    EAestheShopCourseUsableCategory CategoryPreset;                                   // 0x002D (size: 0x1)
    EAestheShopCourseUsableCategory CategoryAppearance;                               // 0x002E (size: 0x1)
    EAestheShopCourseUsableCategory CategoryDefaultVoice;                             // 0x002F (size: 0x1)
    EAestheShopCourseUsableCategory CategoryExtraVoice;                               // 0x0030 (size: 0x1)
    EAestheShopCourseUsableCategory CategoryFaceTypeAndBody;                          // 0x0031 (size: 0x1)
    EAestheShopCourseUsableCategory CategoryHair;                                     // 0x0032 (size: 0x1)
    EAestheShopCourseUsableCategory CategorySkinAndFace;                              // 0x0033 (size: 0x1)
    EAestheShopCourseUsableCategory CategoryEyeParts;                                 // 0x0034 (size: 0x1)
    EAestheShopCourseUsableCategory CategoryFaceParts;                                // 0x0035 (size: 0x1)
    EAestheShopCourseUsableCategory CategoryMakeup;                                   // 0x0036 (size: 0x1)
    char padding_2[0x1];                                                              // 0x0037 (size: 0x1)
    FString EventTermId;                                                              // 0x0038 (size: 0x10)
    bool IsListVisible;                                                               // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FSBAestheShopPartsMasterData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FString IconID;                                                                   // 0x0008 (size: 0x10)
    FString AssetId;                                                                  // 0x0018 (size: 0x10)
    int32 SortId;                                                                     // 0x0028 (size: 0x4)
    bool IsActive;                                                                    // 0x002C (size: 0x1)
    char padding_1[0x3];                                                              // 0x002D (size: 0x3)
    FString EventTermId;                                                              // 0x0030 (size: 0x10)
    ESBCharacterGender Gender;                                                        // 0x0040 (size: 0x1)
    ESBAestheShopCharaPartsIconType PartsIconType;                                    // 0x0041 (size: 0x1)
    ESBAestheShopCharaFaceType FaceType;                                              // 0x0042 (size: 0x1)
    ESBAestheShopCharaBodyType BodyType;                                              // 0x0043 (size: 0x1)
    ESBAestheShopCharaHairType HairType;                                              // 0x0044 (size: 0x1)
    ESBAestheShopCharaPartsAndParamEditType EditType;                                 // 0x0045 (size: 0x1)

}; // Size: 0x48

struct FSBAimBodyBlendRateSetting
{
    FName Tag;                                                                        // 0x0000 (size: 0x8)
    float BlendRate;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBAkEventLODTableRow : public FTableRowBase
{
    ESBAkEventLOD LOD;                                                                // 0x0008 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0009 (size: 0x3)
    float Distance;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSBAkEventTriggerAreaData
{
    int32 Priority;                                                                   // 0x0010 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0014 (size: 0x4)
    FString CategoryName;                                                             // 0x0018 (size: 0x10)
    class UAkAudioEvent* BeginOverlapAkEvent;                                         // 0x0028 (size: 0x8)
    class UAkAudioEvent* EndOverlapAkEvent;                                           // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FSBAkRTPC
{
    FName RTPCName;                                                                   // 0x0000 (size: 0x8)
    float Value;                                                                      // 0x0008 (size: 0x4)
    float ValueMin;                                                                   // 0x000C (size: 0x4)
    float ValueMax;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FSBAmbientAkEventAssetData
{
    char padding_0[0x30];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x30

struct FSBAnimSingleNodeInstanceProxy : public FAnimSingleNodeInstanceProxy
{
    char padding_0[0x8C0];                                                            // 0x0000 (size: 0x0)
}; // Size: 0x8C0

struct FSBAnimTagEffectSetting
{
    FName AnimTag;                                                                    // 0x0008 (size: 0x8)
    FSBEffectAsset Effect;                                                            // 0x0010 (size: 0x1A8)

}; // Size: 0x1B8

struct FSBArenaMissionData : public FTableRowBase
{
    EArenaMissionAchieveType Type;                                                    // 0x0008 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0009 (size: 0x7)
    FString Value1;                                                                   // 0x0010 (size: 0x10)
    FString Value2;                                                                   // 0x0020 (size: 0x10)
    float LimitTime;                                                                  // 0x0030 (size: 0x4)
    char padding_1[0x4];                                                              // 0x0034 (size: 0x4)
    FDataTableRowHandle MissionRewardHandle;                                          // 0x0038 (size: 0x10)
    FText RewardText;                                                                 // 0x0048 (size: 0x18)

}; // Size: 0x60

struct FSBAttackCollisionAddition
{
    bool bOverrideAttackHitType;                                                      // 0x0000 (size: 0x1)
    EAttackHitType AttackHitType;                                                     // 0x0001 (size: 0x1)
    int16 AttackDirectionOffset;                                                      // 0x0002 (size: 0x2)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBConditionCheckFloatParam> ModifyScaleList;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAttackDeactiveStatusGroupData
{
    ESBBattleEffectiveGroup Group;                                                    // 0x0000 (size: 0x1)
    bool bDeactiveStatusGivenByOther;                                                 // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSBAttackDeactiveStatusHandleData
{
    FDataTableRowHandle Handle;                                                       // 0x0000 (size: 0x10)
    bool bDeactiveStatusGivenByOther;                                                 // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FSBAttackDirectionSetting
{
    ESBAttackDirectionOrigin AttackDirectionOrigin;                                   // 0x0000 (size: 0x1)
    ESBAttackDirectionType AttackDirection;                                           // 0x0001 (size: 0x1)
    int16 DirectionYaw;                                                               // 0x0002 (size: 0x2)
    uint8 bEnableBackAttackTrigger;                                                   // 0x0004 (size: 0x1)
    uint8 bSpecifyGuardDirection;                                                     // 0x0004 (size: 0x1)
    ESBAttackDirectionOrigin AttackDirectionOriginForGuard;                           // 0x0005 (size: 0x1)
    ESBAttackDirectionType AttackDirectionForGuard;                                   // 0x0006 (size: 0x1)

}; // Size: 0x8

struct FSBAttackHitLaunchProjectile
{
    FSBAttackID AttackID;                                                             // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FDataTableRowHandle RowHandle;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBAttackHitSelfApplyStatus
{
    FSBAttackID AttackID;                                                             // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    FDataTableRowHandle RowHandle;                                                    // 0x0008 (size: 0x10)
    float DelayTime;                                                                  // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FSBAttackHitStatusAilmentCondition
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    FDataTableRowHandle StatusAilmentHandle;                                          // 0x0010 (size: 0x10)
    bool bApplyDuplicateStatusAilment;                                                // 0x0020 (size: 0x1)
    bool bCheckSelfApplyOnlyDuplicateStatusAilment;                                   // 0x0021 (size: 0x1)

}; // Size: 0x28

struct FSBAttackHitStopSetting
{
    float AttackHitStopTime;                                                          // 0x0000 (size: 0x4)
    float DamageHitStopTime;                                                          // 0x0004 (size: 0x4)
    ESBHitSlomoPower HitSlomoPower;                                                   // 0x0008 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0009 (size: 0x3)
    uint8 bSlomoAttackActor;                                                          // 0x000C (size: 0x1)
    uint8 bSlomoDamageActor;                                                          // 0x000C (size: 0x1)
    char padding_1[0x3];                                                              // 0x000D (size: 0x3)
    ESBHitSlomoType DamageHitStopType;                                                // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FSBAttackID
{
    int32 AttackID;                                                                   // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSBAttackMasterData
{
    int32 AttackID;                                                                   // 0x0000 (size: 0x4)
    int32 Name;                                                                       // 0x0004 (size: 0x4)
    int32 HitCount;                                                                   // 0x0008 (size: 0x4)
    float HitInterval;                                                                // 0x000C (size: 0x4)
    EAttackHitType attack_hit_type;                                                   // 0x0010 (size: 0x1)
    EAttackAttributeType attack_attribute_type;                                       // 0x0011 (size: 0x1)
    EDamageType damage_type;                                                          // 0x0012 (size: 0x1)
    char padding_0[0x1];                                                              // 0x0013 (size: 0x1)
    float AttackScale;                                                                // 0x0014 (size: 0x4)
    int32 damage_value1;                                                              // 0x0018 (size: 0x4)
    int32 damage_value2;                                                              // 0x001C (size: 0x4)
    float back_attack_scale;                                                          // 0x0020 (size: 0x4)
    float down_attack_scale;                                                          // 0x0024 (size: 0x4)
    float BadConditionAttackScale;                                                    // 0x0028 (size: 0x4)
    float ShieldDamageModifyRate;                                                     // 0x002C (size: 0x4)
    FSBAttackDirectionSetting attack_direction_setting;                               // 0x0030 (size: 0x8)
    ESBDamageAttackType attack_type;                                                  // 0x0038 (size: 0x1)
    ESBAttackThroughType through_type;                                                // 0x0039 (size: 0x1)
    char padding_1[0x2];                                                              // 0x003A (size: 0x2)
    uint8 bAttribute_Explode;                                                         // 0x003C (size: 0x1)
    char padding_2[0x3];                                                              // 0x003D (size: 0x3)
    FSBAttackStunSetting StunSetting;                                                 // 0x0040 (size: 0x18)
    FSBAttackHitStopSetting HitStop;                                                  // 0x0058 (size: 0x14)
    char padding_3[0x4];                                                              // 0x006C (size: 0x4)
    FString HitSlomoCurveName;                                                        // 0x0070 (size: 0x10)
    FSBHitKnockBackSetting HitKnockBack;                                              // 0x0080 (size: 0x18)
    float Hate;                                                                       // 0x0098 (size: 0x4)
    char padding_4[0x4];                                                              // 0x009C (size: 0x4)
    FString special_hit_effect_name;                                                  // 0x00A0 (size: 0x10)
    char padding_5[0x8];                                                              // 0x00B0 (size: 0x8)
    TArray<FSBAttackParam> AttackParam;                                               // 0x00B8 (size: 0x10)

}; // Size: 0xE8

struct FSBAttackMasterDataModifyData : public FTableRowBase
{
    FSBAttackID AttackID;                                                             // 0x0008 (size: 0x4)
    char padding_0[0x4];                                                              // 0x000C (size: 0x4)
    TArray<FSBAttackMasterDataModifyParam> ModiryParamList;                           // 0x0010 (size: 0x10)
    TArray<FDataTableRowHandle> ModiryParamRowHandleList;                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSBAttackMasterDataModifyParam
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    bool bOverride;                                                                   // 0x0010 (size: 0x1)
    bool bModifyHitInterval;                                                          // 0x0011 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0012 (size: 0x2)
    float HitInterval;                                                                // 0x0014 (size: 0x4)
    float DamageModifyRate;                                                           // 0x0018 (size: 0x4)
    int32 AttackScaleModifyRate;                                                      // 0x001C (size: 0x4)
    bool bModifyDamageValue1;                                                         // 0x0020 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0021 (size: 0x3)
    float DamageValue1;                                                               // 0x0024 (size: 0x4)
    bool bModifyDownAttackScale;                                                      // 0x0028 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0029 (size: 0x3)
    float DownAttackScale;                                                            // 0x002C (size: 0x4)
    bool bModifyBadConditionAttackScale;                                              // 0x0030 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0031 (size: 0x3)
    float BadConditionAttackScale;                                                    // 0x0034 (size: 0x4)
    float ShieldDamageModifyRate;                                                     // 0x0038 (size: 0x4)
    bool bModifyAttackDirection;                                                      // 0x003C (size: 0x1)
    char padding_4[0x1];                                                              // 0x003D (size: 0x1)
    FSBAttackDirectionSetting AttackDirectionSetting;                                 // 0x003E (size: 0x8)
    bool bModifyAttackThroughConfig;                                                  // 0x0046 (size: 0x1)
    char padding_5[0x1];                                                              // 0x0047 (size: 0x1)
    FSBAttackThroughConfig AttackThroughConfig;                                       // 0x0048 (size: 0x8)
    bool bModifyStunDirection;                                                        // 0x0050 (size: 0x1)
    ESBStunDirection StunDirection;                                                   // 0x0051 (size: 0x1)
    char padding_6[0x6];                                                              // 0x0052 (size: 0x6)
    TArray<FSBElementDamageModifySetting> ElementDamageModifySettingList;             // 0x0058 (size: 0x10)
    bool bModifyHitStop;                                                              // 0x0068 (size: 0x1)
    char padding_7[0x3];                                                              // 0x0069 (size: 0x3)
    FSBAttackHitStopSetting HitStop;                                                  // 0x006C (size: 0x14)
    bool bModifyHitKnockBack;                                                         // 0x0080 (size: 0x1)
    char padding_8[0x3];                                                              // 0x0081 (size: 0x3)
    FSBHitKnockBackSetting HitKnockBack;                                              // 0x0084 (size: 0x18)
    bool bModifyHateScale;                                                            // 0x009C (size: 0x1)
    char padding_9[0x3];                                                              // 0x009D (size: 0x3)
    float HateScale;                                                                  // 0x00A0 (size: 0x4)
    bool bModifySpecialHitEffectName;                                                 // 0x00A4 (size: 0x1)
    char padding_10[0x3];                                                             // 0x00A5 (size: 0x3)
    FName SpecialHitEffectName;                                                       // 0x00A8 (size: 0x8)
    char padding_11[0x8];                                                             // 0x00B0 (size: 0x8)
    TArray<FSBStatusAilmentHandle> GiveStatusAilmentList;                             // 0x00B8 (size: 0x10)
    TArray<FSBAttackStatusData> GaveDamageSelfStatusAilmentList;                      // 0x00C8 (size: 0x10)
    TArray<FSBAttackStatusData> GaveHitSelfStatusAilmentList;                         // 0x00D8 (size: 0x10)
    TArray<FSBAttackStatusData> GaveWeakPointHitSelfStatusAilmentList;                // 0x00E8 (size: 0x10)
    TArray<FSBAttackDeactiveStatusHandleData> DeactiveStatusHandleList;               // 0x00F8 (size: 0x10)
    TArray<FSBAttackDeactiveStatusGroupData> DeactiveStatusGroupList;                 // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FSBAttackModifyMasterData
{
    int32 SettingID;                                                                  // 0x0000 (size: 0x4)
    int32 AttackID;                                                                   // 0x0004 (size: 0x4)
    TArray<FSBAttackMasterDataModifyParam> ModifyParamList;                           // 0x0008 (size: 0x10)
    TArray<int32> UseSettingIDList;                                                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBAttackOverrideMasterData : public FSBAttackMasterData
{
    FName ChracterID;                                                                 // 0x00E8 (size: 0x8)

}; // Size: 0x100

struct FSBAttackParam
{
    ESBAttackParam Type;                                                              // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float Value;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBAttackProjectile
{
    FDataTableRowHandle RowHandle;                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSBAttackSettings
{
    float HomingDashTime;                                                             // 0x0000 (size: 0x4)
    float HomingDashRange;                                                            // 0x0004 (size: 0x4)
    float AttackRange;                                                                // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBAttackStatusData
{
    FSBStatusAilmentHandle StatusAilment;                                             // 0x0000 (size: 0x20)
    float DelayTime;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FSBAttackStunSetting
{
    TArray<FSBElementDamageSetting> ElementDamageList;                                // 0x0000 (size: 0x10)
    ESBStunDirection Direction;                                                       // 0x0010 (size: 0x1)
    bool bLevelDiff;                                                                  // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FSBAttackThroughConfig
{
    ESBDamageAttackType AttackType;                                                   // 0x0000 (size: 0x1)
    ESBAttackThroughType ThroughType;                                                 // 0x0001 (size: 0x1)
    char padding_0[0x2];                                                              // 0x0002 (size: 0x2)
    int32 AttributeBitMask;                                                           // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBAttributeEffectInfo
{
    class UParticleSystem* PSTemplate;                                                // 0x0000 (size: 0x8)
    TSubclassOf<class ASBProjectileEffect> EffectActor;                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSBAttributeSlashDisk
{
    ESBAttribute ElementType;                                                         // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FSBEffectSetting SlashDiskEffect;                                                 // 0x0008 (size: 0x150)

}; // Size: 0x158

struct FSBAutoQuestComponentData
{
    int32 ClassExp;                                                                   // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBCharacterToken> TokenList;                                              // 0x0008 (size: 0x10)
    FSBExtraExpParse ClassExtraExp;                                                   // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FSBAutoStampSaveData
{
    TMap<class FString, class FAutoWordUserSetting> AutoStampData;                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FSBAutoWordData
{
    bool bEnable;                                                                     // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 Priority;                                                                   // 0x0004 (size: 0x4)
    float CooolTime;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBBDFObjectCommonTypeInfo
{
    FSBBDFObjectEffectInfo PartsEffect;                                               // 0x0000 (size: 0x10)
    FSBBDFObjectPartsBreakEffectInfo PartsBreakEffect;                                // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FSBBDFObjectEffectInfo
{
    class UParticleSystem* PSTemplate;                                                // 0x0000 (size: 0x8)
    float Scale;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FSBBDFObjectMaterialInfo
{
    int32 MaterialIndex;                                                              // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    class UMaterialInterface* Material;                                               // 0x0008 (size: 0x8)

}; // Size: 0x18

struct FSBBDFObjectParts
{
    FName CollisionGroupName;                                                         // 0x0000 (size: 0x8)
    ESBBDFObjectType DefaultType;                                                     // 0x0008 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0009 (size: 0x7)
    TMap<class ESBBDFObjectType, class FSBBDFObjectTypeInfo> TypeInfo;                // 0x0010 (size: 0x50)
    FName SocketName;                                                                 // 0x0060 (size: 0x8)
    TArray<int32> OffMaterialIndexesOnDeploy;                                         // 0x0068 (size: 0x10)
    TArray<FName> OffTargetableNamesOnDeploy;                                         // 0x0078 (size: 0x10)
    TArray<FName> OffDamageCollisionNamesOnDeploy;                                    // 0x0088 (size: 0x10)
    int32 AnchorID;                                                                   // 0x0098 (size: 0x4)
    bool bExtraParts;                                                                 // 0x009C (size: 0x1)
    char padding_1[0x3];                                                              // 0x009D (size: 0x3)
    TArray<int32> ExtraMaterialIndexes;                                               // 0x00A0 (size: 0x10)
    TArray<FName> ExtraDamageCollisionNames;                                          // 0x00B0 (size: 0x10)
    TArray<FName> ExtraTargetableNames;                                               // 0x00C0 (size: 0x10)
    ESBBDFObjectType Type;                                                            // 0x00D0 (size: 0x1)
    bool bEnabled;                                                                    // 0x00D1 (size: 0x1)
    char padding_2[0x6];                                                              // 0x00D2 (size: 0x6)
    class UParticleSystem* ParticleByType;                                            // 0x00D8 (size: 0x8)
    class USBEnemyBDFObjectComponent* BDFObjectComponent;                             // 0x00E0 (size: 0x8)
    class AActor* BDFObjectProjectile;                                                // 0x00E8 (size: 0x8)

}; // Size: 0x100

struct FSBBDFObjectPartsBreakEffectInfo
{
    class UParticleSystem* PSTemplate;                                                // 0x0000 (size: 0x8)
    TSoftObjectPtr<UAkAudioEvent> EffectSE;                                           // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FSBBDFObjectPartsHealEffectInfo
{
    class UParticleSystem* PSTemplate;                                                // 0x0000 (size: 0x8)
    FVector LocationOffset;                                                           // 0x0008 (size: 0xC)
    FRotator RotationOffset;                                                          // 0x0014 (size: 0xC)
    float Scale;                                                                      // 0x0020 (size: 0x4)
    bool bAttached;                                                                   // 0x0024 (size: 0x1)
    bool bCastShadow;                                                                 // 0x0025 (size: 0x1)
    EEffectId EffectId;                                                               // 0x0026 (size: 0x1)
    char padding_0[0x1];                                                              // 0x0027 (size: 0x1)
    TSoftObjectPtr<UAkAudioEvent> EffectSE;                                           // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FSBBDFObjectTypeInfo
{
    TArray<FSBBDFObjectMaterialInfo> MaterialInfo;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSBBGMBattleAreaContentIdData
{
    FString ContentId;                                                                // 0x0000 (size: 0x10)
    ESBBattleBGMType BattleBGMType;                                                   // 0x0010 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0011 (size: 0x7)
    class UAkAudioEvent* BattleBGMEvent;                                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSBBGMEventRow : public FTableRowBase
{
    TSoftObjectPtr<UAkAudioEvent> Event;                                              // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FSBBGMInitializeValueArena
{
    float RequestTimeOfPreBattleEnd;                                                  // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSBBGMInitializeValueData
{
    class USBBGMAkComponent* BGMAkComponent;                                          // 0x0000 (size: 0x8)
    TMap<class FString, class ESBBGMMapGameMode> BGMGameModeMap;                      // 0x0008 (size: 0x50)
    TArray<FString> ContentIdListOfForceUpdateMapID;                                  // 0x0058 (size: 0x10)
    FSBBGMInitializeValueDataInterruptQuest InterruptQuest;                           // 0x0068 (size: 0xC)
    char padding_0[0x4];                                                              // 0x0074 (size: 0x4)
    FSBBGMInitializeValueDataBattle Battle;                                           // 0x0078 (size: 0x78)
    FSBBGMInitializeValueInstanceArea InstanceArea;                                   // 0x00F0 (size: 0x30)
    FSBBGMInitializeValueArena Arena;                                                 // 0x0120 (size: 0x4)

}; // Size: 0x128

struct FSBBGMInitializeValueDataBattle
{
    int32 WeakEnemyLevelDiff;                                                         // 0x0000 (size: 0x4)
    int32 StrongEnemyLevelDiff;                                                       // 0x0004 (size: 0x4)
    float WaitTimeOfFieldBattleEnd;                                                   // 0x0008 (size: 0x4)
    float WaitTimeOfDungeonZakoBattleEnd;                                             // 0x000C (size: 0x4)
    float WaitTimeOfDungeonMiddleBossBattleEnd;                                       // 0x0010 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0014 (size: 0x4)
    TMap<class FString, class ESBBattleBGMType> LevelBattleBGMMap;                    // 0x0018 (size: 0x50)
    TArray<FString> NoRequestDefaultBattleBGMList;                                    // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FSBBGMInitializeValueDataInterruptQuest
{
    float WaitTimeOfStart;                                                            // 0x0000 (size: 0x4)
    float WaitTimeOfSuccess;                                                          // 0x0004 (size: 0x4)
    float WaitTimeOfFail;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBBGMInitializeValueInstanceArea
{
    TArray<FString> MapIDArrayOfStopTickBGM;                                          // 0x0000 (size: 0x10)
    TArray<FString> MapIDArrayOfNotRequestNoBattle;                                   // 0x0010 (size: 0x10)
    TArray<FString> MapIDArrayOfStopMusciAfterInstanceArea;                           // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSBBGMMuteInTheaterRow : public FTableRowBase
{
    FString DemoName;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSBBGMTimeAttackAreaIDRow : public FTableRowBase
{
    FString BGMMapId;                                                                 // 0x0008 (size: 0x10)
    TMap<int32, FString> AreaIDEachLapMap;                                            // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FSBBGMTriggerData
{
    bool IsActive;                                                                    // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FString AreaId;                                                                   // 0x0008 (size: 0x10)
    int32 Priority;                                                                   // 0x0018 (size: 0x4)
    bool bCheckValidGameMode;                                                         // 0x001C (size: 0x1)
    char padding_1[0x3];                                                              // 0x001D (size: 0x3)
    TArray<ESBBGMMapGameMode> ValidGameModeList;                                      // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSBBPPtExchangeMasterData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FName TermId;                                                                     // 0x0004 (size: 0x8)
    ESBRewardItemType ItemType;                                                       // 0x000C (size: 0x1)
    char padding_0[0x3];                                                              // 0x000D (size: 0x3)
    int32 ItemId;                                                                     // 0x0010 (size: 0x4)
    int32 ExchangeCount;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FSBBPPtShopItemMasterData : public FSBFlatShopItemMasterData
{
    FSBTextTableHash ItemCaution;                                                     // 0x0078 (size: 0x4)
    FSBTextTableHash CoinCaution;                                                     // 0x007C (size: 0x4)
    FString SpFlags;                                                                  // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FSBBPPtShopPurchaseLimitMasterData : public FSBFlatShopPurchaseLimitMasterData
{
    char padding_0[0x18];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x18

struct FSBBTNodePropertyWalkingMode : public FAIFwBTNodePropertyEnumBase
{
    ESBEnemyWalkingMode DefaultValue;                                                 // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FSBBTNodePropertyWarpDirectionType : public FAIFwBTNodePropertyEnumBase
{
    ESBEnemyWarpDirectionType DefaultValue;                                           // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FSBBadZoneAvoidanceAngle
{
    float CenterAngle;                                                                // 0x0000 (size: 0x4)
    float WidthAngle;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBBalloonWindowRequest
{
    FText Text;                                                                       // 0x0000 (size: 0x18)
    int32 CameraNumber;                                                               // 0x0018 (size: 0x4)
    int32 StampNumber;                                                                // 0x001C (size: 0x4)
    class ACharacter* Speaker;                                                        // 0x0020 (size: 0x8)
    FName AttachTransformName;                                                        // 0x0028 (size: 0x8)
    bool bAutoClose;                                                                  // 0x0030 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0031 (size: 0x3)
    float AutoCloseTime;                                                              // 0x0034 (size: 0x4)
    class UTextureRenderTarget2D* RenderTarget;                                       // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FSBBattleDebugParam
{
    ESBBattleDebugParamVariableType VariableType;                                     // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FSBBattleItemEffect
{
    uint8 bIsEnable;                                                                  // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    TSoftObjectPtr<UParticleSystem> Particle;                                         // 0x0008 (size: 0x28)
    uint8 bIsAttach;                                                                  // 0x0030 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0031 (size: 0x3)
    FName SocketName;                                                                 // 0x0034 (size: 0x8)
    FName ActorParameterName;                                                         // 0x003C (size: 0x8)
    char padding_2[0x4];                                                              // 0x0044 (size: 0x4)
    FAkEventVariables AkEvent;                                                        // 0x0048 (size: 0x40)

}; // Size: 0x88

struct FSBBattleNpcInfo : public FTableRowBase
{
    FName npc_id;                                                                     // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSBBattleScoreMasterData
{
    int32 SettingType;                                                                // 0x0000 (size: 0x4)
    float Coefficient;                                                                // 0x0004 (size: 0x4)
    float Min;                                                                        // 0x0008 (size: 0x4)
    float Max;                                                                        // 0x000C (size: 0x4)
    int32 RoundingType;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FSBBattleStatusEffect
{
    TArray<FSBBattleStatusParticleEffect> ParticleEffectList;                         // 0x0000 (size: 0x10)
    TArray<FSBBattleStatusEffectActor> EffectActorList;                               // 0x0010 (size: 0x10)
    TArray<FSBBattleStatusMaterialEffect> MaterialEffectList;                         // 0x0020 (size: 0x10)
    FAkEventVariables AkEvent;                                                        // 0x0030 (size: 0x40)

}; // Size: 0x70

struct FSBBattleStatusEffectActor
{
    TSoftClassPtr<AActor> EffectActor;                                                // 0x0000 (size: 0x28)
    uint8 bIsAttach;                                                                  // 0x0028 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0029 (size: 0x3)
    TEnumAsByte<EEffectTarget> AttachTargetType;                                      // 0x002C (size: 0x1)
    char padding_1[0x3];                                                              // 0x002D (size: 0x3)
    FName AttachSocketName;                                                           // 0x0030 (size: 0x8)
    uint8 bIsOutDestroy;                                                              // 0x0038 (size: 0x1)
    uint8 bApplyElementEffectScale;                                                   // 0x0038 (size: 0x1)
    uint8 bIsSpawnOnlyInvoker;                                                        // 0x0038 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0039 (size: 0x7)
    FAkEventVariables AkEvent;                                                        // 0x0040 (size: 0x40)

}; // Size: 0x80

struct FSBBattleStatusEffectConfig : public FTableRowBase
{
    uint8 bRestrictOnSpecificCharacter;                                               // 0x0008 (size: 0x1)
    uint8 bEnableInEffect;                                                            // 0x0008 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0009 (size: 0x7)
    FSBBattleStatusEffect InEffect;                                                   // 0x0010 (size: 0x70)
    uint8 bEnableOverrideEffect;                                                      // 0x0080 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0081 (size: 0x7)
    FSBBattleStatusEffect OverrideEffect;                                             // 0x0088 (size: 0x70)
    uint8 bEnableInOrOverrideEffect;                                                  // 0x00F8 (size: 0x1)
    char padding_2[0x7];                                                              // 0x00F9 (size: 0x7)
    FSBBattleStatusEffect InOrOverrideEffect;                                         // 0x0100 (size: 0x70)
    uint8 bEnableOutEffect;                                                           // 0x0170 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0171 (size: 0x7)
    FSBBattleStatusEffect OutEffect;                                                  // 0x0178 (size: 0x70)

}; // Size: 0x1E8

struct FSBBattleStatusEffectID
{
    FName ID;                                                                         // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSBBattleStatusMasterDataMediator
{
    FSBAbilityMasterID AbilityID;                                                     // 0x0000 (size: 0x4)
    int16 Parts1Value1;                                                               // 0x0004 (size: 0x2)
    int16 Parts1Value2;                                                               // 0x0006 (size: 0x2)
    int16 Parts2Value1;                                                               // 0x0008 (size: 0x2)
    int16 Parts2Value2;                                                               // 0x000A (size: 0x2)
    char padding_0[0x2C];                                                             // 0x000C (size: 0x2C)
    FSBStatusAilmentID BattleStatusID;                                                // 0x0038 (size: 0x8)
    FSBStatusAilmentHandle DataHandle;                                                // 0x0040 (size: 0x20)
    char padding_1[0x8];                                                              // 0x0060 (size: 0x8)
    class AActor* Causer;                                                             // 0x0068 (size: 0x8)

}; // Size: 0x70

struct FSBBattleStatusMaterialEffect
{
    FName MaterialParamName;                                                          // 0x0000 (size: 0x8)
    float SetValue;                                                                   // 0x0008 (size: 0x4)
    uint8 bIsSpawnOnlyInvoker;                                                        // 0x000C (size: 0x1)

}; // Size: 0x10

struct FSBBattleStatusParticleEffect
{
    TSoftObjectPtr<UParticleSystem> Particle;                                         // 0x0000 (size: 0x28)
    uint8 bIsAttach;                                                                  // 0x0028 (size: 0x1)
    uint8 bAbsoluteRotation;                                                          // 0x0028 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0029 (size: 0x3)
    TEnumAsByte<EEffectTarget> AttachTargetType;                                      // 0x002C (size: 0x1)
    char padding_1[0x3];                                                              // 0x002D (size: 0x3)
    FName AttachSocketName;                                                           // 0x0030 (size: 0x8)
    FName ActorParameterName;                                                         // 0x0038 (size: 0x8)
    uint8 bIsOutDestroy;                                                              // 0x0040 (size: 0x1)
    uint8 bIsAutoDestroy;                                                             // 0x0040 (size: 0x1)
    uint8 bIsSpawnOnlyInvoker;                                                        // 0x0040 (size: 0x1)
    uint8 bIsActorScalable;                                                           // 0x0040 (size: 0x1)
    char padding_2[0x3];                                                              // 0x0041 (size: 0x3)
    ESBEffectVisibleType VisibleType;                                                 // 0x0044 (size: 0x1)
    char padding_3[0x3];                                                              // 0x0045 (size: 0x3)
    uint8 bIsSourceActorInvoker;                                                      // 0x0048 (size: 0x1)
    char padding_4[0x7];                                                              // 0x0049 (size: 0x7)
    FAkEventVariables AkEvent;                                                        // 0x0050 (size: 0x40)

}; // Size: 0x90

struct FSBBattleStatusProjectile
{
    ESBStatusProjectileRequestCondition RequestCondition;                             // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FSBProjectileSelectHandle ProjectileSelectHandle;                                 // 0x0008 (size: 0x18)
    ESBStatusProjectileInvoker InvokerType;                                           // 0x0020 (size: 0x1)
    char padding_1[0x3];                                                              // 0x0021 (size: 0x3)
    uint8 bIsAutoDestroy;                                                             // 0x0024 (size: 0x1)
    uint8 bIsBurstFinishProjectile;                                                   // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FSBBattleStatusProjectileConfig : public FTableRowBase
{
    uint8 bEnableIn;                                                                  // 0x0008 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0009 (size: 0x7)
    TArray<FSBBattleStatusProjectile> Ins;                                            // 0x0010 (size: 0x10)
    uint8 bEnableOverride;                                                            // 0x0020 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0021 (size: 0x7)
    TArray<FSBBattleStatusProjectile> Overrides;                                      // 0x0028 (size: 0x10)
    uint8 bEnableInOrOverride;                                                        // 0x0038 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0039 (size: 0x7)
    TArray<FSBBattleStatusProjectile> InOrOverrides;                                  // 0x0040 (size: 0x10)
    uint8 bEnableOut;                                                                 // 0x0050 (size: 0x1)
    char padding_3[0x7];                                                              // 0x0051 (size: 0x7)
    TArray<FSBBattleStatusProjectile> Outs;                                           // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FSBBattleStatusProjectileID
{
    FName ID;                                                                         // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSBBattleStatusResistanceSetting
{
    ESBBattleStatusResistType BattleStatusType;                                       // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    float ResistanceValue;                                                            // 0x0004 (size: 0x4)

}; // Size: 0xC

struct FSBBerserkerBerserkModeComboGaugeModifyDamageUpSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    bool ConsumeComboGaugeAllAndModeEnd;                                              // 0x0010 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0011 (size: 0x7)
    class UCurveFloat* DamageUpScaleCurve;                                            // 0x0018 (size: 0x8)
    float ConsumeComboGaugeRate;                                                      // 0x0020 (size: 0x4)
    float DamageUpRate;                                                               // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FSBBerserkerComboGaugeCastSetting
{
    TArray<FSBConditionCheckParam> ConditinoList;                                     // 0x0000 (size: 0x10)
    int32 ChangeRate;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSBBerserkerComboGaugeHitSettings
{
    FSBAttackID AttackID;                                                             // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0008 (size: 0x10)
    float GaugeAmount;                                                                // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FSBBerserkerComboSettings
{
    float GaugeAmountMax;                                                             // 0x0000 (size: 0x4)
    float GaugeAmountByHit;                                                           // 0x0004 (size: 0x4)
    float GaugeAmountResetTime;                                                       // 0x0008 (size: 0x4)
    char padding_0[0x4];                                                              // 0x000C (size: 0x4)
    TArray<FSBConditionCheckFloatParam> ComboGaugeModifySettingList;                  // 0x0010 (size: 0x10)
    TArray<FSBBerserkerComboGaugeHitSettings> ComboGaugeHitSettingsList;              // 0x0020 (size: 0x10)
    class UCurveFloat* DamageUpScaleCurve;                                            // 0x0030 (size: 0x8)
    TArray<FSBConditionCheckFloatParam> ComboGaugeMaxBonusModifySettingList;          // 0x0038 (size: 0x10)
    class UCurveFloat* SkillComboAddGauge;                                            // 0x0048 (size: 0x8)
    TArray<FSBBerserkerSkillComboEffectSettings> SkillComboEffectSettingList;         // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FSBBerserkerConsumeComboAttackSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float UseComboGaugeAmount;                                                        // 0x0010 (size: 0x4)
    float DamageModifyRate;                                                           // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FSBBerserkerPartyChainDrainSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    int32 PartyChainNum;                                                              // 0x0010 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0014 (size: 0x4)
    FDataTableRowHandle StatusAlimentHandle;                                          // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBBerserkerSkillComboEffectSettings
{
    int32 ComboCount;                                                                 // 0x0000 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0004 (size: 0x4)
    TArray<FSBEffectAsset> ComboCountUpEffectList;                                    // 0x0008 (size: 0x10)
    TArray<FSBEffectAsset> ComboKeepEffectList;                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBBlasterBattleStatusSpreadSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    ESBBattleEffective Effective;                                                     // 0x0010 (size: 0x1)
    ESBBattleEffectiveGroup EffectiveGroup;                                           // 0x0011 (size: 0x1)
    char padding_0[0x6];                                                              // 0x0012 (size: 0x6)
    FDataTableRowHandle RowHandle;                                                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBBlasterElementSpreadAccumulationSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float AccumulationRate;                                                           // 0x0010 (size: 0x4)
    float AccumulationMax;                                                            // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FSBBlasterElementSpreadProjectileSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    FDataTableRowHandle ElementSpreadProjectileHandle;                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBBlasterGaugeAmountAddSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float AddValue;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSBBlasterGaugeAmountWeakPointHitMultiplierSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float MultiplierValue;                                                            // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSBBlasterHatTrickSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    FDataTableRowHandle ComboShotProjectileHandle;                                    // 0x0010 (size: 0x10)
    FDataTableRowHandle LaunchMultiHitProjectileHandle;                               // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSBBlasterHatTrickWeakPointHitDamageModifySetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float DamageModifyRate;                                                           // 0x0010 (size: 0x4)
    bool bNotWeakPointHit;                                                            // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FSBBlasterHitDistanceDamageModifySetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float DamageModifyRate;                                                           // 0x0010 (size: 0x4)
    char padding_0[0x4];                                                              // 0x0014 (size: 0x4)
    TArray<FSBAttackID> AttackIDList;                                                 // 0x0018 (size: 0x10)
    float MinDistance;                                                                // 0x0028 (size: 0x4)
    float MaxDistance;                                                                // 0x002C (size: 0x4)
    bool bIncreaseDamageAtClose;                                                      // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FSBBlasterHoldingArrowEffectSetting : public FSBAnimTagEffectSetting
{
    char padding_0[0x1B8];                                                            // 0x0000 (size: 0x0)
}; // Size: 0x1B8

struct FSBBlasterSkillChargeLevelSetting : public FSBPlayerSkillChargeLevelSetting
{
    FSBBlasterHoldingArrowEffectSetting HoldArrowSetting;                             // 0x0050 (size: 0x1B8)

}; // Size: 0x208

struct FSBBlasterSkillChargeSetting : public FSBPlayerSkillChargeSettingBase
{
    TArray<FSBBlasterSkillChargeLevelSetting> LevelSettingList;                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSBBlasterSpreadShotAreaModifySetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    int32 ModifyRate;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSBBlasterWeakPointHitDamageUpSetting
{
    TArray<FSBConditionCheckParam> ConditionList;                                     // 0x0000 (size: 0x10)
    float DamageUpRate;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSBBookMarkData
{
    bool bIsCustom;                                                                   // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FString BookMark1;                                                                // 0x0008 (size: 0x10)
    FString BookMark2;                                                                // 0x0018 (size: 0x10)
    FString BookMark3;                                                                // 0x0028 (size: 0x10)
    FString BookMark4;                                                                // 0x0038 (size: 0x10)
    FString BookMark5;                                                                // 0x0048 (size: 0x10)
    FString BookMark6;                                                                // 0x0058 (size: 0x10)
    FString BookMark7;                                                                // 0x0068 (size: 0x10)
    FString BookMark8;                                                                // 0x0078 (size: 0x10)
    FString BookMark9;                                                                // 0x0088 (size: 0x10)
    FString BookMark10;                                                               // 0x0098 (size: 0x10)
    FString BookMark11;                                                               // 0x00A8 (size: 0x10)
    FString BookMark12;                                                               // 0x00B8 (size: 0x10)
    FString BookMark13;                                                               // 0x00C8 (size: 0x10)
    FString BookMark14;                                                               // 0x00D8 (size: 0x10)
    FString BookMark15;                                                               // 0x00E8 (size: 0x10)
    FString BookMark16;                                                               // 0x00F8 (size: 0x10)
    FString BookMark17;                                                               // 0x0108 (size: 0x10)
    FString BookMark18;                                                               // 0x0118 (size: 0x10)
    FString BookMark19;                                                               // 0x0128 (size: 0x10)
    FString BookMark20;                                                               // 0x0138 (size: 0x10)
    FString BookMark21;                                                               // 0x0148 (size: 0x10)
    FString BookMark22;                                                               // 0x0158 (size: 0x10)
    FString BookMark23;                                                               // 0x0168 (size: 0x10)
    FString BookMark24;                                                               // 0x0178 (size: 0x10)

}; // Size: 0x188

struct FSBBookMarkSaveData
{
    FString PlayerId;                                                                 // 0x0000 (size: 0x10)
    TMap<class ESBClassType, class FSBBookMarkData> Data;                             // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FSBBossBGMTableRow : public FTableRowBase
{
    FString Memo;                                                                     // 0x0008 (size: 0x10)
    TArray<FString> EnemyIDList;                                                      // 0x0018 (size: 0x10)
    bool IsMiddleBoss;                                                                // 0x0028 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0029 (size: 0x7)
    TArray<ESBBGMMapGameMode> BGMGameModeList;                                        // 0x0030 (size: 0x10)
    bool bIsUniqueBGM;                                                                // 0x0040 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0041 (size: 0x7)
    TArray<FSBDefaultBossBGMSettingData> DefaultSettingDataArray;                     // 0x0048 (size: 0x10)
    ESBResultBGMType DefaultResultBGMType;                                            // 0x0058 (size: 0x1)
    char padding_2[0x7];                                                              // 0x0059 (size: 0x7)
    TArray<FSBUniqueBossBGMSettingData> UniqueSettingDataArray;                       // 0x0060 (size: 0x10)
    class UAkAudioEvent* UniqueResultBGMType;                                         // 0x0070 (size: 0x8)

}; // Size: 0x78

struct FSBBossWeakConditionCheck
{
    FName ConditionId;                                                                // 0x0000 (size: 0x8)
    float BossWeakRatio;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBBuddyConditionalVoiceSettings : public FTableRowBase
{
    FName ConditionId;                                                                // 0x0008 (size: 0x8)
    FString SublevelId;                                                               // 0x0010 (size: 0x10)
    ESBConditionalVoicePriority Priority;                                             // 0x0020 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0021 (size: 0x3)
    float CancelTime;                                                                 // 0x0024 (size: 0x4)
    float Interval;                                                                   // 0x0028 (size: 0x4)
    ESBConditionalVoiceRequestType RequestType;                                       // 0x002C (size: 0x1)
    char padding_1[0x3];                                                              // 0x002D (size: 0x3)
    TArray<ESBBuddyType> Speakers;                                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FSBBuddyEnemyIdData : public FTableRowBase
{
    FString EnemyId;                                                                  // 0x0008 (size: 0x10)
    ESBBuddyType BuddyType;                                                           // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FSBBuddyVoiceEventData
{
    bool IsCommon;                                                                    // 0x0000 (size: 0x1)
    char padding_0[0x7];                                                              // 0x0001 (size: 0x7)
    FString MapId;                                                                    // 0x0008 (size: 0x10)
    bool IsDungeonNormal;                                                             // 0x0018 (size: 0x1)
    char padding_1[0x7];                                                              // 0x0019 (size: 0x7)
    TSoftObjectPtr<UAkAudioEvent> Event;                                              // 0x0020 (size: 0x28)

}; // Size: 0x48

struct FSBBuddyVoiceEventTableRow : public FTableRowBase
{
    FName ConditionId;                                                                // 0x0008 (size: 0x8)
    TArray<FSBBuddyVoiceEventData> EventData;                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBBulkGetItemProductItemInfo
{
    EItemType ItemType;                                                               // 0x0000 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0001 (size: 0x3)
    int32 ItemId;                                                                     // 0x0004 (size: 0x4)
    int32 AddCount;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSBBulkGetItemProductItemSetInfo : public FTableRowBase
{
    FText Name;                                                                       // 0x0008 (size: 0x18)
    FText Description;                                                                // 0x0020 (size: 0x18)
    FText Category;                                                                   // 0x0038 (size: 0x18)
    TArray<FSBBulkGetItemProductItemInfo> ProductItems;                               // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FSBBurderingDummyData
{
    uint8 DummyData;                                                                  // 0x0000 (size: 0x3E8)

}; // Size: 0x3E8

struct FSBCacheBonePosition
{
    FName SocketName;                                                                 // 0x0000 (size: 0x8)
    char padding_0[0x8];                                                              // 0x0008 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FSBCameraDistanceTransparentParam
{
    float Distance;                                                                   // 0x0000 (size: 0x4)
    float DistanceBuffer;                                                             // 0x0004 (size: 0x4)
    bool bIsCheckSokcet;                                                              // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSBCameraShieldingTransparentParam
{
    float Distance;                                                                   // 0x0000 (size: 0x4)
    float DistanceBuffer;                                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSBCameraZoomLevelCharacterData
{
    TMap<class FString, class FSBCameraZoomLevelDatas> CharacterZoomLevels;           // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FSBCameraZoomLevelDatas
{
    TArray<FCameraZoomLevelParam> CameraZoomLevelParam;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSBCaptureStudioCharacterWeaponData
{
    TSoftObjectPtr<USkeletalMesh> WeaponMesh;                                         // 0x0000 (size: 0x28)
    FVector WeaponLocation;                                                           // 0x0028 (size: 0xC)
    FRotator Rotation;                                                                // 0x0034 (size: 0xC)
    FName SocketName;                                                                 // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FSBCaptureStudioImagineData : public FTableRowBase
{
    int32 ImagineId;                                                                  // 0x0008 (size: 0x4)
    char padding_0[0x4];                                                              // 0x000C (size: 0x4)
    TSoftObjectPtr<USkeletalMesh> Mesh;                                               // 0x0010 (size: 0x28)
    TSoftObjectPtr<USBCharaCreateData> CharaCreate;                                   // 0x0038 (size: 0x28)
    TSoftObjectPtr<UAnimationAsset> Animation;                                        // 0x0060 (size: 0x28)
    FVector Location;                                                                 // 0x0088 (size: 0xC)
    FRotator Rotation;                                                                // 0x0094 (size: 0xC)
    float Scale;                                                                      // 0x00A0 (size: 0x4)
    char padding_1[0x4];                                                              // 0x00A4 (size: 0x4)
    TArray<FSBCaptureStudioCharacterWeaponData> Weapons;                              // 0x00A8 (size: 0x10)
    TArray<TSoftObjectPtr<UMaterialInterface>> OverrideMaterials;                     // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FSBCashExchangeShopProductList
{
    FString ProductId;                                                                // 0x0000 (size: 0x10)
    int32 SellingPriceCash;                                                           // 0x0010 (size: 0x4)
    int32 SellingPricePaid;                                                           // 0x0014 (size: 0x4)
    int32 SellingPriceFree;                                                           // 0x0018 (size: 0x4)
    int32 SoldNumberLimit;                                                            // 0x001C (size: 0x4)
    FString SaleStartDate;                                                            // 0x0020 (size: 0x10)
    FString SaleEndDate;                                                              // 0x0030 (size: 0x10)
    int32 SortId;                                                                     // 0x0040 (size: 0x4)
    int32 Flags;                                                                      // 0x0044 (size: 0x4)
    FString ProductThumbnail;                                                         // 0x0048 (size: 0x10)
    FString ProductName;                                                              // 0x0058 (size: 0x10)
    FString ProductText;                                                              // 0x0068 (size: 0x10)
    FString ProductDetail;                                                            // 0x0078 (size: 0x10)
    FString OfficialComment;                                                          // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FSBCashHistory
{
    FString UpdateType;                                                               // 0x0000 (size: 0x10)
    int32 PaidAmount;                                                                 // 0x0010 (size: 0x4)
    int32 FreeAmount;                                                                 // 0x0014 (size: 0x4)
    FString ActionType;                                                               // 0x0018 (size: 0x10)
    int32 ActionTypeTextId;                                                           // 0x0028 (size: 0x4)
    char padding_0[0x4];                                                              // 0x002C (size: 0x4)
    FString ReasonText;                                                               // 0x0030 (size: 0x10)
    FDateTime HistoryDate;                                                            // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FSBChangeCostumeData
{
    int32 storage_no;                                                                 // 0x0000 (size: 0x4)
    int32 Amount;                                                                     // 0x0004 (size: 0x4)
    FString unique_id;                                                                // 0x0008 (size: 0x10)
    FCostumeData CostumeData;                                                         // 0x0018 (size: 0x20)

}; // Size: 0x38

struct FSBChangeItemAmountParam
{
    FString UniqueId;                                                                 // 0x0000 (size: 0x10)
    int32 StorageNumber;                                                              // 0x0010 (size: 0x4)
    int32 ItemIndex;                                                                  // 0x0014 (size: 0x4)
    EItemType ItemType;                                                               // 0x0018 (size: 0x1)
    char padding_0[0x3];                                                              // 0x0019 (size: 0x3)
    int32 Amount;                                                                     // 0x001C (size: 0x4)

}; // Size: 0x20

struct FSBChangeLandingSecond
{
    float Distance;                                                                   // 0x0000 (size: 0x4)
    float Second;                                                                     // 0x0004 (size: 0x4)
    float MinSecond;                                                                  // 0x0008 (size: 0x4)
    float MaxSecond;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSBChangeMaterialColorParam
{
    char padding_0[0x10];                                                             // 0x0000 (size: 0x0)
}; // Size: 0x10

struct FSBCharaCreateBoneScaleGroupData
{
    FName GroupName;                                                                  // 0x0000 (size: 0x8)
    float DefaultSliderValue;                                                         // 0x0008 (size: 0x4)
    char padding_0[0x4];                                                              // 0x000C (size: 0x4)
    TArray<FSBCharaCreateBoneScalePartsData> PartsList;                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSBCharaCreateBoneScalePartsData
{
    ECharaCreateBoneScaleType ScaleType;                                              // 0x0000 (size: 0x1)
    ECharaCreateBoneScaleID BoneID;                                                   // 0x0001 (size: 0x1)
