[
    {
        "id": 1,
        "term_id": 1,
        "type": 1,
        "revision": 1,
        "platform": 1,
        "lang": "ja_JP",
        "title": "利用規約/チャットサービスに関する注意事項/プライバシーポリシー",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、当社が定める以下の事項が適用されます。\n本サービスに係るガイドライン、各種取り決め、取引条件の表示、利用上の注意等（以下「ガイドライン」といいます）は、本規約の解釈を示し、または本規約の一部を構成するものとなります。また、ガイドラインと本規約の規定内容が矛盾抵触する場合には、ガイドラインが優先して適用されます。\n本サービスのご利用にあたっては、関連する第三者との契約または規約等、例えば決済事業者が定める各種規約についても遵守していただく必要があります。\n\n\n1. 未成年者による利用について\n\n1.1 お客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本規約を確認し、法定代理人の同意を得てから本規約に同意してください。また、本サービスに含まれる有償のコンテンツ（以下、「有償コンテンツ」といいます。）を利用する場合についても、必ず法定代理人の同意を得てから利用してください。\n\n1.2 未成年のお客様が、法定代理人の同意がないにもかかわらず同意があると偽って本サービスを利用した場合、年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合には、その未成年のお客様またはその法定代理人は、本サービスにおける一切の法律行為を取消すことができません。\n\n1.3 本規約に同意した時点で未成年であったお客様が、成年に達した後に本サービスを利用した場合、未成年であった間の利用行為を追認したものとみなされます。\n\n1.4 当社は、お客様の年齢に応じて、本サービスの全部または一部の利用を制限する場合があります。制限の対象および内容は、本サービス内で別途お知らせします。\n\n\n2. 本サービスについて\n\n2.1 本サービスのご利用にあたっては、バンダイナムコIDの会員登録が必要です。\n\n2.2 お客様は、日本国内でのみ本サービスをご利用いただけます。\n\n2.3 本サービスはインターネットに接続できる環境でご利用ください。なお、本サービスは無料でプレイできますが、通信料等はお客様のご負担となります。\n\n\n3. 本サービスの停止・プレイデータのリセットについて\n\n3.1 メンテナンス、不具合またはネットワーク障害により、予告なく一時停止または中断が発生する場合があります。\n\n3.2 当社は、前項に定める本サービスの一時停止または中断によりお客様に損害が生じた場合であっても、いかなる責任も負わないものとします。 \n\n\n4. お問い合わせ\n\n4.1 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ 窓口にて受け付けます。\n\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n5. 当社からの通知\n\n5.1 当社からお客様に対する通知  は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n\n5.2お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n\n6. アカウント\n\n6.1 お客様は、本サービスに関するお客様のアカウント（プレイデータおよびパスワードを含み、以下「アカウント」といいます。）を適切に管理するものとし、その利用および管理について一切の責任を負うものとします。また、本サービスと連携するサービスのアカウントについても同様とします。\n\n6.2 本サービスおよびアカウントは、当社がお客様に非独占的に利用を許諾しているものであり、お客様は当社が定めた利用範囲内に限りこれらを利用することができます。\n\n6.3 当社は、お客様のアカウントを利用して行われた本サービスの利用をお客様による利用とみなすことができます。また、アカウントの正当な利用者が不明な場合、当社は、当該アカウントを実際に利用している方をアカウントの正当な利用者とみなすことができます。なお、お客様のアカウントに関して生じた利用料金支払債務その他一切の債務は、お客様が負担するものとします。\n\n6.4 別途当社が定める期間  （定めがない場合には1年間）にわたりお客様による本サービスの利用実態がない場合、当社はお客様のアカウントの全部または一部を消去することができます。\n \n\n7. プレイデータ\n\n7.1 お客様は、アカウントまたはそれに含まれるゲーム内通貨、デジタルアイテム、ユーザー名、レベル、ランク、ステータス、称号その他のプレイデータ（以下「プレイデータ」といいます。）に関して所有権、知的財産権その他の権利を取得することはありません。また、プレイデータは、当社が権利を有しお客様に非独占的に許諾するデジタルデータに過ぎず、法令にて定められている場合を除き有償で提供されたものを含めいかなる金銭的価値を有しません。\n \n7.2 お客様が利用されているプレイデータの内容または数量が、本サービスのご利用状況と比較して誤っていることが判明した場合、当社は、お客様に対して事前に通知することなくこれを修正することができます。\n \n7.3 お客様のプレイデータに含まれるユーザー名、レベル、ランク、ステータス、称号等は、本サービス内において他のお客様に公開されることがあります。\n\n\n8. バンダイナムコIDの利用\n\n8.１ 本サービスは、バンダイナムコIDを用いてデータ管理等を行っており、本サービスの利用に際しては、バンダイナムコIDを取得していただく必要があります。\n\n8.2 お客様が複数のバンダイナムコIDを保有されている場合であっても、本サービスにおいて２以上のバンダイナムコIDを利用いただくことはできません。\n\n8.3 お客様のバンダイナムコIDサービスの会員資格が失効となった場合、またはお客様がバンダイナムコIDサービスの会員登録を解除した場合、本サービスは一切利用できません。また、一度バンダイナムコIDサービスの会員資格が失効となり、または会員登録を解除しますと、サービス内データ（※）は一切復元できません。\n（※）「サービス内データ」とは、バンダイナムコIDに関連付ける形で記録・蓄積された本サービスにおける一切の情報（有償無償を問わず本サービス内で入手した全てのコンテンツおよびプレイデータ、ならびに本サービス内でお客様が投稿した文字、画像等の情報を含みます）をいいます。\n\n8.4   バンダイナムコIDに関するお問い合わせは、下記連絡先よりお問い合わせください。\n＜バンダイナムコIDお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n9. 有償サービス\n\n9.1 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n\n9.2 当社は、有償で発行する本サービス専用のゲーム内通貨（以下、「本サービス専用通貨」といいます。）をお客様に提供することがあります。\n\n9.3 本サービス専用通貨の販売価格は購入ページをご覧ください。\n\n9.4 お客様が未成年者である場合には、本サービス専用通貨の購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n\n9.5 お客様が取得した本サービス専用通貨は本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n\n9.6 本サービス専用通貨の有効期限は、お客様が当該本サービス専用通貨を購入した日から、当該購入日を含む160日後の午前4:00までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n\n9.7 本サービス専用通貨および有償コンテンツの価格、仕様の変更、販売の終了は当社の任意とします。\n\n9.8 当社は、法令にて定められている場合を除き、本サービス専用通貨および有償コンテンツの現金・金券等への払い戻し・交換はいたしません。\n\n9.9 お客様は、第三者に対する本サービス専用通貨の譲渡、貸与、共有等はできません。また、当社所定の方法にて行う場合を除き、第三者に対する有償コンテンツの譲渡、貸与、共有等もできません。\n\n9.10 別途当社が「資金決済に関する法律に基づく表示」と題するページに前払式支払手段としてコンテンツを表示する場合、当該コンテンツは、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n\n9.11 有償コンテンツの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n\n\n10. サービスの変更について\n\n10.1 当社は、お客様への予告を行うことなく、本サービス、アカウントまたはプレイデータ（本サービス専用通貨および有償コンテンツを含みます。）の内容、仕様および価格等を変更することができます。なお、当該変更により、お客様が購入した有償コンテンツの性能、効果または有用性等に変更が生じることがあります。\n\n10.2 当社は、お客様への予告を行うことなく、本サービスの提供を停止、中止または終了することがあります。\n\n\n11. 権利について\n\n11.1 本サービス（本サービスに含まれる発明、考案、意匠、商標、標章、画像、映像、文章、プログラムその他の一切の情報等を含みます。）に係る知的財産権その他の一切の権利は、当社または当社がその利用の許諾を得ている第三者に帰属します。\n\n11.2 お客様は、本サービスに関して当社とお客様の間で生じたいかなる権利または義務を、貸与、交換、譲渡、売買もしくは質入してはならず、また、方法を問わず第三者に利用させてはならないものとします。また、お客様は当該権利義務またはアカウントを他のお客様その他の第三者に相続することはできません。\n\n\n12. 情報の取扱いについて\n\n12.1 本サービスを通じてお客様からいただいたコメント、フィードバック、不具合等の報告、プレイデータ等、本サービスを利用したことにより発生する情報等に関する一切の権利は当社に帰属し、今後のゲーム開発および運営に活用いたします。\n\n12.2 当社は、本サービスの分析および改善を目的として、お客様のハードウェア、ソフトウェアその他利用環境に関する情報を、お客様の個別の同意を得ることなく自動取得できるものとします。\n\n\n13. 著作物の利用について\n\n13.1 本サービスのゲームプレイを撮影した画像・動画のインターネット上の利用に関しましては、 当社が定める「BLUE PROTOCOL 著作物利用ガイドライン」をお守りください。\n\n\n14. 禁止事項について   \n\n14.1 以下に該当する行為または該当するおそれのある行為を一切行ってはなりません。当社が当該行為を確認した場合、お客様に対し事前に通知することなく本サービスの機能制限、プレイデータの修正（本サービス専用通貨および有償コンテンツ等の抹消を含みます。）またはアカウント停止等の措置を行います。なお、当該行為に該当するか否かは、当社の判断によります。\n(1)複数のバンダイナムコIDを利用する行為\n(2)お客様のバンダイナムコIDを第三者に開示または使用させる行為\n(3)他人（家族を含みます）になりすます行為、当社及び当社関連会社・本サービスの関係者になりすます行為、又は他の登録会員のパスワ－ドを不正に使用する行為\n(4)氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報（自分のもの他人のものかは問いません）を投稿する行為並びにニックネームに本名を登録する行為\n(5)当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為\n(6)当社及び当社関連会社、又は第三者を差別又は誹謗中傷し、名誉や信用を毀損する行為\n(7)本サービスのデータを改ざん又は不正に作成する行為\n(8)本サービスの利用を阻害する情報を登録する行為\n(9)本サービスの利用方法として予め想定又は許容される行為以外の行為\n(10)自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用した本サービスの利用及び勧奨する行為\n(11)有害なコンピュータ・プログラム等を公衆送信、頒布又は使用する行為\n(12)本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為\n(13)虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為\n(14)本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為\n(15)本サービスの提供を妨げる行為または誹謗する行為\n(16)本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為\n(17)本サービスに関する当社が未公表の情報を、当社以外の第三者に公開する行為\n(18)アイテムを不正に取得するなど、プログラムの不具合を利用した不正行為（不具合を利用していると当社が判断した行為を含みます）\n(19)リアルマネートレード（RMT）及びこれに類する行為\n(20)犯罪行為又はこれに結びつく行為\n(21)公序良俗又は法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に反する目的で本サービスを利用する行為\n(22)広告宣伝、営業活動その他営利目的で本サービスを利用する行為\n(23)異性との交際を目的として本サービスを利用する行為\n(24)宗教活動及び類似する行為、宗教団体への勧誘行為\n(25)政治活動及び類似する行為、政治団体への勧誘行為\n(26)選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為\n(27)他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為\n(28)わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為\n(29)連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為\n(30)無限連鎖講(ネズミ講) 又はネットワークビジネス等の開設及びこれを勧誘する行為\n(31)脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為\n(32)反社会的勢力等への利益供与行為\n(33)買春・売春を助長する投稿をする行為\n(34)覚せい剤、麻薬等薬物の使用を助長する投稿をする行為\n(35)アダルト・性風俗産業関連の投稿をする行為\n(36)自殺、自傷行為を助長する投稿をする行為\n(37)著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をする行為\n(38)未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をする行為\n(39)本サービスと無関係な情報を著しい長文として投稿する行為\n(40)異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿する行為\n(41)本サービスの不具合又は不正行為に関する情報を投稿する行為\n(42)アカウントを複数作成する行為\n(43) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避する行為\n(44) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）\n(45) 他のお客様を他のサービスに勧誘または誘導する行為\n(46) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求する行為\n(47)日本国外から本サービスを利用する行為\n(48)当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しない行為。または当社からの協力要請に従わない行為\n(49)本規約に違反すると認められる行為\n(50)前各号に該当するおそれがあると当社が判断する行為および当社が不適切と判断した行為\n \n14.2　お客様が前項に違反して、本サービスの内容を改変し又は他のソフトウェアと結合した場合、その結果についての権利（著作権法第27条及び第28条所定の権利を含みます）は当社に帰属し、お客様は当該権利について、他者に対し、貸与、使用許諾等をしてはならないものとします。\n\n14.3 禁止行為が繰り返された場合、または悪質な禁止行為が一度でもなされた場合には、無期限のアカウント利用停止措置を含めた厳格な対応を行います。これらの対応が行われた場合であっても、当社はこれらの対応を行うに至った理由や経緯等も含め、お客様の個別の質問には回答しない場合があります。  \n \n14.4 お客様が無期限のアカウント利用停止措置を受けた場合、以後、お客様は本サービスを利用することは一切できません。その場合、本サービスの終了時を含め、本サービス専用通貨や他のデジタルアイテム等の現金への払戻しまたは金券等への交換はいたしません。\n \n\n15. 解除について\n\n15.1 お客様が本規約またはガイドラインに違反した場合または当社が別途提供する他のサービスにおいてその利用規約等に違反した場合には、当社は、何ら催告なしに本サービスにかかる契約を解除し、またはお客様に対する本サービスの提供を停止、中止もしくは終了することができます。なお、違反に該当するか否かは当社の判断によります。\n \n15.2 前項に基づき当社が契約を解除した場合においても、お客様は解除日を含むその日までに支払義務の生じた一切の債務について引き続き責任を負います。\n\n\n16. 免責について\n\n16.1 アカウントの利用停止措置、プレイデータの修正その他の本規約またはガイドラインに基づいて実施する当社の対応によって、お客様に何らかの影響が生じた場合においても、当社は当該影響につき責任（利用料金の返還または払戻しを行う責任を含みます。以下同じ。）を負いません。\n\n16.2 当社は、天災地変、社会的動乱、ストライキ、火災、停電、通信インフラの停止その他の当社の支配できない事由に起因してお客様に生じる影響について責任を負いません。\n\n16.3 当社は、本サービスおよび本サービス内で当社が提供する情報について、明示・黙示を問わずその完全性、正確性、商品性、特定目的のための適合性、非侵害性その他のいかなる保証（本サービスがいかなる環境下でも利用可能であること、お客様のプレイデータが反映されること、または本サービスに不具合もしくはエラーがないことに関する保証を含みます。）を行わず、また、責任を負いません。\n\n16.4 お客様のご利用端末の破損、データ消去、紛失、盗難、端末変更もしくは不具合、ご利用端末からのアンインストール、またはパスワードの公開、紛失もしくは忘却等（パスワードの不設定および設定の不備を含みます。）によって、お客様のアカウントの全部または一部が消失し、またはお客様がアカウントへアクセスできなくなった場合においても、当社は責任を負いません。\n\n16.5 当社は、お客様と第三者（他のお客様、決済事業者、本サービス内で表示される広告の広告事業者を含みます。）との間で生じた紛争には関知せず、一切の責任を負いません。また、当社は、第三者の投稿情報、サービス（本サービス内で表示される広告およびその広告の対象となるサービスを含みます。）または行為等について一切の責任を負いません。\n\n16.6 お客様は、本サービスを利用するにあたり、健全な生活環境を乱すような過度の利用を避け、また、お客様の周囲の状況に注意して安全に利用するよう心がけるものとします。当社は、社会通念上適切な範囲を逸脱する本サービスの利用、または本サービスの利用中における事故等によりお客様に生じた社会的、精神的、肉体的な損害について、責任を負いません。\n\n16.7 当社は、お客様に対して適宜情報提供やアドバイスを行うことがありますが、お客様は当該情報やアドバイスをお客様の責任において取扱うものとし、当社はその結果について責任を負いません。\n\n\n17. 損害賠償   \n\n17.1 本規約の他の定めにかかわらず、当社の責めに帰すべき事由（3.1項に定める本サービスの一時停止または中断による場合は含まれません）により有償コンテンツまたはお客様が有償で提供を受けた本サービス専用通貨に関してお客様が損害を被った場合、当社は、通常直接発生すると考えられる損害の範囲に限定し、当該損害が発生した日の属する月における、お客様の本サービス専用通貨購入額または有償コンテンツ相当額を上限として、当該損害を賠償する責任を負います。ただし、当社の故意または重大な過失に起因してお客様が損害を被った場合はこの限りではありません。\n \n17.2 お客様は、本規約またはガイドラインへの違反その他自己の責めに帰すべき事由により当社に損害を与えた場合、当社に対して当該損害を賠償する責任を負います。\n\n\n18.   プライバシーポリシー   \n\n18.1 当社は、本サービスを通じて当社が取得したお客様の個人情報を、別途定める「プライバシーポリシー」に基づき厳重に管理します。\n\n\n19. 本規約の変更について\n\n19.1 当社は、本規約の内容を随時変更できます。当社が本規約に何らかの変更を加える場合には、当該変更について事前に本サービスの公式サイトを通じて通知するものとし、変更後の規約は、本サービスの公式サイト内に掲示することによって効果が生じるものとします。   お客様は、当社からの告知がなくても、本規約の内容を定期的に確認してください。\n\n19.2 お客様が本規約の内容に同意できない場合には、本サービスのご利用を直ちに中止してください。本規約の内容の変更後、お客様が本サービスのご利用を継続した場合、当社は当該変更をお客様が承諾したものとみなします。\n\n\n20. 権利不放棄\n\n20.1 本規約、ガイドラインおよび法令等に基づく権利を当社が行使しない場合であっても、そのことは当該権利の放棄とはならず、当社はかかる権利を依然として行使できます。\n\n\n21. 分離可能性\n\n21.1 本規約およびガイドラインの一部が法令等に基づき無効と判断された場合であっても、他の規定の有効性には影響しないものとします。\n\n\n22. 準拠法および合意管轄\n\n22.1 本サービス、本規約およびガイドラインは日本法を準拠法とし、これに従い解釈されるものとします。\n\n22.2  本サービス、本規約およびガイドラインに関連してお客様と当社との間で生じた紛争は、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n\n以上\n制定　2023年1月10日 \n\n\n\n『BLUE PROTOCOL』(以下「本サービス」といいます)にはユーザー同士の情報交換に利用できるチャット機能がございます。\n利用規約および以下のチャットサービスに関する注意事項の内容を確認し、同意したうえでチャットサービスをご利用ください。\nお客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本注意事項を確認し、法定代理人の同意を得てから本注意事項に同意してください。  \n\n■チャットサービスに関する注意事項\n● 利用規約および本注意事項に従ってチャットサービスをご利用ください。\n\n● 株式会社バンダイナムコオンライン(以下「当社」といいます)はお客様と他のお客様または第三者との間で生じた紛争には関知いたしません。また、お客様の投稿情報に関する責任はお客様が負うものとし、当社は責任を負いません。\n\n● 以下に掲げる行為または該当するおそれのある行為は禁止しています。\n(1) 犯罪的行為または公序良俗に反する行為\n(2) 当社または第三者の財産、名誉、プライバシー等の権利を侵害する行為（本名、メールアドレス、電話番号などの個人情報や個人の特定につながる情報を投稿する行為を含む）  \n(3) 不適切な表現行為または虚偽の情報を提供する行為\n(4) 本サービスまたはチャットサービスを不正な目的で利用する行為\n(5) 本サービスまたはチャットサービスの提供を妨げる行為または誹謗する行為\n(6) 本サービスまたはチャットサービスの内容を転載、複製、修正、蓄積または転送する行為\n(7) 本サービスまたはチャットサービスを利用した営利行為\n(8) 他のお客様による本サービスもしくはチャットサービスの利用を妨害し、または当該利用に支障をきたす行為\n(9) 第三者に迷惑を及ぼす行為または不快感を与える行為\n(10) 利用規約に違反する行為または法令に違反する行為\n(11) その他当社が不適切と判断する行為\n\n● お客様の投稿情報は、不特定多数の方が閲覧することがあります。また、チャットサービスの適正な運営のために、当社および運営会社がお客様の投稿情報を閲覧することがあります。\n\n● お客様が利用規約および本注意事項に違反する投稿等をした場合、又は、当社が必要と判断した場合、当社は、当社の判断により、お客様に対して事前に通知することなく、投稿情報の削除、チャットサービスの利用停止、本サービスの利用停止、本サービスの利用契約の解除その他の必要な措置、または必要に応じて政府機関その他の第三者に対する開示 を行うことができます。\n\n● 当社は、お客様の投稿情報について監視、変更・削除等の措置を行う義務を負いません。また、当社がお客様の投稿情報について変更・削除等の措置を行った場合であっても、当社は、当該措置を行うに至った理由および経緯の説明はいたしません。\n\n以上\n\n制定　2023年1月10日 \n\n\n\n『BLUE PROTOCOL』プライバシーポリシー\n\n本プライバシーポリシーは、株式会社バンダイナムコオンライン（以下「当社」といいます）のウェブサイト、ゲーム、モバイルアプリケーションその他のオンライン製品およびサービス（総称して以下「対象サービス」といいます）をお客様が利用した場合または他の何らかの形にてお客様と当社との間でやり取りがあった場合におけるお客様に関する情報の当社による収集、保管、利用および開示の方法について、説明するものです。当社は、EU一般データ保護規則の目的上、お客様の個人情報のデータ管理者となります。\n当社は、本プライバシーポリシーを随時変更することがあります。当社は、何らかの変更を加えた場合には、本プライバシーポリシーの冒頭の日付を更新することでその旨をお客様に告知するとともに、場合により追加的な告知（対象サービスのホームページへの告知文の追加またはお客様への通知の送付などによるもの）をお客様に対し行うことがあります。当社における情報の取扱方法、およびご自身のプライバシー保護に資する方法に関し、最新情報を得られるよう、対象サービスへのアクセスのたびにプライバシーポリシーを確認しておくことをお勧めします。\n\nI. 情報の収集\n当社がお客様から収集する情報は、対象サービスごとに異なります。 当社は、識別子、インターネットまたはその他類似のネットワーク活動、対象サービスの利用履歴、位置情報などを収集します。詳細は以下に記載されています。また、収集目的は、「II. 情報の利用」のセクションに記載されています。\n\n1. お客様から当社に提供される情報\n当社は、お客様から当社に直接提供される情報を収集します。たとえば、アカウントの作成、他のユーザーとのやり取り、当社サーバーへの画像のアップロード、カスタマーサポートの依頼、ニュースレターの受信登録、アンケートへの参加その他の方法での当社とのやり取りがお客様によりなされた場合に、当社による情報収集が行われます。当社が収集することのある情報の種類には、お客様のユーザー名、パスワード、電子メールアドレス、写真その他お客様が提供を選択した一切の情報が含まれます。\n\n2. 対象サービスのお客様による利用時に当社が自動的に収集する情報\nお客様による対象サービスへのアクセスまたはその利用に際し、当社は、お客様に関する情報を自動的に収集します。その例としては、以下のものが挙げられます。\na)  利用状況に関する情報：当社は、お客様による対象サービスの利用に関する情報を収集します。これには、当社またはゲームコンソールを提供する事業者がゲーム開始時にお客様へ自動的に付与するゲーミングサービスID、コンプリート済みのレベル、ゲームスコア、対象サービスの利用に費やした時間その他のゲームプレイ情報も含まれます。\nb)  ログ情報：当社は、お客様による対象サービスの利用に関する情報をログに記録します。これには、お客様のブラウザの種別および言語、アクセス回数、閲覧ページ、お客様のIPアドレス、ならびに対象サービスへの移動前にお客様が訪問したウェブサイトも含まれます。\nc)  ハードウェア情報：当社は、お客様が対象サービスへのアクセスに用いたコンピュータ、スマートフォンその他のデバイス（以下「デバイス」といいます）に関する情報を収集します。これには、ハードウェアの型番、オペレーティングシステムおよびバージョン、ブラウザ、モバイルネットワーク情報、デバイスにインストールされている他の対象サービス（モバイルアプリケーション）、MACアドレス、IPアドレス、国際移動体装置識別番号（IMEI）その他の一意デバイス識別子であってお客様のデバイスのオペレーティングシステムにより提供されるものも含まれます。\nd)  位置情報：当社は、お客様のデバイスの地理的位置に関する情報を、対象サービスのお客様による利用の都度、またはかかる情報の収集について他の何らかの方法によるお客様の同意があった都度、収集することがあります。お客様は、ご自身のデバイス上の設定を用いて、こうした位置情報の収集の同意を撤回（拒否）することができます。お客様の位置情報は、収集前に対象サービスにおいて指定された期間にわたり、保存されます。\ne)  クッキー（Cookie）その他のトラッキング技術により収集される情報：当社は、様々な技術を用いて情報（個人情報も含む）を収集しています。その例としては、お客様のデバイスへのクッキーの送信も含まれます。クッキーは、お客様のデバイスのハードドライブ上またはメモリー内に保存される小さなデータファイルであり、対象サービスおよびお客様の体験の向上、対象サービスにおいて人気のある領域および機能の特定、ならびに訪問数の算定に際し、当社の助けとなるものです。クッキーに関する詳細については、当社のクッキーポリシー（https://blue-protocol.com/privacy/cookies 及びhttps://blue-protocol.com/privacy/cookies_support） をご覧ください。\nf)  お客様の傾向分析情報：当社は、お客様の嗜好、特性、行動および本サービスの使用実績などの情報に基づいて傾向分析をし、お客様の同意を得て、その分析結果を他の情報と組み合わせて利用します。\n\n3. 当社が第三者から収集する情報\n当社は、対象サービスの実施に必要である限りにおいて、第三者からも情報を取得することがあり、また、当該情報同士を組み合わせたり、当該情報と対象サービスを通じて収集した情報とを組み合わせたりすることもあります。たとえば、当社は、ゲームコンソールまたはiOSもしくはAndroidその他のプラットフォームを提供する事業者（以下「プラットフォーマー」といいます）から、お客様のゲームランキングおよび達成状況を収集することがあります。お客様が第三者のプラットフォーム（FacebookやTwitterなど）を通じてアカウントを作成またはログインした場合、当社は、当該プラットフォームがお客様から得た同意に従って、お客様の名前、誕生日、プロフィール写真などの特定の情報にアクセスすることができます。また、お客様がソーシャルメディア上で対象サービスに関する感想や他の情報を公開した場合、当社は、当該公開情報（ただし、当該ソーシャルメディア上でお客様が使用しているユーザー名は含みません。）を収集することがあります。さらに、お客様がアプリ購入を完了した場合、当社は、お客様のデバイスのオペレーティングシステムを提供する事業者（以下「OSプロバイダー」といいます）が当社に代わって当該購入を処理する際に、当該OSプロバイダーからお客様に関する情報を収集することがあります。ただし、当社は、OSプロバイダーからお客様の支払方法に関する情報を受領することはありません。\n\nII. 情報の利用\n当社は、お客様の同意がある場合、または次のいずれかにとって必要な範囲である場合に限り、お客様の情報の収集、保管および利用を行います。(i) お客様と当社との間の契約を履行するため、(ii) 当社の法的義務を遵守するため、または (iii) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため。当社は、当社の正当な事業上の利益とお客様の保護法益との衡量を慎重に行っています。この利益衡量に関してご不明な点がありましたら、後述の問い合わせ先宛てにご連絡ください。\n特に、当社（または当社の委託先）は、お客様に関する情報を、以下の目的のため、当該目的の達成に必要とされる期間にわたり、収集、保管および利用することがあります。\n\na)  お客様と当社との間の契約を履行するため\n-対象サービスの提供のため。\n-対象サービスに関するお客様からのコメント、問い合わせおよび依頼に対応し、関連情報を提供するため。\n-対象サービスにおいてお客様のアカウント登録を行うとともに、お客様のアカウント管理を支援するため。\n-その他対象サービスに限らずお客様からのコメント、問い合わせおよび依頼に対応し、カスタマーサービスを提供するため。\n-技術上の告知、アップデート、セキュリティアラートおよびサポートのほか、事務手続上のメッセージをお客様に送信するため。\n-当社の主催するコンテストへの参加の処理およびその懸賞金の提供のため。\nb) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため\n-当社の法律上および規制上の義務を遵守するために当社に必要であるまたは許可されている他の一切の目的のため。\n-対象サービスに関連する傾向、利用状況およびアクティビティのモニタリングと分析のため。\n-対象サービスに関連する詐欺的、不正または違法な活動を検出し、調査しかつ/または防止するため。\n-法定代理人の許可を取得するため。\n-サービス内においてコンテキスト広告（ターゲティング広告を除く）を提供するため。\nc) 同意がある場合\n-対象サービスに関連する傾向、利用状況およびアクティビティをモニタリング・分析し、お客様のニーズを把握して優れたサービスをお客様に提供するため。たとえば、当社は、お客様がソーシャルメディア上で公開した対象サービスに関する感想や他の情報を、第三者が提供する分析ツールを用いて単独で、またはゲームプレイ情報などの他の情報と組み合わせて分析し、お客様のニーズを把握して新たなサービスの提供に役立てることがあります。\n-当社または当社のグループ会社もしくは取引先により提供される製品、サービス、提案、プロモーション、報奨およびイベント・キャンペーンなどに関してお客様に告知や通知（イベント・キャンペーンなどの当選通知を含みます）を行うため。また、お客様の興味関心に合うと当社が判断する広告、ニュース、情報その他のマーケティング資料を提供するため。\n-当社が第三者から取得した情報を連携または組み合わせたりすることによって各対象サービスごとの収益傾向の分析、お客様の属性別統計データの作成、新しいゲームやサービスの創出、その他の分析を行うため。\n-対象サービス内のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の関心の高い広告の提供\n  ・広告および当社のサービスに関連するお客様の傾向、利用状況などのモニタリングおよび分析\n  ・他のお客様から収集した情報とリンクまたは組み合わせることでお客様のニーズを理解したうえで、よりパーソナライズされた広告の提供\n  ・第三者のサービスプロバイダーから提供される情報とお客様から収集する情報を組み合わせることによる、本サービスを利用するユーザーのカテゴリー別傾向分析\n-対象サービス外のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の情報を当社が提携する広告会社の情報と組み合わせ、お客様の属性別統計データを作成すること\n  ・当社（グループ会社含む）のゲーム  ・サービスの広告をご案内するため、お客様の情報を当社のグループ会社、広告代理店および配信広告プラットフォームへ広告出稿および分析を目的として提供すること\n  ・その他の広告分析やパフォーマンスの測定を実施すること\n\nIII. 情報の共有\n当社は、第三者（国内外のグループ会社を含む当社の委託先を除きます）との間においてお客様の個人情報の共有、転送および交換を行いません。ただし、法律により許容されている場合、またはお客様から当社への同意がある場合は、この限りではありません。その場合でも、当社は、お客様の個人情報を第三者に販売することはありません。以上を遵守したうえで、当社は、以下のとおり、または本プライバシーポリシーの他の規定に基づいて、お客様に関する個人情報に当たらない情報（当社内でお客様を識別できない情報）を共有することがあります。\na) 他のユーザーとの間での対象サービスにおけるインタラクティブ形式の領域（マルチプレイヤー、チャットまたは共有機能など）への参加をお客様が選択することで、お客様に関する情報を、他のユーザーとの間で共有する場合。尚、個人を識別できるデータ（お客様の氏名など）を対象サービスにおけるユーザー名として使用することは、禁止します。\nb) 当社の従業員、グループ会社、ベンダー、コンサルタント、その他の外部サービスプロバイダーであって当社のための業務遂行に際し当該情報へのアクセスを必要とするもの（たとえば、開発者、支払処理業者、ウェブサイトホスティングサービス業者、または情報ストレージおよび処理サービス業者も含みます）との間で、必要な限度でお客様に関する情報を共有する場合。\nc) 法的手続または情報提供要請への応答に際し、その開示が、適用のある法律、規則もしくは規制（たと えば、政府当局、規制機関または司法裁判所も含みます）に従ったものであるかまたは他の何らかの態様でかかる法律、規則もしくは規制により義務付けられている場合。\nd) お客様の保護法益と当社の正当な利益を比較衡量したうえで、お客様の行為が当社のユーザー契約もしくはポリシーに反していると認めるに足る、または当社、当社ユーザーもしくは他者の権利、財産および安全を保護するに足る合理的根拠がある場合。\ne) 当社事業の全部もしくは一部の合併、会社資産の売却、資金調達、または他の会社による買収に関連してお客様に関する情報を共有する法的根拠がある場合。\nf) お客様の同意または指示に基づく場合。\n\nIV. 第三者により提供される広告・分析サービス\n当社は、第三者による分析サービスの提供および対象サービス内での広告の配信を許可することがあります。これらの者は、お客様のデバイスおよびお客様による対象サービスの利用に関する情報を自動的に収集するテクノロジーを用いることがあります。かかる情報には、IPアドレス、デバイス識別子、対象サービス内のページでの滞在時間、および対象サービス内でクリックされたリンクも含まれます。かかる情報は、対象サービスの機能の維持、改善および分析など、ならびにお客様の興味関心に合う可能性のあるコンテキスト広告およびターゲティング広告の配信などのために、当社および当該第三者により利用されることがあります。かかる第三者によるお客様の情報の利用には、当該第三者各自のプライバシーポリシーが適用されることとなり、当社は、第三者のプライバシーポリシーについて管理権を有しないとともに責任を負いません。\n対象サービスによっては、ゲームおよび収益化の傾向分析、プレイヤーのカテゴリー別の傾向分析、新たなゲームおよびサービスの作成、その他解析の実施のために、お客様の事前同意を得たうえで、対象サービスの利用状況に関する情報と、当社の他のゲームから収集された情報、当社グループ会社のゲームから収集された情報その他第三者から収集された情報とを組み合わせることがあります。また、当社は、 お客様の同意または指示に基づく場合、当社のゲームを通じてそのゲーム外で配信する広告のために一定の情報を利用することがあります。これには、お客様に関する情報と当社の広告パートナーから取得した情報との組み合わせによりプレイヤーのカテゴリー別の傾向分析を行うこと、当社（および当社のグループ会社）のゲームおよびサービスについての当該ゲーム外での広告配信のために、お客様に関する情報を当社の広告代理店および広告配信プラットフォームに提供すること、ならびに他の何らかの方法で広告解析およびパフォーマンスメトリックの解析を実施することも含まれます。\nインターネットを利用した広告の詳細、またはお客様のウェブ閲覧情報が行動ターゲティング広告の目的で使用されることのオプトアウトは、以下いずれかのURLからご利用できます：http://optout.networkadvertising.org\nhttp://www.aboutads.info/choices\nヨーロッパのユーザーは、以下URLにアクセスすることによりターゲット広告の受信をオプトアウトすることができます：\nhttp://www.youronlinechoices.eu/\n当社のサービスにアクセスするために使用する各デバイスおよびブラウザで選択を更新する必要があります。\n\nV. ソーシャル共有機能\n対象サービスにより、お客様におけるソーシャルメディアとの間での活動の共有または対象サービスのリンクを可能とするソーシャル共有機能その他のツールが提供されることがあります。かかる機能を利用することで、ソーシャルメディアプラットフォームにおけるお客様の設定内容に応じて、お客様の友だちまたは公衆との情報共有が可能となります。ソーシャル共有機能に関連するデータの収集および処理の目的ならびに範囲に関する詳細については、当該ソーシャルメディアプラットフォームのプライバシーポリシーをご確認ください。\n\nVI. セキュリティ\n当社は、お客様に関する情報の消失、盗難、不正なアクセス、開示、改変ならびに破損からの保護に資する技術上および組織上の合理的措置を講じています。ただし、インターネット上の伝送のいずれも、セキュアである旨を保証できるものではなく、当社は、お客様からインターネット上で当社に伝送されるいかなる個人情報についてもセキュリティを保証することはできません。\n\nVII. データの保管および削除\n対象サービスを通じて収集された個人情報その他のデータは、いずれも、上記II.の目的にとって必要がなくなった場合には、識別不能化または削除されます。ただし、さらなる保持が法律により義務付けられている場合は、この限りではありません。 \n\nVIII. 国外への転送\n当社がお客様から収集する個人情報の転送、保存および処理は、通常の場合、日本国内で行われますが、場合により、当社は、日本またはGDPRと同等のレベルの個人情報保護制度を有する外国や、その他お客様の国の法律と同一レベルでのデータ保護を提供できない外国の第三者に、お客様の個人情報を開示することがあります。また、当社は、お客様の個人情報を、当社（および当社のグループ会社）または外部事業者が日本国外に設置したサーバで保存する場合があります。ただし、当社は、国外を所在地とする第三者にお客様の個人情報を開示したり、国外でお客様の個人情報を保存したりする場合には、お客様の個人情報が保存され、または取り扱われる国または地域における個人情報の保護に関する制度を把握した上で、当該情報の利用が各地域の法律に従ったものとなる状況を確保するための合理的措置を講じます。\n当社は、以下の国・地域のいずれかに所在する第三者にお客様の情報を開示することがあります。\na) United States of America\nb) United Arab Emirates\nc) Republic of India\nd) Republik Indonesia\ne) Ukraine\nf) Commonwealth of Australia\ng) Canada\nh) Kingdom of Cambodia\ni) Republic of Singapore\nj) Swiss Confederation\nk) Kingdom of Thailand\nl) Republic of Korea\nm) Taiwan\nn) Republic of Turkey\no) New Zealand\np) Republic of the Philippines\nq) Federative Republic of Brazil\nr) Hong Kong\ns) Malaysia\nt) United Mexican States\nu) Lao People's Democratic Republic\nv) Argentine Republic\nw) Principality of Andorra\nx) State of Israel\ny) Oriental Republic of Uruguay\nz) United Kingdom of Great Britain and Northern Ireland\naa) Bailiwick of Jersey\nbb) Bailiwick of Guernsey\ncc) Isle of Man\ndd) Faroe Islands\nee) State of Qatar\nff) Republic of Costa Rica\ngg) Republic of Tunisia\nhh) Republic of Panama\nii) Republic of Peru\njj) Republic of South Africa\nkk) Kingdom of Morocco\nll) Mongolia\n\n前項の各国・地域における個人情報の保護に関する制度の概要は、以下をご参照ください。\na) 個人情報保護委員会 　https://www.ppc.go.jp/index.html\nb) 外国における個人情報の保護に関する制度等の調査 　https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/\nc) GDPR（一般データ保護規則）越境データ移転　https://www.ppc.go.jp/enforcement/infoprovision/laws/GDPR/\n\nIX. 第三者のサイト\n対象サービスには、第三者により運営されている他のウェブサイトまたはサービスへのリンクが含まれていることがあります。本プライバシーポリシーは対象サービスのみに適用されるものであり、第三者がそのウェブサイトを通じて収集、保管および利用することのある個人情報について当社が責任を負うことはできませんので、その旨ご留意ください。お客様において、訪問先の各ウェブサイトのプライバシーポリシーに必ず目を通す必要があります。\n\nX. プッシュ通知/アラート\n当社は、プッシュ通知またはアラートをお客様のデバイスに送信することがあります。お客様は、ご自身のデバイスの通知設定を変更することにより、かかるメッセージ送信をいつでも非アクティブ化することができます。プロモーション用コンテンツ付きのプッシュ通知またはアラートが当社から送信されるのは、当該メッセージの受領についてお客様のデバイスにおけるお客様による事前オプトインがあった後に限られます。\n\nXI. データ保護の権利\n当社は、お客様（お客様が未成年の場合においてはお客様の法定代理人も同様です）から請求があったときには、法令に従い、適切に対応いたします。適用法上のお客様の権利に含まれ得るものの例としては、以下が挙げられます。\na) お客様において、お客様の個人情報または当社によるその第三者への提供の記録の開示を当社に求める場合。\nb) 当社が保有するお客様の個人情報が事実でないために、お客様において当社にその訂正、追加または削除を求める場合。\nc) 当社が違法にお客様の個人情報を取得し、利用し、または第三者に提供しているとして、お客様において当社にその利用もしくは第三者への提供の停止または消去を求める場合。\nd) 当社においてお客様の個人情報を利用する必要がなくなった、または当社が保有するお客様の個人情報について漏えい・滅失・毀損などが生じた、その他当社によるお客様の個人情報の取扱いによってお客様の権利または正当な利益が害されるおそれがあるなどの理由により、お客様において当社に個人情報の利用もしくは第三者への提供の停止または消去を求める場合。\ne) また、お客様は、当社の正当な利益に基づくお客様の個人情報の処理について、いつでも異議申立ての権利を有します。\nf) 当社がお客様の個人情報をダイレクトマーケティングの目的で処理する場合、お客様は、いつでも当該処理について異議申立ての権利を有します。これには、ダイレクトマーケティングに関係する限りにおいてはお客様のカテゴリーの傾向分析目的も含みます。お客様がダイレクトマーケティング目的での処理に異議を申し立てた場合、その後、当社は、当該目的でのお客様の個人情報の処理を行いません。この場合においても、当社は、両者間で継続中の取引関係に関する限りにおいて、取引上または関係上のメッセージを引き続きお客様に送信することがあります。\ng) お客様はこれらの権利を行使することにより、当社から他のユーザーと区別および差別されることはありません。\nこれらの請求を行うには、下記XII.の当社問い合わせ窓口より、申請いただく必要があります。なお、法定代理人その他の代理人による請求の場合、別途当社の指定する代理権を証する資料を郵送または送信いただく必要があります。\nお客様に対する個人情報の利用目的の通知および個人情報またはその第三者への提供の記録の開示の請求につきましては、別途当社窓口よりご案内する金額の手数料をいただきます。\nお客様は、お客様からの依頼に対する当社の対応方法がお客様にとって満足のいくものではなかった場合には、お客様の居住国に不服を申し立てることのできる監督当局が存在する場合、当該監督当局に不服を申し立てることができます。当社は、かかる権利がお客様により行使された場合においても、異なるレベルのサービスを提供するわけではありません。ただし、お客様は、対象サービスの適切な機能の確保にとって必要となる情報の収集の削除または収集停止を依頼した場合には、対象サービスの全部または一部の利用ができなくなることがあります。\nお客様がバンダイナムコIDを有している場合においてご自身のアカウントの閲覧または削除を希望するときは、ご自身のバンダイナムコIDにサインインしたうえで、https://www.bandainamcoid.com/portal/resignの説明内容に沿って手続をお願いいたします。お客様がご自身のアカウントを削除した後においては、お客様のアカウントに関係する一切の個人情報が削除され、お客様はバンダイナムコIDサービスにアクセスできなくなります。\n\nXII. 問い合わせ先\n本プライバシーポリシーまたは当社の方針に関してご不明な点などがございましたら、以下の当社窓口までお問い合わせください。\n株式会社バンダイナムコオンライン\n担当部署：個人情報対外窓口\n〒108-0014 東京都港区芝5-37-8\nprivacy@bandainamco-ol.co.jp\n\n以上\n制定　2023年1月10日",
        "sort_id": 1
    },
    {
        "id": 2,
        "term_id": 1,
        "type": 1,
        "revision": 2,
        "platform": 1,
        "lang": "ja_JP",
        "title": "『BLUE PROTOCOL』利用規約/チャットサービスに関する注意事項",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』利用規約\n株式会社バンダイナムコオンラインが日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』及び家庭用ゲーム機向けオンラインゲームサービス 『BLUE PROTOCOL』の利用にあたっては、当社が定める以下の事項が適用されます。該当する利用規約をよくお読みください。\n\n\nPC向け『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、当社が定める以下の事項が適用されます。\n本サービスに係るガイドライン、各種取り決め、取引条件の表示、利用上の注意等（以下「ガイドライン」といいます）は、本規約の解釈を示し、または本規約の一部を構成するものとなります。また、ガイドラインと本規約の規定内容が矛盾抵触する場合には、ガイドラインが優先して適用されます。\n本サービスのご利用にあたっては、関連する第三者との契約または規約等、例えば決済事業者が定める各種規約についても遵守していただく必要があります。\n\n\n1. 未成年者による利用について\n\n1.1 お客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本規約を確認し、法定代理人の同意を得てから本規約に同意してください。また、本サービスに含まれる有償のコンテンツ（以下、「有償コンテンツ」といいます。）を利用する場合についても、必ず法定代理人の同意を得てから利用してください。\n\n1.2 未成年のお客様が、法定代理人の同意がないにもかかわらず同意があると偽って本サービスを利用した場合、年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合には、その未成年のお客様またはその法定代理人は、本サービスにおける一切の法律行為を取消すことができません。\n\n1.3 本規約に同意した時点で未成年であったお客様が、成年に達した後に本サービスを利用した場合、未成年であった間の利用行為を追認したものとみなされます。\n\n1.4 当社は、お客様の年齢に応じて、本サービスの全部または一部の利用を制限する場合があります。制限の対象および内容は、本サービス内で別途お知らせします。\n\n\n2. 本サービスについて\n\n2.1 本サービスのご利用にあたっては、バンダイナムコIDの会員登録が必要です。\n\n2.2 お客様は、日本国内でのみ本サービスをご利用いただけます。\n\n2.3 本サービスはインターネットに接続できる環境でご利用ください。なお、本サービスは無料でプレイできますが、通信料等はお客様のご負担となります。\n\n\n3. 本サービスの停止・プレイデータのリセットについて\n\n3.1 メンテナンス、不具合またはネットワーク障害により、予告なく一時停止または中断が発生する場合があります。\n\n3.2 当社は、前項に定める本サービスの一時停止または中断によりお客様に損害が生じた場合であっても、いかなる責任も負わないものとします。 \n\n\n4. お問い合わせ\n\n4.1 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ 窓口にて受け付けます。\n\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n5. 当社からの通知\n\n5.1 当社からお客様に対する通知は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n\n5.2 お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n\n6. アカウント\n\n6.1 お客様は、本サービスに関するお客様のアカウント（プレイデータおよびパスワードを含み、以下「アカウント」といいます。）を適切に管理するものとし、その利用および管理について一切の責任を負うものとします。また、本サービスと連携するサービスのアカウントについても同様とします。\n\n6.2 本サービスおよびアカウントは、当社がお客様に非独占的に利用を許諾しているものであり、お客様は当社が定めた利用範囲内に限りこれらを利用することができます。\n\n6.3 当社は、お客様のアカウントを利用して行われた本サービスの利用をお客様による利用とみなすことができます。また、アカウントの正当な利用者が不明な場合、当社は、当該アカウントを実際に利用している方をアカウントの正当な利用者とみなすことができます。なお、お客様のアカウントに関して生じた利用料金支払債務その他一切の債務は、お客様が負担するものとします。\n\n6.4 別途当社が定める期間  （定めがない場合には1年間）にわたりお客様による本サービスの利用実態がない場合、当社はお客様のアカウントの全部または一部を消去することができます。\n \n\n7. プレイデータ\n\n7.1 お客様は、アカウントまたはそれに含まれるゲーム内通貨、デジタルアイテム、ユーザー名、レベル、ランク、ステータス、称号その他のプレイデータ（以下「プレイデータ」といいます。）に関して所有権、知的財産権その他の権利を取得することはありません。また、プレイデータは、当社が権利を有しお客様に非独占的に許諾するデジタルデータに過ぎず、法令にて定められている場合を除き有償で提供されたものを含めいかなる金銭的価値を有しません。\n \n7.2 お客様が利用されているプレイデータの内容または数量が、本サービスのご利用状況と比較して誤っていることが判明した場合、当社は、お客様に対して事前に通知することなくこれを修正することができます。\n \n7.3 お客様のプレイデータに含まれるユーザー名、レベル、ランク、ステータス、称号等は、本サービス内において他のお客様に公開されることがあります。\n\n\n8. バンダイナムコIDの利用\n\n8.１ 本サービスは、バンダイナムコIDを用いてデータ管理等を行っており、本サービスの利用に際しては、バンダイナムコIDを取得していただく必要があります。\n\n8.2 お客様が複数のバンダイナムコIDを保有されている場合であっても、本サービスにおいて２以上のバンダイナムコIDを利用いただくことはできません。\n\n8.3 お客様のバンダイナムコIDサービスの会員資格が失効となった場合、またはお客様がバンダイナムコIDサービスの会員登録を解除した場合、本サービスは一切利用できません。また、一度バンダイナムコIDサービスの会員資格が失効となり、または会員登録を解除しますと、サービス内データ（※）は一切復元できません。\n（※）「サービス内データ」とは、バンダイナムコIDに関連付ける形で記録・蓄積された本サービスにおける一切の情報（有償無償を問わず本サービス内で入手した全てのコンテンツおよびプレイデータ、ならびに本サービス内でお客様が投稿した文字、画像等の情報を含みます）をいいます。\n\n8.4   バンダイナムコIDに関するお問い合わせは、下記連絡先よりお問い合わせください。\n＜バンダイナムコIDお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n9. 有償サービス\n\n9.1 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n\n9.2 当社は、有償で発行する本サービス専用のゲーム内通貨（以下、「本サービス専用通貨」といいます。）をお客様に提供することがあります。\n\n9.3 本サービス専用通貨の販売価格は購入ページをご覧ください。\n\n9.4 お客様が未成年者である場合には、本サービス専用通貨の購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n\n9.5 お客様が取得した本サービス専用通貨は本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n\n9.6 本サービス専用通貨の有効期限は、お客様が当該本サービス専用通貨を購入した月を含む5か月目の末日23:59までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n\n9.7 本サービス専用通貨および有償コンテンツの価格、仕様の変更、販売の終了は当社の任意とします。\n\n9.8 当社は、法令にて定められている場合を除き、本サービス専用通貨および有償コンテンツの現金・金券等への払い戻し・交換はいたしません。\n\n9.9 お客様は、第三者に対する本サービス専用通貨の譲渡、貸与、共有等はできません。また、当社所定の方法にて行う場合を除き、第三者に対する有償コンテンツの譲渡、貸与、共有等もできません。\n\n9.10 別途当社が「資金決済に関する法律に基づく表示」と題するページに前払式支払手段としてコンテンツを表示する場合、当該コンテンツは、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n\n9.11 有償コンテンツの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n\n\n10. サービスの変更について\n\n10.1 当社は、お客様への予告を行うことなく、本サービス、アカウントまたはプレイデータ（本サービス専用通貨および有償コンテンツを含みます。）の内容、仕様および価格等を変更することができます。なお、当該変更により、お客様が購入した有償コンテンツの性能、効果または有用性等に変更が生じることがあります。\n\n10.2 当社は、お客様への予告を行うことなく、本サービスの提供を停止、中止または終了することがあります。\n\n\n11. 権利について\n\n11.1 本サービス（本サービスに含まれる発明、考案、意匠、商標、標章、画像、映像、文章、プログラムその他の一切の情報等を含みます。）に係る知的財産権その他の一切の権利は、当社または当社がその利用の許諾を得ている第三者に帰属します。\n\n11.2 お客様は、本サービスに関して当社とお客様の間で生じたいかなる権利または義務を、貸与、交換、譲渡、売買もしくは質入してはならず、また、方法を問わず第三者に利用させてはならないものとします。また、お客様は当該権利義務またはアカウントを他のお客様その他の第三者に相続することはできません。\n\n\n12. 情報の取扱いについて\n\n12.1 本サービスを通じてお客様からいただいたコメント、フィードバック、不具合等の報告、プレイデータ等、本サービスを利用したことにより発生する情報等に関する一切の権利は当社に帰属し、今後のゲーム開発および運営に活用いたします。\n\n12.2 当社は、本サービスの分析および改善を目的として、お客様のハードウェア、ソフトウェアその他利用環境に関する情報を、お客様の個別の同意を得ることなく自動取得できるものとします。\n\n\n13. 著作物の利用について\n\n13.1 本サービスのゲームプレイを撮影した画像・動画のインターネット上の利用に関しましては、 当社が定める「BLUE PROTOCOL 著作物利用ガイドライン」をお守りください。\n\n\n14. 禁止事項について   \n\n14.1 以下に該当する行為または該当するおそれのある行為を一切行ってはなりません。当社が当該行為を確認した場合、お客様に対し事前に通知することなく本サービスの機能制限、プレイデータの修正（本サービス専用通貨および有償コンテンツ等の抹消を含みます。）またはアカウント停止等の措置を行います。なお、当該行為に該当するか否かは、当社の判断によります。\n(1) 複数のバンダイナムコIDを利用する行為\n(2) お客様のバンダイナムコIDを第三者に開示または使用させる行為\n(3) 他人（家族を含みます）になりすます行為、当社及び当社関連会社・本サービスの関係者になりすます行為、又は他の登録会員のパスワ－ドを不正に使用する行為\n(4) 氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報（自分のもの他人のものかは問いません）を投稿する行為並びにニックネームに本名を登録する行為\n(5) 当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為\n(6) 当社及び当社関連会社、又は第三者を差別又は誹謗中傷し、名誉や信用を毀損する行為\n(7) 本サービスのデータを改ざん又は不正に作成する行為\n(8) 本サービスの利用を阻害する情報を登録する行為\n(9) 本サービスの利用方法として予め想定又は許容される行為以外の行為\n(10) 自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用した本サービスの利用及び勧奨する行為\n(11) 有害なコンピュータ・プログラム等を公衆送信、頒布又は使用する行為\n(12) 本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為\n(13) 虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為\n(14) 本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為\n(15) 本サービスの提供を妨げる行為または誹謗する行為\n(16) 本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為\n(17) 本サービスに関する当社が未公表の情報を、当社以外の第三者に公開する行為\n(18) アイテムを不正に取得するなど、プログラムの不具合を利用した不正行為（不具合を利用していると当社が判断した行為を含みます）\n(19) リアルマネートレード（RMT）及びこれに類する行為\n(20) 犯罪行為又はこれに結びつく行為\n(21) 公序良俗又は法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に反する目的で本サービスを利用する行為\n(22) 広告宣伝、営業活動その他営利目的で本サービスを利用する行為\n(23) 異性との交際を目的として本サービスを利用する行為\n(24) 宗教活動及び類似する行為、宗教団体への勧誘行為\n(25) 政治活動及び類似する行為、政治団体への勧誘行為\n(26) 選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為\n(27) 他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為\n(28) わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為\n(29) 連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為\n(30) 無限連鎖講(ネズミ講)又はネットワークビジネス等の開設及びこれを勧誘する行為\n(31) 脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為\n(32) 反社会的勢力等への利益供与行為\n(33) 買春・売春を助長する投稿をする行為\n(34) 覚せい剤、麻薬等薬物の使用を助長する投稿をする行為\n(35) アダルト・性風俗産業関連の投稿をする行為\n(36) 自殺、自傷行為を助長する投稿をする行為\n(37) 著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をする行為\n(38) 未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をする行為\n(39) 本サービスと無関係な情報を著しい長文として投稿する行為\n(40) 異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿する行為\n(41) 本サービスの不具合又は不正行為に関する情報を投稿する行為\n(42) アカウントを複数作成する行為\n(43) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避する行為\n(44) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）\n(45) 他のお客様を他のサービスに勧誘または誘導する行為\n(46) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求する行為\n(47) 日本国外から本サービスを利用する行為\n(48) 当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しない行為。または当社からの協力要請に従わない行為\n(49) 本規約に違反すると認められる行為\n(50) 前各号に該当するおそれがあると当社が判断する行為および当社が不適切と判断した行為\n \n14.2 お客様が前項に違反して、本サービスの内容を改変し又は他のソフトウェアと結合した場合、その結果についての権利（著作権法第27条及び第28条所定の権利を含みます）は当社に帰属し、お客様は当該権利について、他者に対し、貸与、使用許諾等をしてはならないものとします。\n\n14.3 禁止行為が繰り返された場合、または悪質な禁止行為が一度でもなされた場合には、無期限のアカウント利用停止措置を含めた厳格な対応を行います。これらの対応が行われた場合であっても、当社はこれらの対応を行うに至った理由や経緯等も含め、お客様の個別の質問には回答しない場合があります。  \n \n14.4 お客様が無期限のアカウント利用停止措置を受けた場合、以後、お客様は本サービスを利用することは一切できません。その場合、本サービスの終了時を含め、本サービス専用通貨や他のデジタルアイテム等の現金への払戻しまたは金券等への交換はいたしません。\n \n\n15. 解除について\n\n15.1 お客様が本規約またはガイドラインに違反した場合または当社が別途提供する他のサービスにおいてその利用規約等に違反した場合には、当社は、何ら催告なしに本サービスにかかる契約を解除し、またはお客様に対する本サービスの提供を停止、中止もしくは終了することができます。なお、違反に該当するか否かは当社の判断によります。\n \n15.2 前項に基づき当社が契約を解除した場合においても、お客様は解除日を含むその日までに支払義務の生じた一切の債務について引き続き責任を負います。\n\n\n16. 免責について\n\n16.1 アカウントの利用停止措置、プレイデータの修正その他の本規約またはガイドラインに基づいて実施する当社の対応によって、お客様に何らかの影響が生じた場合においても、当社は当該影響につき責任（利用料金の返還または払戻しを行う責任を含みます。以下同じ。）を負いません。\n\n16.2 当社は、天災地変、社会的動乱、ストライキ、火災、停電、通信インフラの停止その他の当社の支配できない事由に起因してお客様に生じる影響について責任を負いません。\n\n16.3 当社は、本サービスおよび本サービス内で当社が提供する情報について、明示・黙示を問わずその完全性、正確性、商品性、特定目的のための適合性、非侵害性その他のいかなる保証（本サービスがいかなる環境下でも利用可能であること、お客様のプレイデータが反映されること、または本サービスに不具合もしくはエラーがないことに関する保証を含みます。）を行わず、また、責任を負いません。\n\n16.4 お客様のご利用端末の破損、データ消去、紛失、盗難、端末変更もしくは不具合、ご利用端末からのアンインストール、またはパスワードの公開、紛失もしくは忘却等（パスワードの不設定および設定の不備を含みます。）によって、お客様のアカウントの全部または一部が消失し、またはお客様がアカウントへアクセスできなくなった場合においても、当社は責任を負いません。\n\n16.5 当社は、お客様と第三者（他のお客様、決済事業者、本サービス内で表示される広告の広告事業者を含みます。）との間で生じた紛争には関知せず、一切の責任を負いません。また、当社は、第三者の投稿情報、サービス（本サービス内で表示される広告およびその広告の対象となるサービスを含みます。）または行為等について一切の責任を負いません。\n\n16.6 お客様は、本サービスを利用するにあたり、健全な生活環境を乱すような過度の利用を避け、また、お客様の周囲の状況に注意して安全に利用するよう心がけるものとします。当社は、社会通念上適切な範囲を逸脱する本サービスの利用、または本サービスの利用中における事故等によりお客様に生じた社会的、精神的、肉体的な損害について、責任を負いません。\n\n16.7 当社は、お客様に対して適宜情報提供やアドバイスを行うことがありますが、お客様は当該情報やアドバイスをお客様の責任において取扱うものとし、当社はその結果について責任を負いません。\n\n\n17. 損害賠償   \n\n17.1 本規約の他の定めにかかわらず、当社の責めに帰すべき事由（3.1項に定める本サービスの一時停止または中断による場合は含まれません）により有償コンテンツまたはお客様が有償で提供を受けた本サービス専用通貨に関してお客様が損害を被った場合、当社は、通常直接発生すると考えられる損害の範囲に限定し、当該損害が発生した日の属する月における、お客様の本サービス専用通貨購入額または有償コンテンツ相当額を上限として、当該損害を賠償する責任を負います。ただし、当社の故意または重大な過失に起因してお客様が損害を被った場合はこの限りではありません。\n \n17.2 お客様は、本規約またはガイドラインへの違反その他自己の責めに帰すべき事由により当社に損害を与えた場合、当社に対して当該損害を賠償する責任を負います。\n\n\n18. プライバシーポリシー\n\n18.1 当社は、本サービスを通じて当社が取得したお客様の個人情報を、別途定める「プライバシーポリシー」に基づき厳重に管理します。\n\n\n19. 本規約の変更について\n\n19.1 当社は、本規約の内容を随時変更できます。当社が本規約に何らかの変更を加える場合には、当該変更について事前に本サービスの公式サイトを通じて通知するものとし、変更後の規約は、本サービスの公式サイト内に掲示することによって効果が生じるものとします。お客様は、当社からの告知がなくても、本規約の内容を定期的に確認してください。\n\n19.2 お客様が本規約の内容に同意できない場合には、本サービスのご利用を直ちに中止してください。本規約の内容の変更後、お客様が本サービスのご利用を継続した場合、当社は当該変更をお客様が承諾したものとみなします。\n\n\n20. 権利不放棄\n\n20.1 本規約、ガイドラインおよび法令等に基づく権利を当社が行使しない場合であっても、そのことは当該権利の放棄とはならず、当社はかかる権利を依然として行使できます。\n\n\n21. 分離可能性\n\n21.1 本規約およびガイドラインの一部が法令等に基づき無効と判断された場合であっても、他の規定の有効性には影響しないものとします。\n\n\n22. 準拠法および合意管轄\n\n22.1 本サービス、本規約およびガイドラインは日本法を準拠法とし、これに従い解釈されるものとします。\n\n22.2 本サービス、本規約およびガイドラインに関連してお客様と当社との間で生じた紛争は、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n\n以上\n制定　2023年6月14日\n\n\n\n家庭用ゲーム機向け『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供する家庭用ゲーム機向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、この利用規約（以下、「本規約」といいます。）記載の一切の条件および本規約に組み込まれる追加条件が適用されます。かかる条件のうち一部でも同意できないものがある場合には、本サービスの利用はできません。\n\n本規約は、お客様と当社との間の契約であって、本規約が表示される家庭用ゲーム機向け『BLUE PROTOCOL』（以下、「本件ゲーム」といいます。）の利用に適用されます。なお、本件ゲームには、ゲームのマルチプレイヤー部分、オンライン部分およびダウンロード部分、ならびに紙媒体または電子媒体の関連ドキュメントおよびコンテンツも含まれますが、これらに限定されるものではありません。本規約はライセンス契約であって、本件ゲームまたはそのコピーの知的財産権をお客様に譲渡するものではありません。お客様と当社との間に他の製品またはサービスに関する別の契約がある場合においても、かかる契約の条件が本規約によって変更されることはありません。お客様は、本規約のいかなる部分も変更、追加または削除できません。\n\n本件ゲームの一部である特定の機能には、当社から提示される追加条件（料金、支払方法およびプロモーションに関する規則も含まれますが、これらに限定されるものではありません）が適用されることがあります。別段の記載がない限り、当該追加条件は、参照により本規約に組み込まれたことになります。本規約と何らかの追加条件との間に矛盾が生じた場合には、当該特定の機能については、追加条件が優先するものとします。\n\n1. プライバシー\n本件ゲームを通じて収集されるデータは、当社により日本において保持されます。詳しくは、当社のプライバシーポリシー（本規約の後に表示されます）をご確認ください。プライバシーポリシーでは、かかるデータの当社による収集、利用および開示の方法について説明がなされています。\n\n2. ライセンスの前提条件\n本規約において許諾されるライセンスは、以下に掲げる事項が前提条件となります。\n(1) お客様がご自身の法域における成人年齢に達しているか、お客様がご自身の法域における成人年齢に達していない場合には本規約および適用される一切の追加条件が適用されることについて、お客様の法定代理人（親権者等）による同意があること。\n(2) 本規約の一切の条件および適用される一切の追加条件について、お客様が同意しているとともにこれらを遵守していること。\n(3) お客様による本件ゲームの利用について、一定のセキュリティ措置の適用を受けること。これには、本件ゲームのシリアルコード登録、インターネットへの継続的アクセス、および一定のセキュリティ/デジタル権管理機能への同意も含まれますが、これらに限定されるものではありません。かかるセキュリティ措置への同意または遵守がなされなかった場合には、お客様による本件ゲームの利用が部分的または完全に損なわれることがあります。\n(4) お客様による本件ゲームの利用が、適用のある一切の現地法令、州法令、国内法令および外国法令に従ったものであること。\n(5) お客様による本件ゲームの利用の場所が、本件ゲームの動作環境として予定され有効にライセンス認証を経たオペレーティングシステムが動作しているローカルコンピューター（以下、「対象ハードウェア」といいます。）に限定されること。\n(6) お客様が、対象ハードウェアに適用される一切の条件（決済手続に関するプラットフォームの条件も含まれます）に同意済みであるとともにこれらを遵守していること。\n\n3. 限定的利用ライセンス\n(1) 本規約に従い、当社は、プラットフォーム利用規約（該当のものがある場合）で許可された範囲に限り、お客様の所有または管理する対象ハードウェア上で、お客様の居住国において、本規約の期間本件ゲームを利用するための非独占的、譲渡不可かつ限定的なライセンスをお客様に許諾します。本件ゲームの更新版、追加版および交換品も、本規約が適用されます。ただし、かかる更新版等に他のライセンス条件が付されている場合には、この限りではありません。\n(2) 上記内容は、本件ゲームについてのお客様の権利のすべてを定めたものです。本件ゲームについての権利のうち本規約においてお客様に明示的に付与されていない一切のものは、当社に留保されます。お客様は、次のいずれの行為についても、自ら行わず、いかなる第三者にも許可せず、いかなる第三者にも行わせないものとします。(i) 本件ゲームの配布、コピー、ライセンス、貸与または販売（本規約またはプラットフォーム利用規約により明示的に許可されたものを除きます）、(ii) お客様ご自身の私的な非商用利用以外を目的とした本件ゲームの利用、(iii) 本件ゲームのリバースエンジニアリング、逆コンパイル、逆アセンブル、またはソースコード抽出、(iv) 本件ゲームの修正、改変、または派生物作成、(v) 本件ゲームにおける著作権表示、商標表示その他の権利帰属表示の削除、改変または不明瞭化、(vi) 予定された目的以外での本件ゲームの利用、(vii) お客様の所有または管理していない対象ハードウェア上での本件ゲームの利用、(viii) 本件ゲームにおけるセキュリティ措置の回避またはその試み、または (ix) 本件ゲームのオンライン機能へのアクセス時におけるお客様の地域の不明瞭化または隠ぺい。\n\n4. 権利帰属\n本件ゲームならびに本件ゲーム内のまたは本件ゲームを通じて利用できる一切のコンテンツ（本規約に定めるユーザーコンテンツを除きます）および素材（当社のロゴ、一切のデザイン、テキスト、グラフィックス、写真、情報、データ、ソフトウェア、サウンドファイル、本件ゲーム通貨および本件仮想アイテムその他のファイル、ならびにこれらを選別または整理したものも含まれますが、これに限定されるものではありません）の権利は、当社またはそのライセンサーに帰属し、著作権その他の知的財産に関する法律および条約で保護されています。本規約におけるいかなる別段の規定にもかかわらず、お客様は、上記コンテンツおよび素材（本件ゲーム通貨および本件仮想アイテムも含まれますが、これらに限定されるものではありません）についてのいかなる権利または権原もお客様に帰属しないことに、同意しているものとします。\n\n5. 期間\n(1) 第2条に掲げられた前提条件をお客様が満たすことを条件として、本規約は、お客様が本件ゲームを利用する期間中、有効に存続するものとします。いずれの当事者も、理由の有無にかかわらず、合理的な事前通知により、いつでも本規約を解除できるものとします。お客様は、ご自身の保有、保管または管理する本件ゲームの一切のコピーを削除または破棄することにより、本規約を解除できるものとします。当社は、お客様による本件ゲームの利用の中止について、お客様および第三者のいずれに対しても、責任を負いません。\n(2) お客様による本規約への違反があった場合、当社は、自己の有する他のいかなる権利も制限することなく、本件ゲームについてのお客様に対するライセンスを即時に制限、停止または取り消す権利を有するものとします。\n(3) 本規約が終了した場合、(i) 本件ゲームについてのお客様へのライセンスは、即時に失効するものとし、(ii) お客様は、いかなる料金の返金も受ける権利を有しません。これには、未消化の料金（該当のものがある場合）も含まれます。ただし、適用法上の義務付けにより本件有償ゲーム通貨が返金対象となる場合は、この限りではありません。\n(4) 第3条(2)、第4条、第5条(4)、第8条、第9条、および第11条から第18条は、本規約の終了後も存続するものとします。\n\n6. 修正\n当社は、時期および理由の如何を問わず、その単独の裁量により、本規約を変更することができます。当社は、本規約に何らかの変更を加える場合には、当該変更について、事前に本サービスの公式サイトを通じて通知するものとします。お客様は、かかる変更の効力発生日後も本件ゲームの利用を継続することにより、変更後の本規約に同意したものとみなされます。\n\n7. 本件ゲームの修正\n当社は、合理的な事前通知により、本件ゲームまたはそのいかなる機能もしくは部分についても、一時的または永久的に修正しまたは中止することができます。なお、緊急事態または絶対的に必要な場合においては、かかる事前通知を要しないものとします。お客様は、本件ゲームまたはそのいかなる部分のいかなる修正、停止または中止についても当社が責任を負わないことに、同意しているものとします。\n\n8. お問い合せ\n(1) 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ窓口にて受け付けます。\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n9. 当社からの通知\n(1) 当社からお客様に対する通知は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n(2) お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n10. ゲーム内通貨および仮想アイテム\n(1) 当社は、次の機能をお客様に提供することがあります。(i) ゲーム内通貨を使用するための限定的ライセンスを購入する機能（当該ゲーム内通貨を、以下、「本件有償ゲーム通貨」といいます。）、(ii) 本件ゲームにおける特定のタスクの遂行によりゲーム内通貨を使用するための限定的ライセンスを獲得する機能（当該ゲーム内通貨と本件有償ゲーム通貨と合わせて、以下、「本件ゲーム通貨」といいます。）、および/または (iii) 本件ゲーム内で当社により提供される仮想物品およびサービス（以下、「本件仮想アイテム」といいます。）についての限定的ライセンスを獲得し、かつ/またはかかる限定的ライセンスを本件ゲーム通貨で購入する機能。当社は、かかるライセンスの購入または獲得の機能を提供する場合には、本規約に従い、お客様に対し、かかる本件ゲーム通貨または本件仮想アイテムをご自身の私的かつ非商用的な用途に使用するための非独占的、譲渡不可、取消可能かつ限定的な権利およびライセンスを許諾するものとします。\n(2) 本件ゲーム通貨によって引き換えることのできるものは、本件ゲーム内で使用できる本件仮想アイテムに限られます。本件ゲーム通貨および本件仮想アイテムは、当社その他のいかなる者によっても、金銭、金銭的価値を有するものまたは金銭等価物へと引き換えることはできません。ただし、適用法による別段の義務付けがある場合は、この限りではありません。本件ゲーム通貨および本件仮想アイテムは、現実通貨と等価値を有するものではなく、現実通貨の代替となるものでもありません。当社その他のいかなる者も、本件ゲーム通貨または本件仮想アイテムについて、有価物（現実通貨も含みます）への引換えの義務を負いません。お客様は、本件ゲーム通貨または本件仮想アイテムのゲーム内における性質または価値に対し影響を及ぼすおそれのある措置（適用法上禁止されているものを除きます）が当社によりいかなる時点であれ講じられることについて、確認し同意しているものとします。当社は、その単独の裁量により、本件ゲーム通貨の購入量、獲得量または引換量に制限を加えることができるものとします。\n(3) 本件有償ゲーム通貨のいかなる購入も、確定的なものであって、状況の如何を問わず返金不可、譲渡不可かつ交換不可となります。ただし、適用法による別段の義務付けがある場合は、この限りではありません。本件有償ゲーム通貨および一定の本件仮想アイテムの購入価格を除き、当社は、本件ゲーム通貨または本件仮想アイテムのアクセス、使用または不使用について課金をすることはありません。\n(4) お客様による本件ゲーム通貨または本件仮想アイテムの譲渡、売却、贈与、交換、取引、リース、再許諾または貸借は、いずれも禁止されています。ただし、本件ゲーム内において、かつ当社により明示的に許可されている場合については、この限りではありません。本規約における別段の合意がある場合を除き、本件ゲーム通貨および本件仮想アイテムについての権利および権原は、当社に留保されます。\n(5) 本件ゲーム通貨および本件仮想アイテムについて本規約で許諾されるライセンスは、第5条に基づく本規約の終了時に失効するものとします。ただし、本規約に別段の定めがある場合は、この限りではありません。\n(6) 別途「資金決済に関する法律に基づく表示」にて表示される本件有償ゲーム通貨は、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます。）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n(7) 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n(8) 本件ゲーム通貨または本件仮想アイテムの販売価格は購入ページをご覧ください。\n(9) お客様が未成年者である場合には、本件ゲーム通貨または本件仮想アイテムの購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n(10) お客様が取得した本件ゲーム通貨または本件仮想アイテムは本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n(11) 本件ゲーム通貨の有効期限は、お客様が当該本件ゲーム通貨を購入した月を含む5か月目の末日23:59までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n(12) 本件ゲーム通貨および本件仮想アイテムの価格、仕様の変更、販売の終了は当社の任意とします。\n(13) 本件ゲーム通貨および本件仮想アイテムの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n(14) 本サービスにおける本件仮想アイテムのゲーム内表現は、本サービスと配信ストアが異なるサービスにおけるゲーム内表現とは、当該サービスが本サービスと同一名称であっても、一部異なる場合があります。詳細は公式サイトをご確認ください。\n\n11. ユーザーコンテンツ\n何らかの通信、情報、知的財産、素材、メッセージ、写真、グラフィックス、動画、URLその他の事項またはコンテンツを本件ゲームに投稿すること（投稿された当該コンテンツ等を以下、「ユーザーコンテンツ」といいます）により、適用法上許容される限りにおいて、お客様は、ご自身へのさらなる通知または対価のいずれもなしに、知的財産権が存続する全期間にわたり、本件ゲームならびにこれに関する物品およびサービスに関連してユーザーコンテンツを利用するための非独占的、無償、譲渡可能かつ再許諾可能の全世界におけるライセンスを、本規約により当社に対し許諾したことになります。これには、既知であるか今後考案されるかを問わずあらゆる方法および媒体による複製、複写、翻案、修正、実施、派生物作成、表示、公表、放映、送信その他の方法による利用、配布、活用および公開の権利も含まれます。適用法上許容される限りにおいて、お客様は、当社および第三者によるユーザーコンテンツの利用について、著作者人格権および実演家人格権を行使しないものとします。当社に許諾されたライセンスは、本規約の終了または取消しの後においても、存続するものとします。\n\n12. オンライン上の行為\n当社の故意または重過失による場合を除き、当社は、いかなるユーザーの行為についても、それが本件ゲームの利用に関係するか否かにかかわらず、何らの責任も負いません。当社は、お客様が本条の規定その他本規約の何らかの条件に違反した場合には、いつでもお客様による本件ゲームの利用権を停止しまたは失効させることができるものとします。当社は、本件ゲームにおいてアップロード、公表、保存または表示（総称して以下、「投稿」といいます。）されたいかなるユーザーコンテンツについても、（たとえば著作権者からの請求に対する対応として）審査することができるものとします。ただし、本件ゲーム内のプライベートメッセージの一部としてシェアされたユーザーコンテンツについては、当社は、少なくとも当該通信の一方からその内容が（たとえば、好ましくないメッセージとして当社への通報により）提出された場合を除き、その内容のスクリーニングまたは審査のいずれも実施しません。当社は、いかなるユーザーコンテンツについても、削除する権利およびオンライン化を拒否する権利を有します。当社は、本件ゲームに投稿されたユーザーコンテンツのいずれについても、日常的にスクリーニング、編集または監視を行うわけではありません。ただし、当社は、本件ゲームを通じて投稿されたいかなるユーザーコンテンツについても、それが本規約に違反し、第三者の権利を侵害し、かつ/または適用のある法律、規則もしくは規制に違反するとの判断を自己の合理的裁量により下した場合には、削除、スクリーニングまたは編集を行うことができるとともに、かかる措置について絶対的裁量を有するものとします。お客様は、本件ゲームについて過去に利用停止処分または退会処分を受けたことがある場合には、本件ゲームを利用することができません。お客様は、自らが投稿しまたはユーザーもしくは第三者に送信した一切のユーザーコンテンツについて、単独で責任を負うものとします。とりわけ、お客様は、本件ゲームに関連して以下のいずれの行為についても、自ら行わないこと、試みないこと、かつ他者に行わせないことについて、同意しているものとします。\n(1) 不法、誹謗、中傷、不快、わいせつ、卑猥、下品、低俗、淫ら、露骨な性表現、いやがらせ、脅迫、プライバシー権侵害、パブリシティ権侵害、悪態、扇動もしくは詐欺に当たるユーザーコンテンツ、不法、買春・売春、覚せい剤、麻薬等薬物の使用、自殺、自傷行為その他の反社会的な行為（ハッキングも含まれます）を助長しもしくは促進するユーザーコンテンツ、何らかの集団もしくは個人に対する人種差別、偏見、物理的危害その他の危害を助長するユーザーコンテンツまたは他の何らかの点で好ましくないユーザーコンテンツを投稿すること。\n(2) 他者の特許権、商標権、営業秘密、著作権その他の知的財産権または財産権を侵害するまたはそのおそれのあるユーザーコンテンツを投稿すること。\n(3) 著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をすること。\n(4) 未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をすること。\n(5) 本サービスと無関係な情報を著しい長文として投稿すること。\n(6) 異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿すること。\n(7) 本サービスの不具合又は不正行為に関する情報を投稿すること。\n(8) 当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為を行うこと。\n(9) 商業的活動または商取引（商業目的の広告または勧誘の送信も含まれます）に関与すること。\n(10) いかなる者（ご自身も含まれます）に関するものであれ、氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報を入力、開示、投稿または配布すること並びにニックネームに本名を登録すること。\n(11) 他者（当社の役員、フォーラムリーダー、ガイド、ホスト、従業員または代理人も含まれます）になりすますこと、またはお客様と他者との関係性について詐称しその他何らかの方法で不実の表示をすること又は他の登録会員のパスワ－ドを不正に使用すること。\n(12) 本件ゲーム、その通常のプレイもしくは会話の流れを妨害もしくは阻害し、または下品な言葉、ののしり、過剰な叫び声（全部大文字など）、スパム行為もしくは本件ゲームの他のユーザーを害する他の何らかの妨害的もしくは有害な方法を用いること。\n(13) バグ、エラーその他の設計上の瑕疵を利用することにより、本件ゲームに対する不正なアクセス権を取得し、他のプレイヤーとの関係で不当に有利な状況を獲得し、または本件ゲームに関連してチート行為もしくは不正利用を行うこと。かかる行為には、本件ゲームのうちアクセス権限を有しない部分にアクセスすること、またはボット、エミュレーターその他の不正な第三者のツールを用いることも含まれますが、これらに限定されるものではありません。\n(14) 本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為を行うこと。\n(15) 本サービスのデータを改ざん又は不正に作成すること。\n(16) 本サービスの利用を阻害する情報を登録すること。\n(17) 本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為を行うこと。\n(18) 本サービスの提供を妨げる行為または誹謗する行為を行うこと。\n(19) リアルマネートレード（RMT）及びこれに類する行為を行うこと。\n(20) 犯罪行為又はこれに結びつく行為を行うこと。\n(21) 異性との交際を目的として本サービスを利用すること。\n(22) 宗教活動及び類似する行為、宗教団体への勧誘行為を行うこと。\n(23) 政治活動及び類似する行為、政治団体への勧誘行為を行うこと。\n(24) 選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為を行うこと。\n(25) 他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為を行うこと。\n(26) わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為を行うこと。\n(27) 連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為を行うこと。\n(28) 無限連鎖講(ネズミ講) 又はネットワークビジネス等の開設及びこれを勧誘する行為を行うこと。\n(29) 脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為を行うこと。\n(30) 反社会的勢力等への利益供与行為を行うこと。\n(31) アカウントを複数作成すること。\n(32) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避すること。\n(33) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）を行うこと。\n(34) 他のお客様を他のサービスに勧誘または誘導すること。\n(35) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求すること。\n(36) 日本国外から本サービスを利用すること。\n(37) 当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しないこと。または当社からの協力要請に従わないこと。\n(38) 本件ゲームのルールに則った他のユーザーによる本件ゲームのプレイの享受を妨害することとなる行為、または当該プレイの享受のための本件ゲームの維持に際して当社もしくはプラットフォームプロバイダーにおける費用その他の負担を増加させることとなる行為をすること。\n(39) 自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用して本サービスの利用をすること、及び当該利用を勧奨すること。\n(40) 有害なコンピュータ・プログラム等を公衆送信、頒布又は使用すること。\n(41) 本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為を行うこと。\n(42) 虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為を行うこと。\n(43) 本サービスに関する当社が未公表の情報を、当社以外の第三者に公開すること。オンラインプレイ中に意図的にネットワークを切断すること、または他の一定のプレイヤーに繰り返し負けることで当該プレイヤーのランキングの上昇もしくは本件ゲーム内でのカウント獲得を助けること。\n(44) 本件仮想アイテムまたは本件ゲーム通貨について、本件ゲーム外において取引、売却、オークションその他の譲渡を行うかまたは譲渡を試みること。\n(45) 本サービスの利用方法として予め想定又は許容される行為以外の行為を行うこと。\n(46) 上記のほか、本規約の規定その他当社から告知されたポリシーに違反するか、または当社に責任を負わせること。\n\n13. 第三者のコンテンツ\n本件ゲームを通じ、ユーザー、広告主その他の第三者のコンテンツがお客様に提供されることがあります。当社は、当該第三者のコンテンツを管理しておりません。そのため、お客様は、当社の故意または重過失による場合を除き、いかなる第三者のコンテンツについても当社が責任を負わないこと、第三者のコンテンツに含まれる情報の正確性または品質のいずれに関しても当社が保証しないこと、また第三者のコンテンツのうち意図しないもの、好ましくないもの、不正確なもの、誤解を招くものまたは不法なもののいずれについても当社が責任を負わないことに、同意しているものとします。商号、商標、メーカー、サプライヤーその他によるいかなる製品、サービス、プロセスその他の情報についての言及も、これらについて当社による是認、後援もしくは推奨または提携関係を意味するものではなく、これらを黙示するものでもありません。ただし、当社による明示がある場合は、この限りではありません。\n\n14. 免責事項\nお客様は、お客様による本件ゲームのアクセスもしくは利用に影響を及ぼすウイルスその他の無効化機能、または本件ゲーム、他のサービスおよび対象ハードウェアの間における互換性の欠如のいずれについても、当社ならびにそのライセンサーおよびサプライヤーが責任を負わないことを、確認し同意しているものとします。本件ゲームその他の一切のサービスは、「現状有姿」で提供されます。本規約に定めのある場合を除き、当社ならびにそのライセンサーおよびサプライヤーは、いかなる種類の保証（明示または黙示を問わず、法律その他のいかなる根拠によるものであるかも問いません）もしません。これには、非侵害、商品性または特定目的への適合性に関する黙示的保証も含まれますが、これらに限定されるものではありません。\n法域によっては、消費者契約における黙示的条件の否認または保証もしくは担保の排除もしくは制限が許されていないことから、本条における免責事項の一部または全部がお客様に適用されないことがあります。\n\n15. インターネット\nお客様は、本件ゲームに関連する通信または処理の開始、実施または完了に関する正確性、適時性、遅延または不具合について、当社がいかなる責任も負わない旨を、確認し同意しているものとします。また、当社は、本件ゲームのオンライン部分、マルチプレイヤー部分またはダウンロード部分について、お客様の希望する時点でお客様によるアクセスが可能である旨の約束または保証をすることもありません。本件ゲームの当該部分にアクセスできない状況が長期間にわたって生じることもあります。当社は、本件ゲームの当該部分のいずれの動作についても、中断がないこと、エラーがないこと、セキュアであることまたはウイルスが含まれないことのいずれも保証せず、サーバの動作継続または可用性についても保証しません。\n\n16. 責任の制限\n次に掲げるものを除き、いかなる場合も、当社またはその子会社、関係会社、役員、従業員、代理人その他のパートナーおよびサプライヤーは、本件ゲームの利用もしくは利用不能、本件ゲームに含まれているかもしくは本件ゲームを通じてアクセスするコンテンツの利用もしくは利用不能、またはサポートサービスの不提供に起因する間接損害、特別損害、派生的損害または懲罰的損害賠償その他利用機会の喪失または逸失利益など（これらに限定されるものではありません）のいかなる損害についても、それが契約、不法行為（過失も含まれます）その他のいかなる根拠による訴えであるかを問わず、責任を負いません。(1) 当社の過失に起因する死亡または人身傷害、(2) 当社による詐欺または欺まん的不実表示、(3) 当社による故意または重過失、(4) 本件ゲームの利用に起因する有形動産の滅失または損傷、および (5) 他の何らかの責任のうちその制限または排除が適用法上許されないもの。当社による軽過失、通常の過失または本規約に基づく主要な義務の違反の場合、当社の責任は、お客様に生じた予見可能な直接損害に限定されるものとします。いかなる場合も、本件ゲームの利用もしくは利用不能または本規約に起因または関連する当社の責任の総額は、契約、保証、過失、製造物責任、厳格責任、知的財産侵害その他のいかなる理論に基づくものであるかを問わず、100ドル、またはこれを上回る場合においてはお客様による本件ゲームの利用のためにお客様から当社に支払われた金額を上限とします。本条は、お客様の居住法域における法律上で契約による制限が許されていないいかなる強制的または法定の保証も、制限するものではありません。\n\n17. 準拠法\n適用法上の義務付けがある限りにおいて、本規約の一切の条件および条項は、本条に定める準拠法と矛盾する場合といえども、適用のあるすべての強行法規に準拠し、かかる法規に従って解釈されるものとします。いかなる場合も、本条において企図された準拠法に基づく本規約の条件の適用、解釈または執行により、適用のある消費者保護法に基づき消費者たるお客様に付与された何らかの権利について、排除、制限その他の限定がなされることはありません。お客様の行為は、現地法、州法、国内法および国際法の適用を受けることもありますので、その旨ご留意ください。各当事者は、本規約に起因するいかなる紛争または取引にも国際物品売買契約に関する国際連合条約が適用されない旨に、合意しているものとします。\n本規約に起因または関連する両当事者間のいかなる紛争も、本規約および日本法に準拠するものとします。\n\n18. 裁判地\n本規約に起因または関連する当事者間のいかなる紛争も、東京地方裁判所において解決されるものとし、お客様および当社は、同裁判所の専属的裁判管轄権に服することについて、合意しているものとします。\n\n19. 第三受益者\n本条で後述する場合を除き、本規約の当事者以外の人その他の法主体は、いかなる法律においてであれ、本規約のいかなる規定も行使する権利を有しません。これは、かかる人その他の法主体の名指しがある場合においても、同様とします。\nただし、対象ハードウェアとしてPlayStationを使用するお客様には、以下が適用されます。\nお客様は、株式会社ソニー・インタラクティブエンタテインメント（以下、「SIE」といいます。）が本規約の第三受益者である旨、また、本規約の条件へのお客様の同意によりSIEが第三受益者としてお客様に対し本規約を行使する権利を有することとなる旨について、確認し同意しているものとします。\n\n20. 雑則\n本規約は、本件ゲームの利用に関してお客様と当社との間の合意内容のすべてを余すところなく記載したものです。本規約の何らかの条項が無効または執行不能と判断された場合においても、当該条項により本規約の重要な部分が本規約から失われることとなる場合を除き、本規約の残余部分は、その残余期間その他第5条(4)に記載の期間にわたり、引き続き完全な効力を有するものとします。お客様は、当社の書面による事前同意を得ない限り、本規約または本規約に基づく自己の権利のいずれも、譲渡することはできません。かかる同意を得ることなく試みられたいかなる譲渡も、無効とします。上述の制約内容を条件として、本規約は、当社およびその各々の承継人および譲受人に対し完全な拘束力を有し、これらの者の利益のために効力を生じ、かつこれらの者により行使できるものとします。本規約における何らかの権利または条項について当社による行使または履行強制がなされなかった場合においても、当該権利または条項が放棄されたことにはなりません。本規約の条文見出しは、便宜のみを目的とするものであって、何らの法律上または契約上の効果も有しないものとします。\n\n制定　2023年12月6日\n\n\n\n『BLUE PROTOCOL』(以下「本サービス」といいます)にはユーザー同士の情報交換に利用できるチャット機能がございます。\n利用規約および以下のチャットサービスに関する注意事項の内容を確認し、同意したうえでチャットサービスをご利用ください。\nお客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本注意事項を確認し、法定代理人の同意を得てから本注意事項に同意してください。  \n\n■チャットサービスに関する注意事項\n● 利用規約および本注意事項に従ってチャットサービスをご利用ください。\n\n● 株式会社バンダイナムコオンライン(以下「当社」といいます)はお客様と他のお客様または第三者との間で生じた紛争には関知いたしません。また、お客様の投稿情報に関する責任はお客様が負うものとし、当社は責任を負いません。\n\n● 以下に掲げる行為または該当するおそれのある行為は禁止しています。\n(1) 犯罪的行為または公序良俗に反する行為\n(2) 当社または第三者の財産、名誉、プライバシー等の権利を侵害する行為（本名、メールアドレス、電話番号などの個人情報や個人の特定につながる情報を投稿する行為を含む）  \n(3) 不適切な表現行為または虚偽の情報を提供する行為\n(4) 本サービスまたはチャットサービスを不正な目的で利用する行為\n(5) 本サービスまたはチャットサービスの提供を妨げる行為または誹謗する行為\n(6) 本サービスまたはチャットサービスの内容を転載、複製、修正、蓄積または転送する行為\n(7) 本サービスまたはチャットサービスを利用した営利行為\n(8) 他のお客様による本サービスもしくはチャットサービスの利用を妨害し、または当該利用に支障をきたす行為\n(9) 第三者に迷惑を及ぼす行為または不快感を与える行為\n(10) 利用規約に違反する行為または法令に違反する行為\n(11) その他当社が不適切と判断する行為\n\n● お客様の投稿情報は、不特定多数の方が閲覧することがあります。また、チャットサービスの適正な運営のために、当社および運営会社がお客様の投稿情報を閲覧することがあります。\n\n● お客様が利用規約および本注意事項に違反する投稿等をした場合、又は、当社が必要と判断した場合、当社は、当社の判断により、お客様に対して事前に通知することなく、投稿情報の削除、チャットサービスの利用停止、本サービスの利用停止、本サービスの利用契約の解除その他の必要な措置、または必要に応じて政府機関その他の第三者に対する開示を行うことができます。\n\n● 当社は、お客様の投稿情報について監視、変更・削除等の措置を行う義務を負いません。また、当社がお客様の投稿情報について変更・削除等の措置を行った場合であっても、当社は、当該措置を行うに至った理由および経緯の説明はいたしません。\n\n以上\n\n制定　2023年1月10日",
        "sort_id": 1
    },
    {
        "id": 3,
        "term_id": 1,
        "type": 1,
        "revision": 2,
        "platform": 2,
        "lang": "ja_JP",
        "title": "『BLUE PROTOCOL』利用規約/チャットサービスに関する注意事項",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』利用規約\n株式会社バンダイナムコオンラインが日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』及び家庭用ゲーム機向けオンラインゲームサービス 『BLUE PROTOCOL』の利用にあたっては、当社が定める以下の事項が適用されます。該当する利用規約をよくお読みください。\n\n\nPC向け『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、当社が定める以下の事項が適用されます。\n本サービスに係るガイドライン、各種取り決め、取引条件の表示、利用上の注意等（以下「ガイドライン」といいます）は、本規約の解釈を示し、または本規約の一部を構成するものとなります。また、ガイドラインと本規約の規定内容が矛盾抵触する場合には、ガイドラインが優先して適用されます。\n本サービスのご利用にあたっては、関連する第三者との契約または規約等、例えば決済事業者が定める各種規約についても遵守していただく必要があります。\n\n\n1. 未成年者による利用について\n\n1.1 お客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本規約を確認し、法定代理人の同意を得てから本規約に同意してください。また、本サービスに含まれる有償のコンテンツ（以下、「有償コンテンツ」といいます。）を利用する場合についても、必ず法定代理人の同意を得てから利用してください。\n\n1.2 未成年のお客様が、法定代理人の同意がないにもかかわらず同意があると偽って本サービスを利用した場合、年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合には、その未成年のお客様またはその法定代理人は、本サービスにおける一切の法律行為を取消すことができません。\n\n1.3 本規約に同意した時点で未成年であったお客様が、成年に達した後に本サービスを利用した場合、未成年であった間の利用行為を追認したものとみなされます。\n\n1.4 当社は、お客様の年齢に応じて、本サービスの全部または一部の利用を制限する場合があります。制限の対象および内容は、本サービス内で別途お知らせします。\n\n\n2. 本サービスについて\n\n2.1 本サービスのご利用にあたっては、バンダイナムコIDの会員登録が必要です。\n\n2.2 お客様は、日本国内でのみ本サービスをご利用いただけます。\n\n2.3 本サービスはインターネットに接続できる環境でご利用ください。なお、本サービスは無料でプレイできますが、通信料等はお客様のご負担となります。\n\n\n3. 本サービスの停止・プレイデータのリセットについて\n\n3.1 メンテナンス、不具合またはネットワーク障害により、予告なく一時停止または中断が発生する場合があります。\n\n3.2 当社は、前項に定める本サービスの一時停止または中断によりお客様に損害が生じた場合であっても、いかなる責任も負わないものとします。 \n\n\n4. お問い合わせ\n\n4.1 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ 窓口にて受け付けます。\n\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n5. 当社からの通知\n\n5.1 当社からお客様に対する通知は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n\n5.2 お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n\n6. アカウント\n\n6.1 お客様は、本サービスに関するお客様のアカウント（プレイデータおよびパスワードを含み、以下「アカウント」といいます。）を適切に管理するものとし、その利用および管理について一切の責任を負うものとします。また、本サービスと連携するサービスのアカウントについても同様とします。\n\n6.2 本サービスおよびアカウントは、当社がお客様に非独占的に利用を許諾しているものであり、お客様は当社が定めた利用範囲内に限りこれらを利用することができます。\n\n6.3 当社は、お客様のアカウントを利用して行われた本サービスの利用をお客様による利用とみなすことができます。また、アカウントの正当な利用者が不明な場合、当社は、当該アカウントを実際に利用している方をアカウントの正当な利用者とみなすことができます。なお、お客様のアカウントに関して生じた利用料金支払債務その他一切の債務は、お客様が負担するものとします。\n\n6.4 別途当社が定める期間  （定めがない場合には1年間）にわたりお客様による本サービスの利用実態がない場合、当社はお客様のアカウントの全部または一部を消去することができます。\n \n\n7. プレイデータ\n\n7.1 お客様は、アカウントまたはそれに含まれるゲーム内通貨、デジタルアイテム、ユーザー名、レベル、ランク、ステータス、称号その他のプレイデータ（以下「プレイデータ」といいます。）に関して所有権、知的財産権その他の権利を取得することはありません。また、プレイデータは、当社が権利を有しお客様に非独占的に許諾するデジタルデータに過ぎず、法令にて定められている場合を除き有償で提供されたものを含めいかなる金銭的価値を有しません。\n \n7.2 お客様が利用されているプレイデータの内容または数量が、本サービスのご利用状況と比較して誤っていることが判明した場合、当社は、お客様に対して事前に通知することなくこれを修正することができます。\n \n7.3 お客様のプレイデータに含まれるユーザー名、レベル、ランク、ステータス、称号等は、本サービス内において他のお客様に公開されることがあります。\n\n\n8. バンダイナムコIDの利用\n\n8.１ 本サービスは、バンダイナムコIDを用いてデータ管理等を行っており、本サービスの利用に際しては、バンダイナムコIDを取得していただく必要があります。\n\n8.2 お客様が複数のバンダイナムコIDを保有されている場合であっても、本サービスにおいて２以上のバンダイナムコIDを利用いただくことはできません。\n\n8.3 お客様のバンダイナムコIDサービスの会員資格が失効となった場合、またはお客様がバンダイナムコIDサービスの会員登録を解除した場合、本サービスは一切利用できません。また、一度バンダイナムコIDサービスの会員資格が失効となり、または会員登録を解除しますと、サービス内データ（※）は一切復元できません。\n（※）「サービス内データ」とは、バンダイナムコIDに関連付ける形で記録・蓄積された本サービスにおける一切の情報（有償無償を問わず本サービス内で入手した全てのコンテンツおよびプレイデータ、ならびに本サービス内でお客様が投稿した文字、画像等の情報を含みます）をいいます。\n\n8.4   バンダイナムコIDに関するお問い合わせは、下記連絡先よりお問い合わせください。\n＜バンダイナムコIDお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n9. 有償サービス\n\n9.1 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n\n9.2 当社は、有償で発行する本サービス専用のゲーム内通貨（以下、「本サービス専用通貨」といいます。）をお客様に提供することがあります。\n\n9.3 本サービス専用通貨の販売価格は購入ページをご覧ください。\n\n9.4 お客様が未成年者である場合には、本サービス専用通貨の購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n\n9.5 お客様が取得した本サービス専用通貨は本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n\n9.6 本サービス専用通貨の有効期限は、お客様が当該本サービス専用通貨を購入した月を含む5か月目の末日23:59までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n\n9.7 本サービス専用通貨および有償コンテンツの価格、仕様の変更、販売の終了は当社の任意とします。\n\n9.8 当社は、法令にて定められている場合を除き、本サービス専用通貨および有償コンテンツの現金・金券等への払い戻し・交換はいたしません。\n\n9.9 お客様は、第三者に対する本サービス専用通貨の譲渡、貸与、共有等はできません。また、当社所定の方法にて行う場合を除き、第三者に対する有償コンテンツの譲渡、貸与、共有等もできません。\n\n9.10 別途当社が「資金決済に関する法律に基づく表示」と題するページに前払式支払手段としてコンテンツを表示する場合、当該コンテンツは、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n\n9.11 有償コンテンツの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n\n\n10. サービスの変更について\n\n10.1 当社は、お客様への予告を行うことなく、本サービス、アカウントまたはプレイデータ（本サービス専用通貨および有償コンテンツを含みます。）の内容、仕様および価格等を変更することができます。なお、当該変更により、お客様が購入した有償コンテンツの性能、効果または有用性等に変更が生じることがあります。\n\n10.2 当社は、お客様への予告を行うことなく、本サービスの提供を停止、中止または終了することがあります。\n\n\n11. 権利について\n\n11.1 本サービス（本サービスに含まれる発明、考案、意匠、商標、標章、画像、映像、文章、プログラムその他の一切の情報等を含みます。）に係る知的財産権その他の一切の権利は、当社または当社がその利用の許諾を得ている第三者に帰属します。\n\n11.2 お客様は、本サービスに関して当社とお客様の間で生じたいかなる権利または義務を、貸与、交換、譲渡、売買もしくは質入してはならず、また、方法を問わず第三者に利用させてはならないものとします。また、お客様は当該権利義務またはアカウントを他のお客様その他の第三者に相続することはできません。\n\n\n12. 情報の取扱いについて\n\n12.1 本サービスを通じてお客様からいただいたコメント、フィードバック、不具合等の報告、プレイデータ等、本サービスを利用したことにより発生する情報等に関する一切の権利は当社に帰属し、今後のゲーム開発および運営に活用いたします。\n\n12.2 当社は、本サービスの分析および改善を目的として、お客様のハードウェア、ソフトウェアその他利用環境に関する情報を、お客様の個別の同意を得ることなく自動取得できるものとします。\n\n\n13. 著作物の利用について\n\n13.1 本サービスのゲームプレイを撮影した画像・動画のインターネット上の利用に関しましては、 当社が定める「BLUE PROTOCOL 著作物利用ガイドライン」をお守りください。\n\n\n14. 禁止事項について   \n\n14.1 以下に該当する行為または該当するおそれのある行為を一切行ってはなりません。当社が当該行為を確認した場合、お客様に対し事前に通知することなく本サービスの機能制限、プレイデータの修正（本サービス専用通貨および有償コンテンツ等の抹消を含みます。）またはアカウント停止等の措置を行います。なお、当該行為に該当するか否かは、当社の判断によります。\n(1) 複数のバンダイナムコIDを利用する行為\n(2) お客様のバンダイナムコIDを第三者に開示または使用させる行為\n(3) 他人（家族を含みます）になりすます行為、当社及び当社関連会社・本サービスの関係者になりすます行為、又は他の登録会員のパスワ－ドを不正に使用する行為\n(4) 氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報（自分のもの他人のものかは問いません）を投稿する行為並びにニックネームに本名を登録する行為\n(5) 当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為\n(6) 当社及び当社関連会社、又は第三者を差別又は誹謗中傷し、名誉や信用を毀損する行為\n(7) 本サービスのデータを改ざん又は不正に作成する行為\n(8) 本サービスの利用を阻害する情報を登録する行為\n(9) 本サービスの利用方法として予め想定又は許容される行為以外の行為\n(10) 自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用した本サービスの利用及び勧奨する行為\n(11) 有害なコンピュータ・プログラム等を公衆送信、頒布又は使用する行為\n(12) 本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為\n(13) 虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為\n(14) 本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為\n(15) 本サービスの提供を妨げる行為または誹謗する行為\n(16) 本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為\n(17) 本サービスに関する当社が未公表の情報を、当社以外の第三者に公開する行為\n(18) アイテムを不正に取得するなど、プログラムの不具合を利用した不正行為（不具合を利用していると当社が判断した行為を含みます）\n(19) リアルマネートレード（RMT）及びこれに類する行為\n(20) 犯罪行為又はこれに結びつく行為\n(21) 公序良俗又は法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に反する目的で本サービスを利用する行為\n(22) 広告宣伝、営業活動その他営利目的で本サービスを利用する行為\n(23) 異性との交際を目的として本サービスを利用する行為\n(24) 宗教活動及び類似する行為、宗教団体への勧誘行為\n(25) 政治活動及び類似する行為、政治団体への勧誘行為\n(26) 選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為\n(27) 他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為\n(28) わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為\n(29) 連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為\n(30) 無限連鎖講(ネズミ講)又はネットワークビジネス等の開設及びこれを勧誘する行為\n(31) 脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為\n(32) 反社会的勢力等への利益供与行為\n(33) 買春・売春を助長する投稿をする行為\n(34) 覚せい剤、麻薬等薬物の使用を助長する投稿をする行為\n(35) アダルト・性風俗産業関連の投稿をする行為\n(36) 自殺、自傷行為を助長する投稿をする行為\n(37) 著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をする行為\n(38) 未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をする行為\n(39) 本サービスと無関係な情報を著しい長文として投稿する行為\n(40) 異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿する行為\n(41) 本サービスの不具合又は不正行為に関する情報を投稿する行為\n(42) アカウントを複数作成する行為\n(43) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避する行為\n(44) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）\n(45) 他のお客様を他のサービスに勧誘または誘導する行為\n(46) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求する行為\n(47) 日本国外から本サービスを利用する行為\n(48) 当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しない行為。または当社からの協力要請に従わない行為\n(49) 本規約に違反すると認められる行為\n(50) 前各号に該当するおそれがあると当社が判断する行為および当社が不適切と判断した行為\n \n14.2 お客様が前項に違反して、本サービスの内容を改変し又は他のソフトウェアと結合した場合、その結果についての権利（著作権法第27条及び第28条所定の権利を含みます）は当社に帰属し、お客様は当該権利について、他者に対し、貸与、使用許諾等をしてはならないものとします。\n\n14.3 禁止行為が繰り返された場合、または悪質な禁止行為が一度でもなされた場合には、無期限のアカウント利用停止措置を含めた厳格な対応を行います。これらの対応が行われた場合であっても、当社はこれらの対応を行うに至った理由や経緯等も含め、お客様の個別の質問には回答しない場合があります。  \n \n14.4 お客様が無期限のアカウント利用停止措置を受けた場合、以後、お客様は本サービスを利用することは一切できません。その場合、本サービスの終了時を含め、本サービス専用通貨や他のデジタルアイテム等の現金への払戻しまたは金券等への交換はいたしません。\n \n\n15. 解除について\n\n15.1 お客様が本規約またはガイドラインに違反した場合または当社が別途提供する他のサービスにおいてその利用規約等に違反した場合には、当社は、何ら催告なしに本サービスにかかる契約を解除し、またはお客様に対する本サービスの提供を停止、中止もしくは終了することができます。なお、違反に該当するか否かは当社の判断によります。\n \n15.2 前項に基づき当社が契約を解除した場合においても、お客様は解除日を含むその日までに支払義務の生じた一切の債務について引き続き責任を負います。\n\n\n16. 免責について\n\n16.1 アカウントの利用停止措置、プレイデータの修正その他の本規約またはガイドラインに基づいて実施する当社の対応によって、お客様に何らかの影響が生じた場合においても、当社は当該影響につき責任（利用料金の返還または払戻しを行う責任を含みます。以下同じ。）を負いません。\n\n16.2 当社は、天災地変、社会的動乱、ストライキ、火災、停電、通信インフラの停止その他の当社の支配できない事由に起因してお客様に生じる影響について責任を負いません。\n\n16.3 当社は、本サービスおよび本サービス内で当社が提供する情報について、明示・黙示を問わずその完全性、正確性、商品性、特定目的のための適合性、非侵害性その他のいかなる保証（本サービスがいかなる環境下でも利用可能であること、お客様のプレイデータが反映されること、または本サービスに不具合もしくはエラーがないことに関する保証を含みます。）を行わず、また、責任を負いません。\n\n16.4 お客様のご利用端末の破損、データ消去、紛失、盗難、端末変更もしくは不具合、ご利用端末からのアンインストール、またはパスワードの公開、紛失もしくは忘却等（パスワードの不設定および設定の不備を含みます。）によって、お客様のアカウントの全部または一部が消失し、またはお客様がアカウントへアクセスできなくなった場合においても、当社は責任を負いません。\n\n16.5 当社は、お客様と第三者（他のお客様、決済事業者、本サービス内で表示される広告の広告事業者を含みます。）との間で生じた紛争には関知せず、一切の責任を負いません。また、当社は、第三者の投稿情報、サービス（本サービス内で表示される広告およびその広告の対象となるサービスを含みます。）または行為等について一切の責任を負いません。\n\n16.6 お客様は、本サービスを利用するにあたり、健全な生活環境を乱すような過度の利用を避け、また、お客様の周囲の状況に注意して安全に利用するよう心がけるものとします。当社は、社会通念上適切な範囲を逸脱する本サービスの利用、または本サービスの利用中における事故等によりお客様に生じた社会的、精神的、肉体的な損害について、責任を負いません。\n\n16.7 当社は、お客様に対して適宜情報提供やアドバイスを行うことがありますが、お客様は当該情報やアドバイスをお客様の責任において取扱うものとし、当社はその結果について責任を負いません。\n\n\n17. 損害賠償   \n\n17.1 本規約の他の定めにかかわらず、当社の責めに帰すべき事由（3.1項に定める本サービスの一時停止または中断による場合は含まれません）により有償コンテンツまたはお客様が有償で提供を受けた本サービス専用通貨に関してお客様が損害を被った場合、当社は、通常直接発生すると考えられる損害の範囲に限定し、当該損害が発生した日の属する月における、お客様の本サービス専用通貨購入額または有償コンテンツ相当額を上限として、当該損害を賠償する責任を負います。ただし、当社の故意または重大な過失に起因してお客様が損害を被った場合はこの限りではありません。\n \n17.2 お客様は、本規約またはガイドラインへの違反その他自己の責めに帰すべき事由により当社に損害を与えた場合、当社に対して当該損害を賠償する責任を負います。\n\n\n18. プライバシーポリシー\n\n18.1 当社は、本サービスを通じて当社が取得したお客様の個人情報を、別途定める「プライバシーポリシー」に基づき厳重に管理します。\n\n\n19. 本規約の変更について\n\n19.1 当社は、本規約の内容を随時変更できます。当社が本規約に何らかの変更を加える場合には、当該変更について事前に本サービスの公式サイトを通じて通知するものとし、変更後の規約は、本サービスの公式サイト内に掲示することによって効果が生じるものとします。お客様は、当社からの告知がなくても、本規約の内容を定期的に確認してください。\n\n19.2 お客様が本規約の内容に同意できない場合には、本サービスのご利用を直ちに中止してください。本規約の内容の変更後、お客様が本サービスのご利用を継続した場合、当社は当該変更をお客様が承諾したものとみなします。\n\n\n20. 権利不放棄\n\n20.1 本規約、ガイドラインおよび法令等に基づく権利を当社が行使しない場合であっても、そのことは当該権利の放棄とはならず、当社はかかる権利を依然として行使できます。\n\n\n21. 分離可能性\n\n21.1 本規約およびガイドラインの一部が法令等に基づき無効と判断された場合であっても、他の規定の有効性には影響しないものとします。\n\n\n22. 準拠法および合意管轄\n\n22.1 本サービス、本規約およびガイドラインは日本法を準拠法とし、これに従い解釈されるものとします。\n\n22.2 本サービス、本規約およびガイドラインに関連してお客様と当社との間で生じた紛争は、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n\n以上\n制定　2023年6月14日\n\n\n\n家庭用ゲーム機向け『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供する家庭用ゲーム機向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、この利用規約（以下、「本規約」といいます。）記載の一切の条件および本規約に組み込まれる追加条件が適用されます。かかる条件のうち一部でも同意できないものがある場合には、本サービスの利用はできません。\n\n本規約は、お客様と当社との間の契約であって、本規約が表示される家庭用ゲーム機向け『BLUE PROTOCOL』（以下、「本件ゲーム」といいます。）の利用に適用されます。なお、本件ゲームには、ゲームのマルチプレイヤー部分、オンライン部分およびダウンロード部分、ならびに紙媒体または電子媒体の関連ドキュメントおよびコンテンツも含まれますが、これらに限定されるものではありません。本規約はライセンス契約であって、本件ゲームまたはそのコピーの知的財産権をお客様に譲渡するものではありません。お客様と当社との間に他の製品またはサービスに関する別の契約がある場合においても、かかる契約の条件が本規約によって変更されることはありません。お客様は、本規約のいかなる部分も変更、追加または削除できません。\n\n本件ゲームの一部である特定の機能には、当社から提示される追加条件（料金、支払方法およびプロモーションに関する規則も含まれますが、これらに限定されるものではありません）が適用されることがあります。別段の記載がない限り、当該追加条件は、参照により本規約に組み込まれたことになります。本規約と何らかの追加条件との間に矛盾が生じた場合には、当該特定の機能については、追加条件が優先するものとします。\n\n1. プライバシー\n本件ゲームを通じて収集されるデータは、当社により日本において保持されます。詳しくは、当社のプライバシーポリシー（本規約の後に表示されます）をご確認ください。プライバシーポリシーでは、かかるデータの当社による収集、利用および開示の方法について説明がなされています。\n\n2. ライセンスの前提条件\n本規約において許諾されるライセンスは、以下に掲げる事項が前提条件となります。\n(1) お客様がご自身の法域における成人年齢に達しているか、お客様がご自身の法域における成人年齢に達していない場合には本規約および適用される一切の追加条件が適用されることについて、お客様の法定代理人（親権者等）による同意があること。\n(2) 本規約の一切の条件および適用される一切の追加条件について、お客様が同意しているとともにこれらを遵守していること。\n(3) お客様による本件ゲームの利用について、一定のセキュリティ措置の適用を受けること。これには、本件ゲームのシリアルコード登録、インターネットへの継続的アクセス、および一定のセキュリティ/デジタル権管理機能への同意も含まれますが、これらに限定されるものではありません。かかるセキュリティ措置への同意または遵守がなされなかった場合には、お客様による本件ゲームの利用が部分的または完全に損なわれることがあります。\n(4) お客様による本件ゲームの利用が、適用のある一切の現地法令、州法令、国内法令および外国法令に従ったものであること。\n(5) お客様による本件ゲームの利用の場所が、本件ゲームの動作環境として予定され有効にライセンス認証を経たオペレーティングシステムが動作しているローカルコンピューター（以下、「対象ハードウェア」といいます。）に限定されること。\n(6) お客様が、対象ハードウェアに適用される一切の条件（決済手続に関するプラットフォームの条件も含まれます）に同意済みであるとともにこれらを遵守していること。\n\n3. 限定的利用ライセンス\n(1) 本規約に従い、当社は、プラットフォーム利用規約（該当のものがある場合）で許可された範囲に限り、お客様の所有または管理する対象ハードウェア上で、お客様の居住国において、本規約の期間本件ゲームを利用するための非独占的、譲渡不可かつ限定的なライセンスをお客様に許諾します。本件ゲームの更新版、追加版および交換品も、本規約が適用されます。ただし、かかる更新版等に他のライセンス条件が付されている場合には、この限りではありません。\n(2) 上記内容は、本件ゲームについてのお客様の権利のすべてを定めたものです。本件ゲームについての権利のうち本規約においてお客様に明示的に付与されていない一切のものは、当社に留保されます。お客様は、次のいずれの行為についても、自ら行わず、いかなる第三者にも許可せず、いかなる第三者にも行わせないものとします。(i) 本件ゲームの配布、コピー、ライセンス、貸与または販売（本規約またはプラットフォーム利用規約により明示的に許可されたものを除きます）、(ii) お客様ご自身の私的な非商用利用以外を目的とした本件ゲームの利用、(iii) 本件ゲームのリバースエンジニアリング、逆コンパイル、逆アセンブル、またはソースコード抽出、(iv) 本件ゲームの修正、改変、または派生物作成、(v) 本件ゲームにおける著作権表示、商標表示その他の権利帰属表示の削除、改変または不明瞭化、(vi) 予定された目的以外での本件ゲームの利用、(vii) お客様の所有または管理していない対象ハードウェア上での本件ゲームの利用、(viii) 本件ゲームにおけるセキュリティ措置の回避またはその試み、または (ix) 本件ゲームのオンライン機能へのアクセス時におけるお客様の地域の不明瞭化または隠ぺい。\n\n4. 権利帰属\n本件ゲームならびに本件ゲーム内のまたは本件ゲームを通じて利用できる一切のコンテンツ（本規約に定めるユーザーコンテンツを除きます）および素材（当社のロゴ、一切のデザイン、テキスト、グラフィックス、写真、情報、データ、ソフトウェア、サウンドファイル、本件ゲーム通貨および本件仮想アイテムその他のファイル、ならびにこれらを選別または整理したものも含まれますが、これに限定されるものではありません）の権利は、当社またはそのライセンサーに帰属し、著作権その他の知的財産に関する法律および条約で保護されています。本規約におけるいかなる別段の規定にもかかわらず、お客様は、上記コンテンツおよび素材（本件ゲーム通貨および本件仮想アイテムも含まれますが、これらに限定されるものではありません）についてのいかなる権利または権原もお客様に帰属しないことに、同意しているものとします。\n\n5. 期間\n(1) 第2条に掲げられた前提条件をお客様が満たすことを条件として、本規約は、お客様が本件ゲームを利用する期間中、有効に存続するものとします。いずれの当事者も、理由の有無にかかわらず、合理的な事前通知により、いつでも本規約を解除できるものとします。お客様は、ご自身の保有、保管または管理する本件ゲームの一切のコピーを削除または破棄することにより、本規約を解除できるものとします。当社は、お客様による本件ゲームの利用の中止について、お客様および第三者のいずれに対しても、責任を負いません。\n(2) お客様による本規約への違反があった場合、当社は、自己の有する他のいかなる権利も制限することなく、本件ゲームについてのお客様に対するライセンスを即時に制限、停止または取り消す権利を有するものとします。\n(3) 本規約が終了した場合、(i) 本件ゲームについてのお客様へのライセンスは、即時に失効するものとし、(ii) お客様は、いかなる料金の返金も受ける権利を有しません。これには、未消化の料金（該当のものがある場合）も含まれます。ただし、適用法上の義務付けにより本件有償ゲーム通貨が返金対象となる場合は、この限りではありません。\n(4) 第3条(2)、第4条、第5条(4)、第8条、第9条、および第11条から第18条は、本規約の終了後も存続するものとします。\n\n6. 修正\n当社は、時期および理由の如何を問わず、その単独の裁量により、本規約を変更することができます。当社は、本規約に何らかの変更を加える場合には、当該変更について、事前に本サービスの公式サイトを通じて通知するものとします。お客様は、かかる変更の効力発生日後も本件ゲームの利用を継続することにより、変更後の本規約に同意したものとみなされます。\n\n7. 本件ゲームの修正\n当社は、合理的な事前通知により、本件ゲームまたはそのいかなる機能もしくは部分についても、一時的または永久的に修正しまたは中止することができます。なお、緊急事態または絶対的に必要な場合においては、かかる事前通知を要しないものとします。お客様は、本件ゲームまたはそのいかなる部分のいかなる修正、停止または中止についても当社が責任を負わないことに、同意しているものとします。\n\n8. お問い合せ\n(1) 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ窓口にて受け付けます。\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n9. 当社からの通知\n(1) 当社からお客様に対する通知は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n(2) お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n10. ゲーム内通貨および仮想アイテム\n(1) 当社は、次の機能をお客様に提供することがあります。(i) ゲーム内通貨を使用するための限定的ライセンスを購入する機能（当該ゲーム内通貨を、以下、「本件有償ゲーム通貨」といいます。）、(ii) 本件ゲームにおける特定のタスクの遂行によりゲーム内通貨を使用するための限定的ライセンスを獲得する機能（当該ゲーム内通貨と本件有償ゲーム通貨と合わせて、以下、「本件ゲーム通貨」といいます。）、および/または (iii) 本件ゲーム内で当社により提供される仮想物品およびサービス（以下、「本件仮想アイテム」といいます。）についての限定的ライセンスを獲得し、かつ/またはかかる限定的ライセンスを本件ゲーム通貨で購入する機能。当社は、かかるライセンスの購入または獲得の機能を提供する場合には、本規約に従い、お客様に対し、かかる本件ゲーム通貨または本件仮想アイテムをご自身の私的かつ非商用的な用途に使用するための非独占的、譲渡不可、取消可能かつ限定的な権利およびライセンスを許諾するものとします。\n(2) 本件ゲーム通貨によって引き換えることのできるものは、本件ゲーム内で使用できる本件仮想アイテムに限られます。本件ゲーム通貨および本件仮想アイテムは、当社その他のいかなる者によっても、金銭、金銭的価値を有するものまたは金銭等価物へと引き換えることはできません。ただし、適用法による別段の義務付けがある場合は、この限りではありません。本件ゲーム通貨および本件仮想アイテムは、現実通貨と等価値を有するものではなく、現実通貨の代替となるものでもありません。当社その他のいかなる者も、本件ゲーム通貨または本件仮想アイテムについて、有価物（現実通貨も含みます）への引換えの義務を負いません。お客様は、本件ゲーム通貨または本件仮想アイテムのゲーム内における性質または価値に対し影響を及ぼすおそれのある措置（適用法上禁止されているものを除きます）が当社によりいかなる時点であれ講じられることについて、確認し同意しているものとします。当社は、その単独の裁量により、本件ゲーム通貨の購入量、獲得量または引換量に制限を加えることができるものとします。\n(3) 本件有償ゲーム通貨のいかなる購入も、確定的なものであって、状況の如何を問わず返金不可、譲渡不可かつ交換不可となります。ただし、適用法による別段の義務付けがある場合は、この限りではありません。本件有償ゲーム通貨および一定の本件仮想アイテムの購入価格を除き、当社は、本件ゲーム通貨または本件仮想アイテムのアクセス、使用または不使用について課金をすることはありません。\n(4) お客様による本件ゲーム通貨または本件仮想アイテムの譲渡、売却、贈与、交換、取引、リース、再許諾または貸借は、いずれも禁止されています。ただし、本件ゲーム内において、かつ当社により明示的に許可されている場合については、この限りではありません。本規約における別段の合意がある場合を除き、本件ゲーム通貨および本件仮想アイテムについての権利および権原は、当社に留保されます。\n(5) 本件ゲーム通貨および本件仮想アイテムについて本規約で許諾されるライセンスは、第5条に基づく本規約の終了時に失効するものとします。ただし、本規約に別段の定めがある場合は、この限りではありません。\n(6) 別途「資金決済に関する法律に基づく表示」にて表示される本件有償ゲーム通貨は、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます。）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n(7) 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n(8) 本件ゲーム通貨または本件仮想アイテムの販売価格は購入ページをご覧ください。\n(9) お客様が未成年者である場合には、本件ゲーム通貨または本件仮想アイテムの購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n(10) お客様が取得した本件ゲーム通貨または本件仮想アイテムは本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n(11) 本件ゲーム通貨の有効期限は、お客様が当該本件ゲーム通貨を購入した月を含む5か月目の末日23:59までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n(12) 本件ゲーム通貨および本件仮想アイテムの価格、仕様の変更、販売の終了は当社の任意とします。\n(13) 本件ゲーム通貨および本件仮想アイテムの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n(14) 本サービスにおける本件仮想アイテムのゲーム内表現は、本サービスと配信ストアが異なるサービスにおけるゲーム内表現とは、当該サービスが本サービスと同一名称であっても、一部異なる場合があります。詳細は公式サイトをご確認ください。\n\n11. ユーザーコンテンツ\n何らかの通信、情報、知的財産、素材、メッセージ、写真、グラフィックス、動画、URLその他の事項またはコンテンツを本件ゲームに投稿すること（投稿された当該コンテンツ等を以下、「ユーザーコンテンツ」といいます）により、適用法上許容される限りにおいて、お客様は、ご自身へのさらなる通知または対価のいずれもなしに、知的財産権が存続する全期間にわたり、本件ゲームならびにこれに関する物品およびサービスに関連してユーザーコンテンツを利用するための非独占的、無償、譲渡可能かつ再許諾可能の全世界におけるライセンスを、本規約により当社に対し許諾したことになります。これには、既知であるか今後考案されるかを問わずあらゆる方法および媒体による複製、複写、翻案、修正、実施、派生物作成、表示、公表、放映、送信その他の方法による利用、配布、活用および公開の権利も含まれます。適用法上許容される限りにおいて、お客様は、当社および第三者によるユーザーコンテンツの利用について、著作者人格権および実演家人格権を行使しないものとします。当社に許諾されたライセンスは、本規約の終了または取消しの後においても、存続するものとします。\n\n12. オンライン上の行為\n当社の故意または重過失による場合を除き、当社は、いかなるユーザーの行為についても、それが本件ゲームの利用に関係するか否かにかかわらず、何らの責任も負いません。当社は、お客様が本条の規定その他本規約の何らかの条件に違反した場合には、いつでもお客様による本件ゲームの利用権を停止しまたは失効させることができるものとします。当社は、本件ゲームにおいてアップロード、公表、保存または表示（総称して以下、「投稿」といいます。）されたいかなるユーザーコンテンツについても、（たとえば著作権者からの請求に対する対応として）審査することができるものとします。ただし、本件ゲーム内のプライベートメッセージの一部としてシェアされたユーザーコンテンツについては、当社は、少なくとも当該通信の一方からその内容が（たとえば、好ましくないメッセージとして当社への通報により）提出された場合を除き、その内容のスクリーニングまたは審査のいずれも実施しません。当社は、いかなるユーザーコンテンツについても、削除する権利およびオンライン化を拒否する権利を有します。当社は、本件ゲームに投稿されたユーザーコンテンツのいずれについても、日常的にスクリーニング、編集または監視を行うわけではありません。ただし、当社は、本件ゲームを通じて投稿されたいかなるユーザーコンテンツについても、それが本規約に違反し、第三者の権利を侵害し、かつ/または適用のある法律、規則もしくは規制に違反するとの判断を自己の合理的裁量により下した場合には、削除、スクリーニングまたは編集を行うことができるとともに、かかる措置について絶対的裁量を有するものとします。お客様は、本件ゲームについて過去に利用停止処分または退会処分を受けたことがある場合には、本件ゲームを利用することができません。お客様は、自らが投稿しまたはユーザーもしくは第三者に送信した一切のユーザーコンテンツについて、単独で責任を負うものとします。とりわけ、お客様は、本件ゲームに関連して以下のいずれの行為についても、自ら行わないこと、試みないこと、かつ他者に行わせないことについて、同意しているものとします。\n(1) 不法、誹謗、中傷、不快、わいせつ、卑猥、下品、低俗、淫ら、露骨な性表現、いやがらせ、脅迫、プライバシー権侵害、パブリシティ権侵害、悪態、扇動もしくは詐欺に当たるユーザーコンテンツ、不法、買春・売春、覚せい剤、麻薬等薬物の使用、自殺、自傷行為その他の反社会的な行為（ハッキングも含まれます）を助長しもしくは促進するユーザーコンテンツ、何らかの集団もしくは個人に対する人種差別、偏見、物理的危害その他の危害を助長するユーザーコンテンツまたは他の何らかの点で好ましくないユーザーコンテンツを投稿すること。\n(2) 他者の特許権、商標権、営業秘密、著作権その他の知的財産権または財産権を侵害するまたはそのおそれのあるユーザーコンテンツを投稿すること。\n(3) 著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をすること。\n(4) 未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をすること。\n(5) 本サービスと無関係な情報を著しい長文として投稿すること。\n(6) 異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿すること。\n(7) 本サービスの不具合又は不正行為に関する情報を投稿すること。\n(8) 当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為を行うこと。\n(9) 商業的活動または商取引（商業目的の広告または勧誘の送信も含まれます）に関与すること。\n(10) いかなる者（ご自身も含まれます）に関するものであれ、氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報を入力、開示、投稿または配布すること並びにニックネームに本名を登録すること。\n(11) 他者（当社の役員、フォーラムリーダー、ガイド、ホスト、従業員または代理人も含まれます）になりすますこと、またはお客様と他者との関係性について詐称しその他何らかの方法で不実の表示をすること又は他の登録会員のパスワ－ドを不正に使用すること。\n(12) 本件ゲーム、その通常のプレイもしくは会話の流れを妨害もしくは阻害し、または下品な言葉、ののしり、過剰な叫び声（全部大文字など）、スパム行為もしくは本件ゲームの他のユーザーを害する他の何らかの妨害的もしくは有害な方法を用いること。\n(13) バグ、エラーその他の設計上の瑕疵を利用することにより、本件ゲームに対する不正なアクセス権を取得し、他のプレイヤーとの関係で不当に有利な状況を獲得し、または本件ゲームに関連してチート行為もしくは不正利用を行うこと。かかる行為には、本件ゲームのうちアクセス権限を有しない部分にアクセスすること、またはボット、エミュレーターその他の不正な第三者のツールを用いることも含まれますが、これらに限定されるものではありません。\n(14) 本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為を行うこと。\n(15) 本サービスのデータを改ざん又は不正に作成すること。\n(16) 本サービスの利用を阻害する情報を登録すること。\n(17) 本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為を行うこと。\n(18) 本サービスの提供を妨げる行為または誹謗する行為を行うこと。\n(19) リアルマネートレード（RMT）及びこれに類する行為を行うこと。\n(20) 犯罪行為又はこれに結びつく行為を行うこと。\n(21) 異性との交際を目的として本サービスを利用すること。\n(22) 宗教活動及び類似する行為、宗教団体への勧誘行為を行うこと。\n(23) 政治活動及び類似する行為、政治団体への勧誘行為を行うこと。\n(24) 選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為を行うこと。\n(25) 他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為を行うこと。\n(26) わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為を行うこと。\n(27) 連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為を行うこと。\n(28) 無限連鎖講(ネズミ講) 又はネットワークビジネス等の開設及びこれを勧誘する行為を行うこと。\n(29) 脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為を行うこと。\n(30) 反社会的勢力等への利益供与行為を行うこと。\n(31) アカウントを複数作成すること。\n(32) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避すること。\n(33) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）を行うこと。\n(34) 他のお客様を他のサービスに勧誘または誘導すること。\n(35) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求すること。\n(36) 日本国外から本サービスを利用すること。\n(37) 当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しないこと。または当社からの協力要請に従わないこと。\n(38) 本件ゲームのルールに則った他のユーザーによる本件ゲームのプレイの享受を妨害することとなる行為、または当該プレイの享受のための本件ゲームの維持に際して当社もしくはプラットフォームプロバイダーにおける費用その他の負担を増加させることとなる行為をすること。\n(39) 自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用して本サービスの利用をすること、及び当該利用を勧奨すること。\n(40) 有害なコンピュータ・プログラム等を公衆送信、頒布又は使用すること。\n(41) 本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為を行うこと。\n(42) 虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為を行うこと。\n(43) 本サービスに関する当社が未公表の情報を、当社以外の第三者に公開すること。オンラインプレイ中に意図的にネットワークを切断すること、または他の一定のプレイヤーに繰り返し負けることで当該プレイヤーのランキングの上昇もしくは本件ゲーム内でのカウント獲得を助けること。\n(44) 本件仮想アイテムまたは本件ゲーム通貨について、本件ゲーム外において取引、売却、オークションその他の譲渡を行うかまたは譲渡を試みること。\n(45) 本サービスの利用方法として予め想定又は許容される行為以外の行為を行うこと。\n(46) 上記のほか、本規約の規定その他当社から告知されたポリシーに違反するか、または当社に責任を負わせること。\n\n13. 第三者のコンテンツ\n本件ゲームを通じ、ユーザー、広告主その他の第三者のコンテンツがお客様に提供されることがあります。当社は、当該第三者のコンテンツを管理しておりません。そのため、お客様は、当社の故意または重過失による場合を除き、いかなる第三者のコンテンツについても当社が責任を負わないこと、第三者のコンテンツに含まれる情報の正確性または品質のいずれに関しても当社が保証しないこと、また第三者のコンテンツのうち意図しないもの、好ましくないもの、不正確なもの、誤解を招くものまたは不法なもののいずれについても当社が責任を負わないことに、同意しているものとします。商号、商標、メーカー、サプライヤーその他によるいかなる製品、サービス、プロセスその他の情報についての言及も、これらについて当社による是認、後援もしくは推奨または提携関係を意味するものではなく、これらを黙示するものでもありません。ただし、当社による明示がある場合は、この限りではありません。\n\n14. 免責事項\nお客様は、お客様による本件ゲームのアクセスもしくは利用に影響を及ぼすウイルスその他の無効化機能、または本件ゲーム、他のサービスおよび対象ハードウェアの間における互換性の欠如のいずれについても、当社ならびにそのライセンサーおよびサプライヤーが責任を負わないことを、確認し同意しているものとします。本件ゲームその他の一切のサービスは、「現状有姿」で提供されます。本規約に定めのある場合を除き、当社ならびにそのライセンサーおよびサプライヤーは、いかなる種類の保証（明示または黙示を問わず、法律その他のいかなる根拠によるものであるかも問いません）もしません。これには、非侵害、商品性または特定目的への適合性に関する黙示的保証も含まれますが、これらに限定されるものではありません。\n法域によっては、消費者契約における黙示的条件の否認または保証もしくは担保の排除もしくは制限が許されていないことから、本条における免責事項の一部または全部がお客様に適用されないことがあります。\n\n15. インターネット\nお客様は、本件ゲームに関連する通信または処理の開始、実施または完了に関する正確性、適時性、遅延または不具合について、当社がいかなる責任も負わない旨を、確認し同意しているものとします。また、当社は、本件ゲームのオンライン部分、マルチプレイヤー部分またはダウンロード部分について、お客様の希望する時点でお客様によるアクセスが可能である旨の約束または保証をすることもありません。本件ゲームの当該部分にアクセスできない状況が長期間にわたって生じることもあります。当社は、本件ゲームの当該部分のいずれの動作についても、中断がないこと、エラーがないこと、セキュアであることまたはウイルスが含まれないことのいずれも保証せず、サーバの動作継続または可用性についても保証しません。\n\n16. 責任の制限\n次に掲げるものを除き、いかなる場合も、当社またはその子会社、関係会社、役員、従業員、代理人その他のパートナーおよびサプライヤーは、本件ゲームの利用もしくは利用不能、本件ゲームに含まれているかもしくは本件ゲームを通じてアクセスするコンテンツの利用もしくは利用不能、またはサポートサービスの不提供に起因する間接損害、特別損害、派生的損害または懲罰的損害賠償その他利用機会の喪失または逸失利益など（これらに限定されるものではありません）のいかなる損害についても、それが契約、不法行為（過失も含まれます）その他のいかなる根拠による訴えであるかを問わず、責任を負いません。(1) 当社の過失に起因する死亡または人身傷害、(2) 当社による詐欺または欺まん的不実表示、(3) 当社による故意または重過失、(4) 本件ゲームの利用に起因する有形動産の滅失または損傷、および (5) 他の何らかの責任のうちその制限または排除が適用法上許されないもの。当社による軽過失、通常の過失または本規約に基づく主要な義務の違反の場合、当社の責任は、お客様に生じた予見可能な直接損害に限定されるものとします。いかなる場合も、本件ゲームの利用もしくは利用不能または本規約に起因または関連する当社の責任の総額は、契約、保証、過失、製造物責任、厳格責任、知的財産侵害その他のいかなる理論に基づくものであるかを問わず、100ドル、またはこれを上回る場合においてはお客様による本件ゲームの利用のためにお客様から当社に支払われた金額を上限とします。本条は、お客様の居住法域における法律上で契約による制限が許されていないいかなる強制的または法定の保証も、制限するものではありません。\n\n17. 準拠法\n適用法上の義務付けがある限りにおいて、本規約の一切の条件および条項は、本条に定める準拠法と矛盾する場合といえども、適用のあるすべての強行法規に準拠し、かかる法規に従って解釈されるものとします。いかなる場合も、本条において企図された準拠法に基づく本規約の条件の適用、解釈または執行により、適用のある消費者保護法に基づき消費者たるお客様に付与された何らかの権利について、排除、制限その他の限定がなされることはありません。お客様の行為は、現地法、州法、国内法および国際法の適用を受けることもありますので、その旨ご留意ください。各当事者は、本規約に起因するいかなる紛争または取引にも国際物品売買契約に関する国際連合条約が適用されない旨に、合意しているものとします。\n本規約に起因または関連する両当事者間のいかなる紛争も、本規約および日本法に準拠するものとします。\n\n18. 裁判地\n本規約に起因または関連する当事者間のいかなる紛争も、東京地方裁判所において解決されるものとし、お客様および当社は、同裁判所の専属的裁判管轄権に服することについて、合意しているものとします。\n\n19. 第三受益者\n本条で後述する場合を除き、本規約の当事者以外の人その他の法主体は、いかなる法律においてであれ、本規約のいかなる規定も行使する権利を有しません。これは、かかる人その他の法主体の名指しがある場合においても、同様とします。\nただし、対象ハードウェアとしてPlayStationを使用するお客様には、以下が適用されます。\nお客様は、株式会社ソニー・インタラクティブエンタテインメント（以下、「SIE」といいます。）が本規約の第三受益者である旨、また、本規約の条件へのお客様の同意によりSIEが第三受益者としてお客様に対し本規約を行使する権利を有することとなる旨について、確認し同意しているものとします。\n\n20. 雑則\n本規約は、本件ゲームの利用に関してお客様と当社との間の合意内容のすべてを余すところなく記載したものです。本規約の何らかの条項が無効または執行不能と判断された場合においても、当該条項により本規約の重要な部分が本規約から失われることとなる場合を除き、本規約の残余部分は、その残余期間その他第5条(4)に記載の期間にわたり、引き続き完全な効力を有するものとします。お客様は、当社の書面による事前同意を得ない限り、本規約または本規約に基づく自己の権利のいずれも、譲渡することはできません。かかる同意を得ることなく試みられたいかなる譲渡も、無効とします。上述の制約内容を条件として、本規約は、当社およびその各々の承継人および譲受人に対し完全な拘束力を有し、これらの者の利益のために効力を生じ、かつこれらの者により行使できるものとします。本規約における何らかの権利または条項について当社による行使または履行強制がなされなかった場合においても、当該権利または条項が放棄されたことにはなりません。本規約の条文見出しは、便宜のみを目的とするものであって、何らの法律上または契約上の効果も有しないものとします。\n\n制定　2023年12月6日\n\n\n\n『BLUE PROTOCOL』(以下「本サービス」といいます)にはユーザー同士の情報交換に利用できるチャット機能がございます。\n利用規約および以下のチャットサービスに関する注意事項の内容を確認し、同意したうえでチャットサービスをご利用ください。\nお客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本注意事項を確認し、法定代理人の同意を得てから本注意事項に同意してください。  \n\n■チャットサービスに関する注意事項\n● 利用規約および本注意事項に従ってチャットサービスをご利用ください。\n\n● 株式会社バンダイナムコオンライン(以下「当社」といいます)はお客様と他のお客様または第三者との間で生じた紛争には関知いたしません。また、お客様の投稿情報に関する責任はお客様が負うものとし、当社は責任を負いません。\n\n● 以下に掲げる行為または該当するおそれのある行為は禁止しています。\n(1) 犯罪的行為または公序良俗に反する行為\n(2) 当社または第三者の財産、名誉、プライバシー等の権利を侵害する行為（本名、メールアドレス、電話番号などの個人情報や個人の特定につながる情報を投稿する行為を含む）  \n(3) 不適切な表現行為または虚偽の情報を提供する行為\n(4) 本サービスまたはチャットサービスを不正な目的で利用する行為\n(5) 本サービスまたはチャットサービスの提供を妨げる行為または誹謗する行為\n(6) 本サービスまたはチャットサービスの内容を転載、複製、修正、蓄積または転送する行為\n(7) 本サービスまたはチャットサービスを利用した営利行為\n(8) 他のお客様による本サービスもしくはチャットサービスの利用を妨害し、または当該利用に支障をきたす行為\n(9) 第三者に迷惑を及ぼす行為または不快感を与える行為\n(10) 利用規約に違反する行為または法令に違反する行為\n(11) その他当社が不適切と判断する行為\n\n● お客様の投稿情報は、不特定多数の方が閲覧することがあります。また、チャットサービスの適正な運営のために、当社および運営会社がお客様の投稿情報を閲覧することがあります。\n\n● お客様が利用規約および本注意事項に違反する投稿等をした場合、又は、当社が必要と判断した場合、当社は、当社の判断により、お客様に対して事前に通知することなく、投稿情報の削除、チャットサービスの利用停止、本サービスの利用停止、本サービスの利用契約の解除その他の必要な措置、または必要に応じて政府機関その他の第三者に対する開示を行うことができます。\n\n● 当社は、お客様の投稿情報について監視、変更・削除等の措置を行う義務を負いません。また、当社がお客様の投稿情報について変更・削除等の措置を行った場合であっても、当社は、当該措置を行うに至った理由および経緯の説明はいたしません。\n\n以上\n\n制定　2023年1月10日",
        "sort_id": 1
    },
    {
        "id": 4,
        "term_id": 1,
        "type": 1,
        "revision": 2,
        "platform": 3,
        "lang": "ja_JP",
        "title": "『BLUE PROTOCOL』利用規約/チャットサービスに関する注意事項",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』利用規約\n株式会社バンダイナムコオンラインが日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』及び家庭用ゲーム機向けオンラインゲームサービス 『BLUE PROTOCOL』の利用にあたっては、当社が定める以下の事項が適用されます。該当する利用規約をよくお読みください。\n\n\nPC向け『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供するPC向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、当社が定める以下の事項が適用されます。\n本サービスに係るガイドライン、各種取り決め、取引条件の表示、利用上の注意等（以下「ガイドライン」といいます）は、本規約の解釈を示し、または本規約の一部を構成するものとなります。また、ガイドラインと本規約の規定内容が矛盾抵触する場合には、ガイドラインが優先して適用されます。\n本サービスのご利用にあたっては、関連する第三者との契約または規約等、例えば決済事業者が定める各種規約についても遵守していただく必要があります。\n\n\n1. 未成年者による利用について\n\n1.1 お客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本規約を確認し、法定代理人の同意を得てから本規約に同意してください。また、本サービスに含まれる有償のコンテンツ（以下、「有償コンテンツ」といいます。）を利用する場合についても、必ず法定代理人の同意を得てから利用してください。\n\n1.2 未成年のお客様が、法定代理人の同意がないにもかかわらず同意があると偽って本サービスを利用した場合、年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合には、その未成年のお客様またはその法定代理人は、本サービスにおける一切の法律行為を取消すことができません。\n\n1.3 本規約に同意した時点で未成年であったお客様が、成年に達した後に本サービスを利用した場合、未成年であった間の利用行為を追認したものとみなされます。\n\n1.4 当社は、お客様の年齢に応じて、本サービスの全部または一部の利用を制限する場合があります。制限の対象および内容は、本サービス内で別途お知らせします。\n\n\n2. 本サービスについて\n\n2.1 本サービスのご利用にあたっては、バンダイナムコIDの会員登録が必要です。\n\n2.2 お客様は、日本国内でのみ本サービスをご利用いただけます。\n\n2.3 本サービスはインターネットに接続できる環境でご利用ください。なお、本サービスは無料でプレイできますが、通信料等はお客様のご負担となります。\n\n\n3. 本サービスの停止・プレイデータのリセットについて\n\n3.1 メンテナンス、不具合またはネットワーク障害により、予告なく一時停止または中断が発生する場合があります。\n\n3.2 当社は、前項に定める本サービスの一時停止または中断によりお客様に損害が生じた場合であっても、いかなる責任も負わないものとします。 \n\n\n4. お問い合わせ\n\n4.1 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ 窓口にて受け付けます。\n\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n5. 当社からの通知\n\n5.1 当社からお客様に対する通知は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n\n5.2 お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n\n6. アカウント\n\n6.1 お客様は、本サービスに関するお客様のアカウント（プレイデータおよびパスワードを含み、以下「アカウント」といいます。）を適切に管理するものとし、その利用および管理について一切の責任を負うものとします。また、本サービスと連携するサービスのアカウントについても同様とします。\n\n6.2 本サービスおよびアカウントは、当社がお客様に非独占的に利用を許諾しているものであり、お客様は当社が定めた利用範囲内に限りこれらを利用することができます。\n\n6.3 当社は、お客様のアカウントを利用して行われた本サービスの利用をお客様による利用とみなすことができます。また、アカウントの正当な利用者が不明な場合、当社は、当該アカウントを実際に利用している方をアカウントの正当な利用者とみなすことができます。なお、お客様のアカウントに関して生じた利用料金支払債務その他一切の債務は、お客様が負担するものとします。\n\n6.4 別途当社が定める期間  （定めがない場合には1年間）にわたりお客様による本サービスの利用実態がない場合、当社はお客様のアカウントの全部または一部を消去することができます。\n \n\n7. プレイデータ\n\n7.1 お客様は、アカウントまたはそれに含まれるゲーム内通貨、デジタルアイテム、ユーザー名、レベル、ランク、ステータス、称号その他のプレイデータ（以下「プレイデータ」といいます。）に関して所有権、知的財産権その他の権利を取得することはありません。また、プレイデータは、当社が権利を有しお客様に非独占的に許諾するデジタルデータに過ぎず、法令にて定められている場合を除き有償で提供されたものを含めいかなる金銭的価値を有しません。\n \n7.2 お客様が利用されているプレイデータの内容または数量が、本サービスのご利用状況と比較して誤っていることが判明した場合、当社は、お客様に対して事前に通知することなくこれを修正することができます。\n \n7.3 お客様のプレイデータに含まれるユーザー名、レベル、ランク、ステータス、称号等は、本サービス内において他のお客様に公開されることがあります。\n\n\n8. バンダイナムコIDの利用\n\n8.１ 本サービスは、バンダイナムコIDを用いてデータ管理等を行っており、本サービスの利用に際しては、バンダイナムコIDを取得していただく必要があります。\n\n8.2 お客様が複数のバンダイナムコIDを保有されている場合であっても、本サービスにおいて２以上のバンダイナムコIDを利用いただくことはできません。\n\n8.3 お客様のバンダイナムコIDサービスの会員資格が失効となった場合、またはお客様がバンダイナムコIDサービスの会員登録を解除した場合、本サービスは一切利用できません。また、一度バンダイナムコIDサービスの会員資格が失効となり、または会員登録を解除しますと、サービス内データ（※）は一切復元できません。\n（※）「サービス内データ」とは、バンダイナムコIDに関連付ける形で記録・蓄積された本サービスにおける一切の情報（有償無償を問わず本サービス内で入手した全てのコンテンツおよびプレイデータ、ならびに本サービス内でお客様が投稿した文字、画像等の情報を含みます）をいいます。\n\n8.4   バンダイナムコIDに関するお問い合わせは、下記連絡先よりお問い合わせください。\n＜バンダイナムコIDお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n\n9. 有償サービス\n\n9.1 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n\n9.2 当社は、有償で発行する本サービス専用のゲーム内通貨（以下、「本サービス専用通貨」といいます。）をお客様に提供することがあります。\n\n9.3 本サービス専用通貨の販売価格は購入ページをご覧ください。\n\n9.4 お客様が未成年者である場合には、本サービス専用通貨の購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n\n9.5 お客様が取得した本サービス専用通貨は本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n\n9.6 本サービス専用通貨の有効期限は、お客様が当該本サービス専用通貨を購入した月を含む5か月目の末日23:59までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n\n9.7 本サービス専用通貨および有償コンテンツの価格、仕様の変更、販売の終了は当社の任意とします。\n\n9.8 当社は、法令にて定められている場合を除き、本サービス専用通貨および有償コンテンツの現金・金券等への払い戻し・交換はいたしません。\n\n9.9 お客様は、第三者に対する本サービス専用通貨の譲渡、貸与、共有等はできません。また、当社所定の方法にて行う場合を除き、第三者に対する有償コンテンツの譲渡、貸与、共有等もできません。\n\n9.10 別途当社が「資金決済に関する法律に基づく表示」と題するページに前払式支払手段としてコンテンツを表示する場合、当該コンテンツは、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n\n9.11 有償コンテンツの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n\n\n10. サービスの変更について\n\n10.1 当社は、お客様への予告を行うことなく、本サービス、アカウントまたはプレイデータ（本サービス専用通貨および有償コンテンツを含みます。）の内容、仕様および価格等を変更することができます。なお、当該変更により、お客様が購入した有償コンテンツの性能、効果または有用性等に変更が生じることがあります。\n\n10.2 当社は、お客様への予告を行うことなく、本サービスの提供を停止、中止または終了することがあります。\n\n\n11. 権利について\n\n11.1 本サービス（本サービスに含まれる発明、考案、意匠、商標、標章、画像、映像、文章、プログラムその他の一切の情報等を含みます。）に係る知的財産権その他の一切の権利は、当社または当社がその利用の許諾を得ている第三者に帰属します。\n\n11.2 お客様は、本サービスに関して当社とお客様の間で生じたいかなる権利または義務を、貸与、交換、譲渡、売買もしくは質入してはならず、また、方法を問わず第三者に利用させてはならないものとします。また、お客様は当該権利義務またはアカウントを他のお客様その他の第三者に相続することはできません。\n\n\n12. 情報の取扱いについて\n\n12.1 本サービスを通じてお客様からいただいたコメント、フィードバック、不具合等の報告、プレイデータ等、本サービスを利用したことにより発生する情報等に関する一切の権利は当社に帰属し、今後のゲーム開発および運営に活用いたします。\n\n12.2 当社は、本サービスの分析および改善を目的として、お客様のハードウェア、ソフトウェアその他利用環境に関する情報を、お客様の個別の同意を得ることなく自動取得できるものとします。\n\n\n13. 著作物の利用について\n\n13.1 本サービスのゲームプレイを撮影した画像・動画のインターネット上の利用に関しましては、 当社が定める「BLUE PROTOCOL 著作物利用ガイドライン」をお守りください。\n\n\n14. 禁止事項について   \n\n14.1 以下に該当する行為または該当するおそれのある行為を一切行ってはなりません。当社が当該行為を確認した場合、お客様に対し事前に通知することなく本サービスの機能制限、プレイデータの修正（本サービス専用通貨および有償コンテンツ等の抹消を含みます。）またはアカウント停止等の措置を行います。なお、当該行為に該当するか否かは、当社の判断によります。\n(1) 複数のバンダイナムコIDを利用する行為\n(2) お客様のバンダイナムコIDを第三者に開示または使用させる行為\n(3) 他人（家族を含みます）になりすます行為、当社及び当社関連会社・本サービスの関係者になりすます行為、又は他の登録会員のパスワ－ドを不正に使用する行為\n(4) 氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報（自分のもの他人のものかは問いません）を投稿する行為並びにニックネームに本名を登録する行為\n(5) 当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為\n(6) 当社及び当社関連会社、又は第三者を差別又は誹謗中傷し、名誉や信用を毀損する行為\n(7) 本サービスのデータを改ざん又は不正に作成する行為\n(8) 本サービスの利用を阻害する情報を登録する行為\n(9) 本サービスの利用方法として予め想定又は許容される行為以外の行為\n(10) 自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用した本サービスの利用及び勧奨する行為\n(11) 有害なコンピュータ・プログラム等を公衆送信、頒布又は使用する行為\n(12) 本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為\n(13) 虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為\n(14) 本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為\n(15) 本サービスの提供を妨げる行為または誹謗する行為\n(16) 本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為\n(17) 本サービスに関する当社が未公表の情報を、当社以外の第三者に公開する行為\n(18) アイテムを不正に取得するなど、プログラムの不具合を利用した不正行為（不具合を利用していると当社が判断した行為を含みます）\n(19) リアルマネートレード（RMT）及びこれに類する行為\n(20) 犯罪行為又はこれに結びつく行為\n(21) 公序良俗又は法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に反する目的で本サービスを利用する行為\n(22) 広告宣伝、営業活動その他営利目的で本サービスを利用する行為\n(23) 異性との交際を目的として本サービスを利用する行為\n(24) 宗教活動及び類似する行為、宗教団体への勧誘行為\n(25) 政治活動及び類似する行為、政治団体への勧誘行為\n(26) 選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為\n(27) 他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為\n(28) わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為\n(29) 連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為\n(30) 無限連鎖講(ネズミ講)又はネットワークビジネス等の開設及びこれを勧誘する行為\n(31) 脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為\n(32) 反社会的勢力等への利益供与行為\n(33) 買春・売春を助長する投稿をする行為\n(34) 覚せい剤、麻薬等薬物の使用を助長する投稿をする行為\n(35) アダルト・性風俗産業関連の投稿をする行為\n(36) 自殺、自傷行為を助長する投稿をする行為\n(37) 著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をする行為\n(38) 未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をする行為\n(39) 本サービスと無関係な情報を著しい長文として投稿する行為\n(40) 異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿する行為\n(41) 本サービスの不具合又は不正行為に関する情報を投稿する行為\n(42) アカウントを複数作成する行為\n(43) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避する行為\n(44) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）\n(45) 他のお客様を他のサービスに勧誘または誘導する行為\n(46) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求する行為\n(47) 日本国外から本サービスを利用する行為\n(48) 当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しない行為。または当社からの協力要請に従わない行為\n(49) 本規約に違反すると認められる行為\n(50) 前各号に該当するおそれがあると当社が判断する行為および当社が不適切と判断した行為\n \n14.2 お客様が前項に違反して、本サービスの内容を改変し又は他のソフトウェアと結合した場合、その結果についての権利（著作権法第27条及び第28条所定の権利を含みます）は当社に帰属し、お客様は当該権利について、他者に対し、貸与、使用許諾等をしてはならないものとします。\n\n14.3 禁止行為が繰り返された場合、または悪質な禁止行為が一度でもなされた場合には、無期限のアカウント利用停止措置を含めた厳格な対応を行います。これらの対応が行われた場合であっても、当社はこれらの対応を行うに至った理由や経緯等も含め、お客様の個別の質問には回答しない場合があります。  \n \n14.4 お客様が無期限のアカウント利用停止措置を受けた場合、以後、お客様は本サービスを利用することは一切できません。その場合、本サービスの終了時を含め、本サービス専用通貨や他のデジタルアイテム等の現金への払戻しまたは金券等への交換はいたしません。\n \n\n15. 解除について\n\n15.1 お客様が本規約またはガイドラインに違反した場合または当社が別途提供する他のサービスにおいてその利用規約等に違反した場合には、当社は、何ら催告なしに本サービスにかかる契約を解除し、またはお客様に対する本サービスの提供を停止、中止もしくは終了することができます。なお、違反に該当するか否かは当社の判断によります。\n \n15.2 前項に基づき当社が契約を解除した場合においても、お客様は解除日を含むその日までに支払義務の生じた一切の債務について引き続き責任を負います。\n\n\n16. 免責について\n\n16.1 アカウントの利用停止措置、プレイデータの修正その他の本規約またはガイドラインに基づいて実施する当社の対応によって、お客様に何らかの影響が生じた場合においても、当社は当該影響につき責任（利用料金の返還または払戻しを行う責任を含みます。以下同じ。）を負いません。\n\n16.2 当社は、天災地変、社会的動乱、ストライキ、火災、停電、通信インフラの停止その他の当社の支配できない事由に起因してお客様に生じる影響について責任を負いません。\n\n16.3 当社は、本サービスおよび本サービス内で当社が提供する情報について、明示・黙示を問わずその完全性、正確性、商品性、特定目的のための適合性、非侵害性その他のいかなる保証（本サービスがいかなる環境下でも利用可能であること、お客様のプレイデータが反映されること、または本サービスに不具合もしくはエラーがないことに関する保証を含みます。）を行わず、また、責任を負いません。\n\n16.4 お客様のご利用端末の破損、データ消去、紛失、盗難、端末変更もしくは不具合、ご利用端末からのアンインストール、またはパスワードの公開、紛失もしくは忘却等（パスワードの不設定および設定の不備を含みます。）によって、お客様のアカウントの全部または一部が消失し、またはお客様がアカウントへアクセスできなくなった場合においても、当社は責任を負いません。\n\n16.5 当社は、お客様と第三者（他のお客様、決済事業者、本サービス内で表示される広告の広告事業者を含みます。）との間で生じた紛争には関知せず、一切の責任を負いません。また、当社は、第三者の投稿情報、サービス（本サービス内で表示される広告およびその広告の対象となるサービスを含みます。）または行為等について一切の責任を負いません。\n\n16.6 お客様は、本サービスを利用するにあたり、健全な生活環境を乱すような過度の利用を避け、また、お客様の周囲の状況に注意して安全に利用するよう心がけるものとします。当社は、社会通念上適切な範囲を逸脱する本サービスの利用、または本サービスの利用中における事故等によりお客様に生じた社会的、精神的、肉体的な損害について、責任を負いません。\n\n16.7 当社は、お客様に対して適宜情報提供やアドバイスを行うことがありますが、お客様は当該情報やアドバイスをお客様の責任において取扱うものとし、当社はその結果について責任を負いません。\n\n\n17. 損害賠償   \n\n17.1 本規約の他の定めにかかわらず、当社の責めに帰すべき事由（3.1項に定める本サービスの一時停止または中断による場合は含まれません）により有償コンテンツまたはお客様が有償で提供を受けた本サービス専用通貨に関してお客様が損害を被った場合、当社は、通常直接発生すると考えられる損害の範囲に限定し、当該損害が発生した日の属する月における、お客様の本サービス専用通貨購入額または有償コンテンツ相当額を上限として、当該損害を賠償する責任を負います。ただし、当社の故意または重大な過失に起因してお客様が損害を被った場合はこの限りではありません。\n \n17.2 お客様は、本規約またはガイドラインへの違反その他自己の責めに帰すべき事由により当社に損害を与えた場合、当社に対して当該損害を賠償する責任を負います。\n\n\n18. プライバシーポリシー\n\n18.1 当社は、本サービスを通じて当社が取得したお客様の個人情報を、別途定める「プライバシーポリシー」に基づき厳重に管理します。\n\n\n19. 本規約の変更について\n\n19.1 当社は、本規約の内容を随時変更できます。当社が本規約に何らかの変更を加える場合には、当該変更について事前に本サービスの公式サイトを通じて通知するものとし、変更後の規約は、本サービスの公式サイト内に掲示することによって効果が生じるものとします。お客様は、当社からの告知がなくても、本規約の内容を定期的に確認してください。\n\n19.2 お客様が本規約の内容に同意できない場合には、本サービスのご利用を直ちに中止してください。本規約の内容の変更後、お客様が本サービスのご利用を継続した場合、当社は当該変更をお客様が承諾したものとみなします。\n\n\n20. 権利不放棄\n\n20.1 本規約、ガイドラインおよび法令等に基づく権利を当社が行使しない場合であっても、そのことは当該権利の放棄とはならず、当社はかかる権利を依然として行使できます。\n\n\n21. 分離可能性\n\n21.1 本規約およびガイドラインの一部が法令等に基づき無効と判断された場合であっても、他の規定の有効性には影響しないものとします。\n\n\n22. 準拠法および合意管轄\n\n22.1 本サービス、本規約およびガイドラインは日本法を準拠法とし、これに従い解釈されるものとします。\n\n22.2 本サービス、本規約およびガイドラインに関連してお客様と当社との間で生じた紛争は、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n\n以上\n制定　2023年6月14日\n\n\n\n家庭用ゲーム機向け『BLUE PROTOCOL』利用規約\n\n株式会社バンダイナムコオンライン（以下、「当社」といいます。）が日本国内向けに提供する家庭用ゲーム機向けオンラインゲームサービス 『BLUE PROTOCOL』(以下「本サービス」といいます)の利用にあたっては、この利用規約（以下、「本規約」といいます。）記載の一切の条件および本規約に組み込まれる追加条件が適用されます。かかる条件のうち一部でも同意できないものがある場合には、本サービスの利用はできません。\n\n本規約は、お客様と当社との間の契約であって、本規約が表示される家庭用ゲーム機向け『BLUE PROTOCOL』（以下、「本件ゲーム」といいます。）の利用に適用されます。なお、本件ゲームには、ゲームのマルチプレイヤー部分、オンライン部分およびダウンロード部分、ならびに紙媒体または電子媒体の関連ドキュメントおよびコンテンツも含まれますが、これらに限定されるものではありません。本規約はライセンス契約であって、本件ゲームまたはそのコピーの知的財産権をお客様に譲渡するものではありません。お客様と当社との間に他の製品またはサービスに関する別の契約がある場合においても、かかる契約の条件が本規約によって変更されることはありません。お客様は、本規約のいかなる部分も変更、追加または削除できません。\n\n本件ゲームの一部である特定の機能には、当社から提示される追加条件（料金、支払方法およびプロモーションに関する規則も含まれますが、これらに限定されるものではありません）が適用されることがあります。別段の記載がない限り、当該追加条件は、参照により本規約に組み込まれたことになります。本規約と何らかの追加条件との間に矛盾が生じた場合には、当該特定の機能については、追加条件が優先するものとします。\n\n1. プライバシー\n本件ゲームを通じて収集されるデータは、当社により日本において保持されます。詳しくは、当社のプライバシーポリシー（本規約の後に表示されます）をご確認ください。プライバシーポリシーでは、かかるデータの当社による収集、利用および開示の方法について説明がなされています。\n\n2. ライセンスの前提条件\n本規約において許諾されるライセンスは、以下に掲げる事項が前提条件となります。\n(1) お客様がご自身の法域における成人年齢に達しているか、お客様がご自身の法域における成人年齢に達していない場合には本規約および適用される一切の追加条件が適用されることについて、お客様の法定代理人（親権者等）による同意があること。\n(2) 本規約の一切の条件および適用される一切の追加条件について、お客様が同意しているとともにこれらを遵守していること。\n(3) お客様による本件ゲームの利用について、一定のセキュリティ措置の適用を受けること。これには、本件ゲームのシリアルコード登録、インターネットへの継続的アクセス、および一定のセキュリティ/デジタル権管理機能への同意も含まれますが、これらに限定されるものではありません。かかるセキュリティ措置への同意または遵守がなされなかった場合には、お客様による本件ゲームの利用が部分的または完全に損なわれることがあります。\n(4) お客様による本件ゲームの利用が、適用のある一切の現地法令、州法令、国内法令および外国法令に従ったものであること。\n(5) お客様による本件ゲームの利用の場所が、本件ゲームの動作環境として予定され有効にライセンス認証を経たオペレーティングシステムが動作しているローカルコンピューター（以下、「対象ハードウェア」といいます。）に限定されること。\n(6) お客様が、対象ハードウェアに適用される一切の条件（決済手続に関するプラットフォームの条件も含まれます）に同意済みであるとともにこれらを遵守していること。\n\n3. 限定的利用ライセンス\n(1) 本規約に従い、当社は、プラットフォーム利用規約（該当のものがある場合）で許可された範囲に限り、お客様の所有または管理する対象ハードウェア上で、お客様の居住国において、本規約の期間本件ゲームを利用するための非独占的、譲渡不可かつ限定的なライセンスをお客様に許諾します。本件ゲームの更新版、追加版および交換品も、本規約が適用されます。ただし、かかる更新版等に他のライセンス条件が付されている場合には、この限りではありません。\n(2) 上記内容は、本件ゲームについてのお客様の権利のすべてを定めたものです。本件ゲームについての権利のうち本規約においてお客様に明示的に付与されていない一切のものは、当社に留保されます。お客様は、次のいずれの行為についても、自ら行わず、いかなる第三者にも許可せず、いかなる第三者にも行わせないものとします。(i) 本件ゲームの配布、コピー、ライセンス、貸与または販売（本規約またはプラットフォーム利用規約により明示的に許可されたものを除きます）、(ii) お客様ご自身の私的な非商用利用以外を目的とした本件ゲームの利用、(iii) 本件ゲームのリバースエンジニアリング、逆コンパイル、逆アセンブル、またはソースコード抽出、(iv) 本件ゲームの修正、改変、または派生物作成、(v) 本件ゲームにおける著作権表示、商標表示その他の権利帰属表示の削除、改変または不明瞭化、(vi) 予定された目的以外での本件ゲームの利用、(vii) お客様の所有または管理していない対象ハードウェア上での本件ゲームの利用、(viii) 本件ゲームにおけるセキュリティ措置の回避またはその試み、または (ix) 本件ゲームのオンライン機能へのアクセス時におけるお客様の地域の不明瞭化または隠ぺい。\n\n4. 権利帰属\n本件ゲームならびに本件ゲーム内のまたは本件ゲームを通じて利用できる一切のコンテンツ（本規約に定めるユーザーコンテンツを除きます）および素材（当社のロゴ、一切のデザイン、テキスト、グラフィックス、写真、情報、データ、ソフトウェア、サウンドファイル、本件ゲーム通貨および本件仮想アイテムその他のファイル、ならびにこれらを選別または整理したものも含まれますが、これに限定されるものではありません）の権利は、当社またはそのライセンサーに帰属し、著作権その他の知的財産に関する法律および条約で保護されています。本規約におけるいかなる別段の規定にもかかわらず、お客様は、上記コンテンツおよび素材（本件ゲーム通貨および本件仮想アイテムも含まれますが、これらに限定されるものではありません）についてのいかなる権利または権原もお客様に帰属しないことに、同意しているものとします。\n\n5. 期間\n(1) 第2条に掲げられた前提条件をお客様が満たすことを条件として、本規約は、お客様が本件ゲームを利用する期間中、有効に存続するものとします。いずれの当事者も、理由の有無にかかわらず、合理的な事前通知により、いつでも本規約を解除できるものとします。お客様は、ご自身の保有、保管または管理する本件ゲームの一切のコピーを削除または破棄することにより、本規約を解除できるものとします。当社は、お客様による本件ゲームの利用の中止について、お客様および第三者のいずれに対しても、責任を負いません。\n(2) お客様による本規約への違反があった場合、当社は、自己の有する他のいかなる権利も制限することなく、本件ゲームについてのお客様に対するライセンスを即時に制限、停止または取り消す権利を有するものとします。\n(3) 本規約が終了した場合、(i) 本件ゲームについてのお客様へのライセンスは、即時に失効するものとし、(ii) お客様は、いかなる料金の返金も受ける権利を有しません。これには、未消化の料金（該当のものがある場合）も含まれます。ただし、適用法上の義務付けにより本件有償ゲーム通貨が返金対象となる場合は、この限りではありません。\n(4) 第3条(2)、第4条、第5条(4)、第8条、第9条、および第11条から第18条は、本規約の終了後も存続するものとします。\n\n6. 修正\n当社は、時期および理由の如何を問わず、その単独の裁量により、本規約を変更することができます。当社は、本規約に何らかの変更を加える場合には、当該変更について、事前に本サービスの公式サイトを通じて通知するものとします。お客様は、かかる変更の効力発生日後も本件ゲームの利用を継続することにより、変更後の本規約に同意したものとみなされます。\n\n7. 本件ゲームの修正\n当社は、合理的な事前通知により、本件ゲームまたはそのいかなる機能もしくは部分についても、一時的または永久的に修正しまたは中止することができます。なお、緊急事態または絶対的に必要な場合においては、かかる事前通知を要しないものとします。お客様は、本件ゲームまたはそのいかなる部分のいかなる修正、停止または中止についても当社が責任を負わないことに、同意しているものとします。\n\n8. お問い合せ\n(1) 本サービスに関するお客様からのお問い合わせは、下記お問い合わせ窓口にて受け付けます。\n＜BLUE PROTOCOLお問い合わせ＞\nhttps://blue-protocol.com/support/contact\n\n9. 当社からの通知\n(1) 当社からお客様に対する通知は、公式サイト（※）のお知らせページへの掲載、本サービス内メール、本サービス内チャットサービスまたはお客様がバンダイナムコIDサービスの利用に際して登録したメールアドレスへのメール送信により行います。\n（※）「公式サイト」とは、当社が管理する本サービスのウェブサイト（https://blue-protocol.com/）をいいます。\n(2) お客様は、当社からの通知の内容を随時確認するものとし、お客様が当社からの通知を確認しなかった場合の不利益は、お客様が負うものとします。\n\n10. ゲーム内通貨および仮想アイテム\n(1) 当社は、次の機能をお客様に提供することがあります。(i) ゲーム内通貨を使用するための限定的ライセンスを購入する機能（当該ゲーム内通貨を、以下、「本件有償ゲーム通貨」といいます。）、(ii) 本件ゲームにおける特定のタスクの遂行によりゲーム内通貨を使用するための限定的ライセンスを獲得する機能（当該ゲーム内通貨と本件有償ゲーム通貨と合わせて、以下、「本件ゲーム通貨」といいます。）、および/または (iii) 本件ゲーム内で当社により提供される仮想物品およびサービス（以下、「本件仮想アイテム」といいます。）についての限定的ライセンスを獲得し、かつ/またはかかる限定的ライセンスを本件ゲーム通貨で購入する機能。当社は、かかるライセンスの購入または獲得の機能を提供する場合には、本規約に従い、お客様に対し、かかる本件ゲーム通貨または本件仮想アイテムをご自身の私的かつ非商用的な用途に使用するための非独占的、譲渡不可、取消可能かつ限定的な権利およびライセンスを許諾するものとします。\n(2) 本件ゲーム通貨によって引き換えることのできるものは、本件ゲーム内で使用できる本件仮想アイテムに限られます。本件ゲーム通貨および本件仮想アイテムは、当社その他のいかなる者によっても、金銭、金銭的価値を有するものまたは金銭等価物へと引き換えることはできません。ただし、適用法による別段の義務付けがある場合は、この限りではありません。本件ゲーム通貨および本件仮想アイテムは、現実通貨と等価値を有するものではなく、現実通貨の代替となるものでもありません。当社その他のいかなる者も、本件ゲーム通貨または本件仮想アイテムについて、有価物（現実通貨も含みます）への引換えの義務を負いません。お客様は、本件ゲーム通貨または本件仮想アイテムのゲーム内における性質または価値に対し影響を及ぼすおそれのある措置（適用法上禁止されているものを除きます）が当社によりいかなる時点であれ講じられることについて、確認し同意しているものとします。当社は、その単独の裁量により、本件ゲーム通貨の購入量、獲得量または引換量に制限を加えることができるものとします。\n(3) 本件有償ゲーム通貨のいかなる購入も、確定的なものであって、状況の如何を問わず返金不可、譲渡不可かつ交換不可となります。ただし、適用法による別段の義務付けがある場合は、この限りではありません。本件有償ゲーム通貨および一定の本件仮想アイテムの購入価格を除き、当社は、本件ゲーム通貨または本件仮想アイテムのアクセス、使用または不使用について課金をすることはありません。\n(4) お客様による本件ゲーム通貨または本件仮想アイテムの譲渡、売却、贈与、交換、取引、リース、再許諾または貸借は、いずれも禁止されています。ただし、本件ゲーム内において、かつ当社により明示的に許可されている場合については、この限りではありません。本規約における別段の合意がある場合を除き、本件ゲーム通貨および本件仮想アイテムについての権利および権原は、当社に留保されます。\n(5) 本件ゲーム通貨および本件仮想アイテムについて本規約で許諾されるライセンスは、第5条に基づく本規約の終了時に失効するものとします。ただし、本規約に別段の定めがある場合は、この限りではありません。\n(6) 別途「資金決済に関する法律に基づく表示」にて表示される本件有償ゲーム通貨は、資金決済に関する法律に基づき前払式支払手段として取扱われます。当該前払式支払手段以外のコンテンツ（当該前払式支払手段により購入されたその他のコンテンツを含みます。）は、取得をもってこれにかかるサービスの提供がなされたものとし、前払式支払手段には該当しません。\n(7) 本サービスの利用料金の支払は、当社の指定する支払方法によります。お客様と決済事業者との間で利用料金の支払に関して紛争が発生した場合、お客様と決済事業者との間で紛争を処理解決するものとします。\n(8) 本件ゲーム通貨または本件仮想アイテムの販売価格は購入ページをご覧ください。\n(9) お客様が未成年者である場合には、本件ゲーム通貨または本件仮想アイテムの購入（利用（消費）を含みます）にあたり、事前に法定代理人の同意が必要です。\n(10) お客様が取得した本件ゲーム通貨または本件仮想アイテムは本サービス内でのみ利用いただけます。なお、本サービスと同一名称であっても、本サービスと配信ストアが異なるサービスは本サービスに含まれません。 \n(11) 本件ゲーム通貨の有効期限は、お客様が当該本件ゲーム通貨を購入した月を含む5か月目の末日23:59までとします。当該期限を経過した時点で、事前に通知することなく、有効期限を経過した本サービス専用通貨は失効します。\n(12) 本件ゲーム通貨および本件仮想アイテムの価格、仕様の変更、販売の終了は当社の任意とします。\n(13) 本件ゲーム通貨および本件仮想アイテムの提供に関して欠陥等があった場合、当社は代替品の提供等をもって当該欠陥等の修補または原状回復に代えることができます。\n(14) 本サービスにおける本件仮想アイテムのゲーム内表現は、本サービスと配信ストアが異なるサービスにおけるゲーム内表現とは、当該サービスが本サービスと同一名称であっても、一部異なる場合があります。詳細は公式サイトをご確認ください。\n\n11. ユーザーコンテンツ\n何らかの通信、情報、知的財産、素材、メッセージ、写真、グラフィックス、動画、URLその他の事項またはコンテンツを本件ゲームに投稿すること（投稿された当該コンテンツ等を以下、「ユーザーコンテンツ」といいます）により、適用法上許容される限りにおいて、お客様は、ご自身へのさらなる通知または対価のいずれもなしに、知的財産権が存続する全期間にわたり、本件ゲームならびにこれに関する物品およびサービスに関連してユーザーコンテンツを利用するための非独占的、無償、譲渡可能かつ再許諾可能の全世界におけるライセンスを、本規約により当社に対し許諾したことになります。これには、既知であるか今後考案されるかを問わずあらゆる方法および媒体による複製、複写、翻案、修正、実施、派生物作成、表示、公表、放映、送信その他の方法による利用、配布、活用および公開の権利も含まれます。適用法上許容される限りにおいて、お客様は、当社および第三者によるユーザーコンテンツの利用について、著作者人格権および実演家人格権を行使しないものとします。当社に許諾されたライセンスは、本規約の終了または取消しの後においても、存続するものとします。\n\n12. オンライン上の行為\n当社の故意または重過失による場合を除き、当社は、いかなるユーザーの行為についても、それが本件ゲームの利用に関係するか否かにかかわらず、何らの責任も負いません。当社は、お客様が本条の規定その他本規約の何らかの条件に違反した場合には、いつでもお客様による本件ゲームの利用権を停止しまたは失効させることができるものとします。当社は、本件ゲームにおいてアップロード、公表、保存または表示（総称して以下、「投稿」といいます。）されたいかなるユーザーコンテンツについても、（たとえば著作権者からの請求に対する対応として）審査することができるものとします。ただし、本件ゲーム内のプライベートメッセージの一部としてシェアされたユーザーコンテンツについては、当社は、少なくとも当該通信の一方からその内容が（たとえば、好ましくないメッセージとして当社への通報により）提出された場合を除き、その内容のスクリーニングまたは審査のいずれも実施しません。当社は、いかなるユーザーコンテンツについても、削除する権利およびオンライン化を拒否する権利を有します。当社は、本件ゲームに投稿されたユーザーコンテンツのいずれについても、日常的にスクリーニング、編集または監視を行うわけではありません。ただし、当社は、本件ゲームを通じて投稿されたいかなるユーザーコンテンツについても、それが本規約に違反し、第三者の権利を侵害し、かつ/または適用のある法律、規則もしくは規制に違反するとの判断を自己の合理的裁量により下した場合には、削除、スクリーニングまたは編集を行うことができるとともに、かかる措置について絶対的裁量を有するものとします。お客様は、本件ゲームについて過去に利用停止処分または退会処分を受けたことがある場合には、本件ゲームを利用することができません。お客様は、自らが投稿しまたはユーザーもしくは第三者に送信した一切のユーザーコンテンツについて、単独で責任を負うものとします。とりわけ、お客様は、本件ゲームに関連して以下のいずれの行為についても、自ら行わないこと、試みないこと、かつ他者に行わせないことについて、同意しているものとします。\n(1) 不法、誹謗、中傷、不快、わいせつ、卑猥、下品、低俗、淫ら、露骨な性表現、いやがらせ、脅迫、プライバシー権侵害、パブリシティ権侵害、悪態、扇動もしくは詐欺に当たるユーザーコンテンツ、不法、買春・売春、覚せい剤、麻薬等薬物の使用、自殺、自傷行為その他の反社会的な行為（ハッキングも含まれます）を助長しもしくは促進するユーザーコンテンツ、何らかの集団もしくは個人に対する人種差別、偏見、物理的危害その他の危害を助長するユーザーコンテンツまたは他の何らかの点で好ましくないユーザーコンテンツを投稿すること。\n(2) 他者の特許権、商標権、営業秘密、著作権その他の知的財産権または財産権を侵害するまたはそのおそれのあるユーザーコンテンツを投稿すること。\n(3) 著しく残虐・暴力的・差別的な表現その他の他人に不快感を与えるおそれのある投稿をすること。\n(4) 未成年に対し、飲酒、喫煙、ギャンブル等を奨励する等、悪影響を及ぼすおそれのある投稿をすること。\n(5) 本サービスと無関係な情報を著しい長文として投稿すること。\n(6) 異性または同性を問わず、面識のない第三者との出会いまたはわいせつな行為等を目的とする情報を投稿すること。\n(7) 本サービスの不具合又は不正行為に関する情報を投稿すること。\n(8) 当社及び当社関連会社、又は第三者の財産、プライバシー、肖像権、知的財産権を侵害する行為又はそのおそれのある行為を行うこと。\n(9) 商業的活動または商取引（商業目的の広告または勧誘の送信も含まれます）に関与すること。\n(10) いかなる者（ご自身も含まれます）に関するものであれ、氏名・メールアドレス・電話番号・住所・金融機関口座番号・個人にアクセスすることが可能となりうる情報等の個人情報を入力、開示、投稿または配布すること並びにニックネームに本名を登録すること。\n(11) 他者（当社の役員、フォーラムリーダー、ガイド、ホスト、従業員または代理人も含まれます）になりすますこと、またはお客様と他者との関係性について詐称しその他何らかの方法で不実の表示をすること又は他の登録会員のパスワ－ドを不正に使用すること。\n(12) 本件ゲーム、その通常のプレイもしくは会話の流れを妨害もしくは阻害し、または下品な言葉、ののしり、過剰な叫び声（全部大文字など）、スパム行為もしくは本件ゲームの他のユーザーを害する他の何らかの妨害的もしくは有害な方法を用いること。\n(13) バグ、エラーその他の設計上の瑕疵を利用することにより、本件ゲームに対する不正なアクセス権を取得し、他のプレイヤーとの関係で不当に有利な状況を獲得し、または本件ゲームに関連してチート行為もしくは不正利用を行うこと。かかる行為には、本件ゲームのうちアクセス権限を有しない部分にアクセスすること、またはボット、エミュレーターその他の不正な第三者のツールを用いることも含まれますが、これらに限定されるものではありません。\n(14) 本サービスの不具合等を利用して、自己もしくは第三者に利益をもたらす行為または当社もしくは第三者に不利益をもたらす行為を行うこと。\n(15) 本サービスのデータを改ざん又は不正に作成すること。\n(16) 本サービスの利用を阻害する情報を登録すること。\n(17) 本サービスの内容を転載、貸与、再許諾、複製、修正（改変、結合、リバースエンジニアリング、解析等を含む）、蓄積または転送する行為を行うこと。\n(18) 本サービスの提供を妨げる行為または誹謗する行為を行うこと。\n(19) リアルマネートレード（RMT）及びこれに類する行為を行うこと。\n(20) 犯罪行為又はこれに結びつく行為を行うこと。\n(21) 異性との交際を目的として本サービスを利用すること。\n(22) 宗教活動及び類似する行為、宗教団体への勧誘行為を行うこと。\n(23) 政治活動及び類似する行為、政治団体への勧誘行為を行うこと。\n(24) 選挙期間中であるか否かに関らず、選挙運動又はこれに付随する目的で本サービスを利用する行為、若しくは公職選挙法に違反する行為を行うこと。\n(25) 他の登録会員又は第三者の個人情報、クレジットカード番号又は口座情報等を収集する行為・これらの情報の提供を勧誘する行為、又は蓄積する行為を行うこと。\n(26) わいせつ、児童ポルノ画像の送信その他児童及び青少年に悪影響を及ぼす行為、又は他人に不愉快な感情を抱かせる行為を行うこと。\n(27) 連鎖的なメール転送を依頼する行為、又は当該依頼に応じて転送する行為を行うこと。\n(28) 無限連鎖講(ネズミ講) 又はネットワークビジネス等の開設及びこれを勧誘する行為を行うこと。\n(29) 脅迫、恐喝、ストーカー行為等、方法の如何を問わず第三者に迷惑を及ぼす行為を行うこと。\n(30) 反社会的勢力等への利益供与行為を行うこと。\n(31) アカウントを複数作成すること。\n(32) アカウントの利用機能の制限や利用停止の措置等を受けたにもかかわらず、アカウントの再作成等により当該措置等を回避すること。\n(33) 当社（当社のカスタマーサービス担当者等を含みます。）または第三者に対する法的な責任を超えた不当な問い合わせまたは要求行為（類似または同一の問い合せまたは要求行為を必要以上に繰り返すことを含みます。）を行うこと。\n(34) 他のお客様を他のサービスに勧誘または誘導すること。\n(35) 正当な理由がないにもかかわらず利用料金の返還または払戻しを要求すること。\n(36) 日本国外から本サービスを利用すること。\n(37) 当社がお客様に対し本サービス上のチャットサービスを用いて連絡を行い、お客様からの回答を希望する場合に、プレイ状況または利用環境の如何に関わらず、お客様が一定期間内に応答しないこと。または当社からの協力要請に従わないこと。\n(38) 本件ゲームのルールに則った他のユーザーによる本件ゲームのプレイの享受を妨害することとなる行為、または当該プレイの享受のための本件ゲームの維持に際して当社もしくはプラットフォームプロバイダーにおける費用その他の負担を増加させることとなる行為をすること。\n(39) 自動操作ツール（マクロ）や当社が認めないプログラム・マクロその他のツールを使用して本サービスの利用をすること、及び当該利用を勧奨すること。\n(40) 有害なコンピュータ・プログラム等を公衆送信、頒布又は使用すること。\n(41) 本サービスに係るサーバへの不正アクセスや過度な負荷をかける行為を行うこと。\n(42) 虚偽の情報を提供する行為または本サービスを不正な目的で利用する行為を行うこと。\n(43) 本サービスに関する当社が未公表の情報を、当社以外の第三者に公開すること。オンラインプレイ中に意図的にネットワークを切断すること、または他の一定のプレイヤーに繰り返し負けることで当該プレイヤーのランキングの上昇もしくは本件ゲーム内でのカウント獲得を助けること。\n(44) 本件仮想アイテムまたは本件ゲーム通貨について、本件ゲーム外において取引、売却、オークションその他の譲渡を行うかまたは譲渡を試みること。\n(45) 本サービスの利用方法として予め想定又は許容される行為以外の行為を行うこと。\n(46) 上記のほか、本規約の規定その他当社から告知されたポリシーに違反するか、または当社に責任を負わせること。\n\n13. 第三者のコンテンツ\n本件ゲームを通じ、ユーザー、広告主その他の第三者のコンテンツがお客様に提供されることがあります。当社は、当該第三者のコンテンツを管理しておりません。そのため、お客様は、当社の故意または重過失による場合を除き、いかなる第三者のコンテンツについても当社が責任を負わないこと、第三者のコンテンツに含まれる情報の正確性または品質のいずれに関しても当社が保証しないこと、また第三者のコンテンツのうち意図しないもの、好ましくないもの、不正確なもの、誤解を招くものまたは不法なもののいずれについても当社が責任を負わないことに、同意しているものとします。商号、商標、メーカー、サプライヤーその他によるいかなる製品、サービス、プロセスその他の情報についての言及も、これらについて当社による是認、後援もしくは推奨または提携関係を意味するものではなく、これらを黙示するものでもありません。ただし、当社による明示がある場合は、この限りではありません。\n\n14. 免責事項\nお客様は、お客様による本件ゲームのアクセスもしくは利用に影響を及ぼすウイルスその他の無効化機能、または本件ゲーム、他のサービスおよび対象ハードウェアの間における互換性の欠如のいずれについても、当社ならびにそのライセンサーおよびサプライヤーが責任を負わないことを、確認し同意しているものとします。本件ゲームその他の一切のサービスは、「現状有姿」で提供されます。本規約に定めのある場合を除き、当社ならびにそのライセンサーおよびサプライヤーは、いかなる種類の保証（明示または黙示を問わず、法律その他のいかなる根拠によるものであるかも問いません）もしません。これには、非侵害、商品性または特定目的への適合性に関する黙示的保証も含まれますが、これらに限定されるものではありません。\n法域によっては、消費者契約における黙示的条件の否認または保証もしくは担保の排除もしくは制限が許されていないことから、本条における免責事項の一部または全部がお客様に適用されないことがあります。\n\n15. インターネット\nお客様は、本件ゲームに関連する通信または処理の開始、実施または完了に関する正確性、適時性、遅延または不具合について、当社がいかなる責任も負わない旨を、確認し同意しているものとします。また、当社は、本件ゲームのオンライン部分、マルチプレイヤー部分またはダウンロード部分について、お客様の希望する時点でお客様によるアクセスが可能である旨の約束または保証をすることもありません。本件ゲームの当該部分にアクセスできない状況が長期間にわたって生じることもあります。当社は、本件ゲームの当該部分のいずれの動作についても、中断がないこと、エラーがないこと、セキュアであることまたはウイルスが含まれないことのいずれも保証せず、サーバの動作継続または可用性についても保証しません。\n\n16. 責任の制限\n次に掲げるものを除き、いかなる場合も、当社またはその子会社、関係会社、役員、従業員、代理人その他のパートナーおよびサプライヤーは、本件ゲームの利用もしくは利用不能、本件ゲームに含まれているかもしくは本件ゲームを通じてアクセスするコンテンツの利用もしくは利用不能、またはサポートサービスの不提供に起因する間接損害、特別損害、派生的損害または懲罰的損害賠償その他利用機会の喪失または逸失利益など（これらに限定されるものではありません）のいかなる損害についても、それが契約、不法行為（過失も含まれます）その他のいかなる根拠による訴えであるかを問わず、責任を負いません。(1) 当社の過失に起因する死亡または人身傷害、(2) 当社による詐欺または欺まん的不実表示、(3) 当社による故意または重過失、(4) 本件ゲームの利用に起因する有形動産の滅失または損傷、および (5) 他の何らかの責任のうちその制限または排除が適用法上許されないもの。当社による軽過失、通常の過失または本規約に基づく主要な義務の違反の場合、当社の責任は、お客様に生じた予見可能な直接損害に限定されるものとします。いかなる場合も、本件ゲームの利用もしくは利用不能または本規約に起因または関連する当社の責任の総額は、契約、保証、過失、製造物責任、厳格責任、知的財産侵害その他のいかなる理論に基づくものであるかを問わず、100ドル、またはこれを上回る場合においてはお客様による本件ゲームの利用のためにお客様から当社に支払われた金額を上限とします。本条は、お客様の居住法域における法律上で契約による制限が許されていないいかなる強制的または法定の保証も、制限するものではありません。\n\n17. 準拠法\n適用法上の義務付けがある限りにおいて、本規約の一切の条件および条項は、本条に定める準拠法と矛盾する場合といえども、適用のあるすべての強行法規に準拠し、かかる法規に従って解釈されるものとします。いかなる場合も、本条において企図された準拠法に基づく本規約の条件の適用、解釈または執行により、適用のある消費者保護法に基づき消費者たるお客様に付与された何らかの権利について、排除、制限その他の限定がなされることはありません。お客様の行為は、現地法、州法、国内法および国際法の適用を受けることもありますので、その旨ご留意ください。各当事者は、本規約に起因するいかなる紛争または取引にも国際物品売買契約に関する国際連合条約が適用されない旨に、合意しているものとします。\n本規約に起因または関連する両当事者間のいかなる紛争も、本規約および日本法に準拠するものとします。\n\n18. 裁判地\n本規約に起因または関連する当事者間のいかなる紛争も、東京地方裁判所において解決されるものとし、お客様および当社は、同裁判所の専属的裁判管轄権に服することについて、合意しているものとします。\n\n19. 第三受益者\n本条で後述する場合を除き、本規約の当事者以外の人その他の法主体は、いかなる法律においてであれ、本規約のいかなる規定も行使する権利を有しません。これは、かかる人その他の法主体の名指しがある場合においても、同様とします。\nただし、対象ハードウェアとしてPlayStationを使用するお客様には、以下が適用されます。\nお客様は、株式会社ソニー・インタラクティブエンタテインメント（以下、「SIE」といいます。）が本規約の第三受益者である旨、また、本規約の条件へのお客様の同意によりSIEが第三受益者としてお客様に対し本規約を行使する権利を有することとなる旨について、確認し同意しているものとします。\n\n20. 雑則\n本規約は、本件ゲームの利用に関してお客様と当社との間の合意内容のすべてを余すところなく記載したものです。本規約の何らかの条項が無効または執行不能と判断された場合においても、当該条項により本規約の重要な部分が本規約から失われることとなる場合を除き、本規約の残余部分は、その残余期間その他第5条(4)に記載の期間にわたり、引き続き完全な効力を有するものとします。お客様は、当社の書面による事前同意を得ない限り、本規約または本規約に基づく自己の権利のいずれも、譲渡することはできません。かかる同意を得ることなく試みられたいかなる譲渡も、無効とします。上述の制約内容を条件として、本規約は、当社およびその各々の承継人および譲受人に対し完全な拘束力を有し、これらの者の利益のために効力を生じ、かつこれらの者により行使できるものとします。本規約における何らかの権利または条項について当社による行使または履行強制がなされなかった場合においても、当該権利または条項が放棄されたことにはなりません。本規約の条文見出しは、便宜のみを目的とするものであって、何らの法律上または契約上の効果も有しないものとします。\n\n制定　2023年12月6日\n\n\n\n『BLUE PROTOCOL』(以下「本サービス」といいます)にはユーザー同士の情報交換に利用できるチャット機能がございます。\n利用規約および以下のチャットサービスに関する注意事項の内容を確認し、同意したうえでチャットサービスをご利用ください。\nお客様が未成年者である場合には、必ずお客様の法定代理人(親権者等)とともに本注意事項を確認し、法定代理人の同意を得てから本注意事項に同意してください。  \n\n■チャットサービスに関する注意事項\n● 利用規約および本注意事項に従ってチャットサービスをご利用ください。\n\n● 株式会社バンダイナムコオンライン(以下「当社」といいます)はお客様と他のお客様または第三者との間で生じた紛争には関知いたしません。また、お客様の投稿情報に関する責任はお客様が負うものとし、当社は責任を負いません。\n\n● 以下に掲げる行為または該当するおそれのある行為は禁止しています。\n(1) 犯罪的行為または公序良俗に反する行為\n(2) 当社または第三者の財産、名誉、プライバシー等の権利を侵害する行為（本名、メールアドレス、電話番号などの個人情報や個人の特定につながる情報を投稿する行為を含む）  \n(3) 不適切な表現行為または虚偽の情報を提供する行為\n(4) 本サービスまたはチャットサービスを不正な目的で利用する行為\n(5) 本サービスまたはチャットサービスの提供を妨げる行為または誹謗する行為\n(6) 本サービスまたはチャットサービスの内容を転載、複製、修正、蓄積または転送する行為\n(7) 本サービスまたはチャットサービスを利用した営利行為\n(8) 他のお客様による本サービスもしくはチャットサービスの利用を妨害し、または当該利用に支障をきたす行為\n(9) 第三者に迷惑を及ぼす行為または不快感を与える行為\n(10) 利用規約に違反する行為または法令に違反する行為\n(11) その他当社が不適切と判断する行為\n\n● お客様の投稿情報は、不特定多数の方が閲覧することがあります。また、チャットサービスの適正な運営のために、当社および運営会社がお客様の投稿情報を閲覧することがあります。\n\n● お客様が利用規約および本注意事項に違反する投稿等をした場合、又は、当社が必要と判断した場合、当社は、当社の判断により、お客様に対して事前に通知することなく、投稿情報の削除、チャットサービスの利用停止、本サービスの利用停止、本サービスの利用契約の解除その他の必要な措置、または必要に応じて政府機関その他の第三者に対する開示を行うことができます。\n\n● 当社は、お客様の投稿情報について監視、変更・削除等の措置を行う義務を負いません。また、当社がお客様の投稿情報について変更・削除等の措置を行った場合であっても、当社は、当該措置を行うに至った理由および経緯の説明はいたしません。\n\n以上\n\n制定　2023年1月10日",
        "sort_id": 1
    },
    {
        "id": 5,
        "term_id": 2,
        "type": 1,
        "revision": 2,
        "platform": 1,
        "lang": "ja_JP",
        "title": "『BLUE PROTOCOL』プライバシーポリシー",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』プライバシーポリシー\n\n本プライバシーポリシーは、株式会社バンダイナムコオンライン（以下「当社」といいます）のウェブサイト、ゲーム、モバイルアプリケーションその他のオンライン製品およびサービス（総称して以下「対象サービス」といいます）をお客様が利用した場合または他の何らかの形にてお客様と当社との間でやり取りがあった場合におけるお客様に関する情報の当社による収集、保管、利用および開示の方法について、説明するものです。当社は、EU一般データ保護規則の目的上、お客様の個人情報のデータ管理者となります。\n当社は、本プライバシーポリシーを随時変更することがあります。当社は、何らかの変更を加えた場合には、本プライバシーポリシーの日付を更新することでその旨をお客様に告知するとともに、場合により追加的な告知（対象サービスのホームページへの告知文の追加またはお客様への通知の送付などによるもの）をお客様に対し行うことがあります。当社における情報の取扱方法、およびご自身のプライバシー保護に資する方法に関し、最新情報を得られるよう、対象サービスへのアクセスのたびにプライバシーポリシーを確認しておくことをお勧めします。\n\nI. 情報の収集\n当社がお客様から収集する情報は、対象サービスごとに異なります。 当社は、識別子、インターネットまたはその他類似のネットワーク活動、対象サービスの利用履歴、位置情報などを収集します。詳細は以下に記載されています。また、収集目的は、「II. 情報の利用」のセクションに記載されています。\n\n1. お客様から当社に提供される情報\n当社は、お客様から当社に直接提供される情報を収集します。たとえば、アカウントの作成、他のユーザーとのやり取り、当社サーバへの画像のアップロード、カスタマーサポートの依頼、ニュースレターの受信登録、アンケートへの参加その他の方法での当社とのやり取りがお客様によりなされた場合に、当社による情報収集が行われます。当社が収集することのある情報の種類には、お客様のユーザー名、パスワード、電子メールアドレス、写真その他お客様が提供を選択した一切の情報が含まれます。\n\n2. 対象サービスのお客様による利用時に当社が自動的に収集する情報\nお客様による対象サービスへのアクセスまたはその利用に際し、当社は、お客様に関する情報を自動的に収集します。その例としては、以下のものが挙げられます。\na)  利用状況に関する情報：当社は、お客様による対象サービスの利用に関する情報を収集します。これには、当社またはゲームコンソールを提供する事業者がゲーム開始時にお客様へ自動的に付与するゲーミングサービスID、コンプリート済みのレベル、ゲームスコア、対象サービスの利用に費やした時間その他のゲームプレイ情報も含まれます。\nb)  ログ情報：当社は、お客様による対象サービスの利用に関する情報をログに記録します。これには、お客様のブラウザの種別および言語、アクセス回数、閲覧ページ、お客様のIPアドレス、ならびに対象サービスへの移動前にお客様が訪問したウェブサイトも含まれます。\nc)  ハードウェア情報：当社は、お客様が対象サービスへのアクセスに用いたコンピュータ、スマートフォンその他のデバイス（以下「デバイス」といいます）に関する情報を収集します。これには、ハードウェアの型番、オペレーティングシステムおよびバージョン、ブラウザ、モバイルネットワーク情報、デバイスにインストールされている他の対象サービス（モバイルアプリケーション）、MACアドレス、IPアドレス、国際移動体装置識別番号（IMEI）その他の一意デバイス識別子であってお客様のデバイスのオペレーティングシステムにより提供されるものも含まれます。\nd)  位置情報：当社は、お客様のデバイスの地理的位置に関する情報を、対象サービスのお客様による利用の都度、またはかかる情報の収集について他の何らかの方法によるお客様の同意があった都度、収集することがあります。お客様は、ご自身のデバイス上の設定を用いて、こうした位置情報の収集の同意を撤回（拒否）することができます。お客様の位置情報は、収集前に対象サービスにおいて指定された期間にわたり、保存されます。\ne)  クッキー（Cookie）その他のトラッキング技術により収集される情報：当社は、様々な技術を用いて情報（個人情報も含む）を収集しています。その例としては、お客様のデバイスへのクッキーの送信も含まれます。クッキーは、お客様のデバイスのハードドライブ上またはメモリー内に保存される小さなデータファイルであり、対象サービスおよびお客様の体験の向上、対象サービスにおいて人気のある領域および機能の特定、ならびに訪問数の算定に際し、当社の助けとなるものです。クッキーに関する詳細については、当社のクッキーポリシー（https://blue-protocol.com/privacy/cookies 及びhttps://blue-protocol.com/privacy/cookies_support） をご覧ください。\nf)  お客様の傾向分析情報：当社は、お客様の嗜好、特性、行動および本サービスの使用実績などの情報に基づいて傾向分析をし、お客様の同意を得て、その分析結果を他の情報と組み合わせて利用します。\n\n3. 当社が第三者から収集する情報\n当社は、対象サービスの実施に必要である限りにおいて、第三者からも情報を取得することがあり、また、当該情報同士を組み合わせたり、当該情報と対象サービスを通じて収集した情報とを組み合わせたりすることもあります。たとえば、当社は、ゲームコンソールまたはiOSもしくはAndroidその他のプラットフォームを提供する事業者（以下「プラットフォーマー」といいます）から、お客様のゲームランキングおよび達成状況を収集することがあります。お客様が第三者のプラットフォーム（FacebookやTwitterなど）を通じてアカウントを作成またはログインした場合、当社は、当該プラットフォームがお客様から得た同意に従って、お客様の名前、誕生日、プロフィール写真などの特定の情報にアクセスすることができます。また、お客様がソーシャルメディア上で対象サービスに関する感想や他の情報を公開した場合、当社は、当該公開情報（ただし、当該ソーシャルメディア上でお客様が使用しているユーザー名は含みません。）を収集することがあります。さらに、お客様がアプリ購入を完了した場合、当社は、お客様のデバイスのオペレーティングシステムを提供する事業者（以下「OSプロバイダー」といいます）が当社に代わって当該購入を処理する際に、当該OSプロバイダーからお客様に関する情報を収集することがあります。ただし、当社は、OSプロバイダーからお客様の支払方法に関する情報を受領することはありません。\n\nII. 情報の利用\n当社は、お客様の同意がある場合、または次のいずれかにとって必要な範囲である場合に限り、お客様の情報の収集、保管および利用を行います。(i) お客様と当社との間の契約を履行するため、(ii) 当社の法的義務を遵守するため、または (iii) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため。当社は、当社の正当な事業上の利益とお客様の保護法益との衡量を慎重に行っています。この利益衡量に関してご不明な点がありましたら、後述の問い合わせ先宛てにご連絡ください。\n特に、当社（または当社の委託先）は、お客様に関する情報を、以下の目的のため、当該目的の達成に必要とされる期間にわたり、収集、保管および利用することがあります。\n\na)  お客様と当社との間の契約を履行するため\n-対象サービスの提供のため。\n-対象サービスに関するお客様からのコメント、問い合わせおよび依頼に対応し、関連情報を提供するため。\n-対象サービスにおいてお客様のアカウント登録を行うとともに、お客様のアカウント管理を支援するため。\n-その他対象サービスに限らずお客様からのコメント、問い合わせおよび依頼に対応し、カスタマーサービスを提供するため。\n-技術上の告知、アップデート、セキュリティアラートおよびサポートのほか、事務手続上のメッセージをお客様に送信するため。\n-当社の主催するコンテストへの参加の処理およびその懸賞金の提供のため。\nb) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため\n-当社の法律上および規制上の義務を遵守するために当社に必要であるまたは許可されている他の一切の目的のため。\n-対象サービスに関連する傾向、利用状況およびアクティビティのモニタリングと分析のため。\n-対象サービスに関連する詐欺的、不正または違法な活動を検出し、調査しかつ/または防止するため。\n-法定代理人の許可を取得するため。\n-サービス内においてコンテキスト広告（ターゲティング広告を除く）を提供するため。\nc) 同意がある場合\n-対象サービスに関連する傾向、利用状況およびアクティビティをモニタリング・分析し、お客様のニーズを把握して優れたサービスをお客様に提供するため。たとえば、当社は、お客様がソーシャルメディア上で公開した対象サービスに関する感想や他の情報を、第三者が提供する分析ツールを用いて単独で、またはゲームプレイ情報などの他の情報と組み合わせて分析し、お客様のニーズを把握して新たなサービスの提供に役立てることがあります。\n-当社または当社のグループ会社もしくは取引先により提供される製品、サービス、提案、プロモーション、報奨およびイベント・キャンペーンなどに関してお客様に告知や通知（イベント・キャンペーンなどの当選通知を含みます）を行うため。また、お客様の興味関心に合うと当社が判断する広告、ニュース、情報その他のマーケティング資料を提供するため。\n-当社が第三者から取得した情報を連携または組み合わせたりすることによって各対象サービスごとの収益傾向の分析、お客様の属性別統計データの作成、新しいゲームやサービスの創出、その他の分析を行うため。\n-対象サービス内のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の関心の高い広告の提供\n  ・広告および当社のサービスに関連するお客様の傾向、利用状況などのモニタリングおよび分析\n  ・他のお客様から収集した情報とリンクまたは組み合わせることでお客様のニーズを理解したうえで、よりパーソナライズされた広告の提供\n  ・第三者のサービスプロバイダーから提供される情報とお客様から収集する情報を組み合わせることによる、本サービスを利用するユーザーのカテゴリー別傾向分析\n-対象サービス外のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の情報を当社が提携する広告会社の情報と組み合わせ、お客様の属性別統計データを作成すること\n  ・当社（グループ会社含む）のゲーム・サービスの広告をご案内するため、お客様の情報を当社のグループ会社、広告代理店および配信広告プラットフォームへ広告出稿および分析を目的として提供すること\n  ・その他の広告分析やパフォーマンスの測定を実施すること\n\nIII. 情報の共有\n当社は、第三者（国内外のグループ会社を含む当社の委託先を除きます）との間においてお客様の個人情報の共有、転送および交換を行いません。ただし、法律により許容されている場合、またはお客様から当社への同意がある場合は、この限りではありません。その場合でも、当社は、お客様の個人情報を第三者に販売することはありません。以上を遵守したうえで、当社は、以下のとおり、または本プライバシーポリシーの他の規定に基づいて、お客様に関する個人情報に当たらない情報（当社内でお客様を識別できない情報）を共有することがあります。\na) 他のユーザーとの間での対象サービスにおけるインタラクティブ形式の領域（マルチプレイヤー、チャットまたは共有機能など）への参加をお客様が選択することで、お客様に関する情報を、他のユーザーとの間で共有する場合。尚、個人を識別できるデータ（お客様の氏名など）を対象サービスにおけるユーザー名として使用することは、禁止します。\nb) 当社の従業員、グループ会社、ベンダー、コンサルタント、その他の外部サービスプロバイダーであって当社のための業務遂行に際し当該情報へのアクセスを必要とするもの（たとえば、開発者、支払処理業者、ウェブサイトホスティングサービス業者、または情報ストレージおよび処理サービス業者も含みます）との間で、必要な限度でお客様に関する情報を共有する場合。\nc) 法的手続または情報提供要請への応答に際し、その開示が、適用のある法律、規則もしくは規制（たとえば、政府当局、規制機関または司法裁判所も含みます）に従ったものであるかまたは他の何らかの態様でかかる法律、規則もしくは規制により義務付けられている場合。\nd) お客様の保護法益と当社の正当な利益を比較衡量したうえで、お客様の行為が当社のユーザー契約もしくはポリシーに反していると認めるに足る、または当社、当社ユーザーもしくは他者の権利、財産および安全を保護するに足る合理的根拠がある場合。\ne) 当社事業の全部もしくは一部の合併、会社資産の売却、資金調達、または他の会社による買収に関連してお客様に関する情報を共有する法的根拠がある場合。\nf) お客様の同意または指示に基づく場合。\n\nIV. 第三者により提供される広告・分析サービス\n当社は、第三者による分析サービスの提供および対象サービス内での広告の配信を許可することがあります。これらの者は、お客様のデバイスおよびお客様による対象サービスの利用に関する情報を自動的に収集するテクノロジーを用いることがあります。かかる情報には、IPアドレス、デバイス識別子、対象サービス内のページでの滞在時間、および対象サービス内でクリックされたリンクも含まれます。かかる情報は、対象サービスの機能の維持、改善および分析など、ならびにお客様の興味関心に合う可能性のあるコンテキスト広告およびターゲティング広告の配信などのために、当社および当該第三者により利用されることがあります。かかる第三者によるお客様の情報の利用には、当該第三者各自のプライバシーポリシーが適用されることとなり、当社は、第三者のプライバシーポリシーについて管理権を有しないとともに責任を負いません。\n対象サービスによっては、ゲームおよび収益化の傾向分析、プレイヤーのカテゴリー別の傾向分析、新たなゲームおよびサービスの作成、その他解析の実施のために、お客様の事前同意を得たうえで、対象サービスの利用状況に関する情報と、当社の他のゲームから収集された情報、当社グループ会社のゲームから収集された情報その他第三者から収集された情報とを組み合わせることがあります。また、当社は、 お客様の同意または指示に基づく場合、当社のゲームを通じてそのゲーム外で配信する広告のために一定の情報を利用することがあります。これには、お客様に関する情報と当社の広告パートナーから取得した情報との組み合わせによりプレイヤーのカテゴリー別の傾向分析を行うこと、当社（および当社のグループ会社）のゲームおよびサービスについての当該ゲーム外での広告配信のために、お客様に関する情報を当社の広告代理店および広告配信プラットフォームに提供すること、ならびに他の何らかの方法で広告解析およびパフォーマンスメトリックの解析を実施することも含まれます。\nインターネットを利用した広告の詳細、またはお客様のウェブ閲覧情報が行動ターゲティング広告の目的で使用されることのオプトアウトは、以下いずれかのURLからご利用できます：http://optout.networkadvertising.org\nhttp://www.aboutads.info/choices\nヨーロッパのユーザーは、以下URLにアクセスすることによりターゲット広告の受信をオプトアウトすることができます：\nhttp://www.youronlinechoices.eu/\n当社のサービスにアクセスするために使用する各デバイスおよびブラウザで選択を更新する必要があります。\n\nV. ソーシャル共有機能\n対象サービスにより、お客様におけるソーシャルメディアとの間での活動の共有または対象サービスのリンクを可能とするソーシャル共有機能その他のツールが提供されることがあります。かかる機能を利用することで、ソーシャルメディアプラットフォームにおけるお客様の設定内容に応じて、お客様の友だちまたは公衆との情報共有が可能となります。ソーシャル共有機能に関連するデータの収集および処理の目的ならびに範囲に関する詳細については、当該ソーシャルメディアプラットフォームのプライバシーポリシーをご確認ください。\n\nVI. セキュリティ\n当社は、お客様に関する情報の消失、盗難、不正なアクセス、開示、改変ならびに破損からの保護に資する技術上および組織上の合理的措置を講じています。ただし、インターネット上の伝送のいずれも、セキュアである旨を保証できるものではなく、当社は、お客様からインターネット上で当社に伝送されるいかなる個人情報についてもセキュリティを保証することはできません。\n\nVII. データの保管および削除\n対象サービスを通じて収集された個人情報その他のデータは、いずれも、上記II.の目的にとって必要がなくなった場合には、識別不能化または削除されます。ただし、さらなる保持が法律により義務付けられている場合は、この限りではありません。 \n\nVIII. 国外への転送\n当社がお客様から収集する個人情報の転送、保存および処理は、通常の場合、日本国内で行われますが、場合により、当社は、日本またはGDPRと同等のレベルの個人情報保護制度を有する外国や、その他お客様の国の法律と同一レベルでのデータ保護を提供できない外国の第三者に、お客様の個人情報を開示することがあります。また、当社は、お客様の個人情報を、当社（および当社のグループ会社）または外部事業者が日本国外に設置したサーバで保存する場合があります。ただし、当社は、国外を所在地とする第三者にお客様の個人情報を開示したり、国外でお客様の個人情報を保存したりする場合には、お客様の個人情報が保存され、または取り扱われる国または地域における個人情報の保護に関する制度を把握した上で、当該情報の利用が各地域の法律に従ったものとなる状況を確保するための合理的措置を講じます。\n当社は、以下の国・地域のいずれかに所在する第三者にお客様の情報を開示することがあります。\na) United States of America\nb) United Arab Emirates\nc) Republic of India\nd) Republik Indonesia\ne) Ukraine\nf) Commonwealth of Australia\ng) Canada\nh) Kingdom of Cambodia\ni) Republic of Singapore\nj) Swiss Confederation\nk) Kingdom of Thailand\nl) Republic of Korea\nm) Taiwan\nn) Republic of Turkey\no) New Zealand\np) Republic of the Philippines\nq) Federative Republic of Brazil\nr) Hong Kong\ns) Malaysia\nt) United Mexican States\nu) Lao People's Democratic Republic\nv) Argentine Republic\nw) Principality of Andorra\nx) State of Israel\ny) Oriental Republic of Uruguay\nz) United Kingdom of Great Britain and Northern Ireland\naa) Bailiwick of Jersey\nbb) Bailiwick of Guernsey\ncc) Isle of Man\ndd) Faroe Islands\nee) State of Qatar\nff) Republic of Costa Rica\ngg) Republic of Tunisia\nhh) Republic of Panama\nii) Republic of Peru\njj) Republic of South Africa\nkk) Kingdom of Morocco\nll) Mongolia\n\n前項の各国・地域における個人情報の保護に関する制度の概要は、以下をご参照ください。\na) 個人情報保護委員会 　https://www.ppc.go.jp/index.html\nb) 外国における個人情報の保護に関する制度等の調査 　https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/\nc) GDPR（一般データ保護規則）越境データ移転　https://www.ppc.go.jp/enforcement/infoprovision/laws/GDPR/\n\nIX. 第三者のサイト\n対象サービスには、第三者により運営されている他のウェブサイトまたはサービスへのリンクが含まれていることがあります。本プライバシーポリシーは対象サービスのみに適用されるものであり、第三者がそのウェブサイトを通じて収集、保管および利用することのある個人情報について当社が責任を負うことはできませんので、その旨ご留意ください。お客様において、訪問先の各ウェブサイトのプライバシーポリシーに必ず目を通す必要があります。\n\nX. プッシュ通知/アラート\n当社は、プッシュ通知またはアラートをお客様のデバイスに送信することがあります。お客様は、ご自身のデバイスの通知設定を変更することにより、かかるメッセージ送信をいつでも非アクティブ化することができます。プロモーション用コンテンツ付きのプッシュ通知またはアラートが当社から送信されるのは、当該メッセージの受領についてお客様のデバイスにおけるお客様による事前オプトインがあった後に限られます。\n\nXI. データ保護の権利\n当社は、お客様（お客様が未成年の場合においてはお客様の法定代理人も同様です）から請求があったときには、法令に従い、適切に対応いたします。適用法上のお客様の権利に含まれ得るものの例としては、以下が挙げられます。\na) お客様において、お客様の個人情報または当社によるその第三者への提供の記録の開示を当社に求める場合。\nb) 当社が保有するお客様の個人情報が事実でないために、お客様において当社にその訂正、追加または削除を求める場合。\nc) 当社が違法にお客様の個人情報を取得し、利用し、または第三者に提供しているとして、お客様において当社にその利用もしくは第三者への提供の停止または消去を求める場合。\nd) 当社においてお客様の個人情報を利用する必要がなくなった、または当社が保有するお客様の個人情報について漏えい・滅失・毀損などが生じた、その他当社によるお客様の個人情報の取扱いによってお客様の権利または正当な利益が害されるおそれがあるなどの理由により、お客様において当社に個人情報の利用もしくは第三者への提供の停止または消去を求める場合。\ne) また、お客様は、当社の正当な利益に基づくお客様の個人情報の処理について、いつでも異議申立ての権利を有します。\nf) 当社がお客様の個人情報をダイレクトマーケティングの目的で処理する場合、お客様は、いつでも当該処理について異議申立ての権利を有します。これには、ダイレクトマーケティングに関係する限りにおいてはお客様のカテゴリーの傾向分析目的も含みます。お客様がダイレクトマーケティング目的での処理に異議を申し立てた場合、その後、当社は、当該目的でのお客様の個人情報の処理を行いません。この場合においても、当社は、両者間で継続中の取引関係に関する限りにおいて、取引上または関係上のメッセージを引き続きお客様に送信することがあります。\ng) お客様はこれらの権利を行使することにより、当社から他のユーザーと区別および差別されることはありません。\nこれらの請求を行うには、下記XII.の当社問い合わせ窓口より、申請いただく必要があります。なお、法定代理人その他の代理人による請求の場合、別途当社の指定する代理権を証する資料を郵送または送信いただく必要があります。\nお客様に対する個人情報の利用目的の通知および個人情報またはその第三者への提供の記録の開示の請求につきましては、別途当社窓口よりご案内する金額の手数料をいただきます。\nお客様は、お客様からの依頼に対する当社の対応方法がお客様にとって満足のいくものではなかった場合には、お客様の居住国に不服を申し立てることのできる監督当局が存在する場合、当該監督当局に不服を申し立てることができます。当社は、かかる権利がお客様により行使された場合においても、異なるレベルのサービスを提供するわけではありません。ただし、お客様は、対象サービスの適切な機能の確保にとって必要となる情報の収集の削除または収集停止を依頼した場合には、対象サービスの全部または一部の利用ができなくなることがあります。\nお客様がバンダイナムコIDを有している場合においてご自身のアカウントの閲覧または削除を希望するときは、ご自身のバンダイナムコIDにサインインしたうえで、https://www.bandainamcoid.com/portal/resignの説明内容に沿って手続をお願いいたします。お客様がご自身のアカウントを削除した後においては、お客様のアカウントに関係する一切の個人情報が削除され、お客様はバンダイナムコIDサービスにアクセスできなくなります。\n\nXII. 問い合わせ先\n本プライバシーポリシーまたは当社の方針に関してご不明な点などがございましたら、以下の当社窓口までお問い合わせください。\n株式会社バンダイナムコオンライン\n担当部署：個人情報対外窓口\n〒108-0014 東京都港区芝5-37-8\nprivacy@bandainamco-ol.co.jp\n\n以上\n制定　2023年12月6日",
        "sort_id": 2
    },
    {
        "id": 6,
        "term_id": 2,
        "type": 1,
        "revision": 2,
        "platform": 2,
        "lang": "ja_JP",
        "title": "『BLUE PROTOCOL』プライバシーポリシー",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』プライバシーポリシー\n\n本プライバシーポリシーは、株式会社バンダイナムコオンライン（以下「当社」といいます）のウェブサイト、ゲーム、モバイルアプリケーションその他のオンライン製品およびサービス（総称して以下「対象サービス」といいます）をお客様が利用した場合または他の何らかの形にてお客様と当社との間でやり取りがあった場合におけるお客様に関する情報の当社による収集、保管、利用および開示の方法について、説明するものです。当社は、EU一般データ保護規則の目的上、お客様の個人情報のデータ管理者となります。\n当社は、本プライバシーポリシーを随時変更することがあります。当社は、何らかの変更を加えた場合には、本プライバシーポリシーの日付を更新することでその旨をお客様に告知するとともに、場合により追加的な告知（対象サービスのホームページへの告知文の追加またはお客様への通知の送付などによるもの）をお客様に対し行うことがあります。当社における情報の取扱方法、およびご自身のプライバシー保護に資する方法に関し、最新情報を得られるよう、対象サービスへのアクセスのたびにプライバシーポリシーを確認しておくことをお勧めします。\n\nI. 情報の収集\n当社がお客様から収集する情報は、対象サービスごとに異なります。 当社は、識別子、インターネットまたはその他類似のネットワーク活動、対象サービスの利用履歴、位置情報などを収集します。詳細は以下に記載されています。また、収集目的は、「II. 情報の利用」のセクションに記載されています。\n\n1. お客様から当社に提供される情報\n当社は、お客様から当社に直接提供される情報を収集します。たとえば、アカウントの作成、他のユーザーとのやり取り、当社サーバへの画像のアップロード、カスタマーサポートの依頼、ニュースレターの受信登録、アンケートへの参加その他の方法での当社とのやり取りがお客様によりなされた場合に、当社による情報収集が行われます。当社が収集することのある情報の種類には、お客様のユーザー名、パスワード、電子メールアドレス、写真その他お客様が提供を選択した一切の情報が含まれます。\n\n2. 対象サービスのお客様による利用時に当社が自動的に収集する情報\nお客様による対象サービスへのアクセスまたはその利用に際し、当社は、お客様に関する情報を自動的に収集します。その例としては、以下のものが挙げられます。\na)  利用状況に関する情報：当社は、お客様による対象サービスの利用に関する情報を収集します。これには、当社またはゲームコンソールを提供する事業者がゲーム開始時にお客様へ自動的に付与するゲーミングサービスID、コンプリート済みのレベル、ゲームスコア、対象サービスの利用に費やした時間その他のゲームプレイ情報も含まれます。\nb)  ログ情報：当社は、お客様による対象サービスの利用に関する情報をログに記録します。これには、お客様のブラウザの種別および言語、アクセス回数、閲覧ページ、お客様のIPアドレス、ならびに対象サービスへの移動前にお客様が訪問したウェブサイトも含まれます。\nc)  ハードウェア情報：当社は、お客様が対象サービスへのアクセスに用いたコンピュータ、スマートフォンその他のデバイス（以下「デバイス」といいます）に関する情報を収集します。これには、ハードウェアの型番、オペレーティングシステムおよびバージョン、ブラウザ、モバイルネットワーク情報、デバイスにインストールされている他の対象サービス（モバイルアプリケーション）、MACアドレス、IPアドレス、国際移動体装置識別番号（IMEI）その他の一意デバイス識別子であってお客様のデバイスのオペレーティングシステムにより提供されるものも含まれます。\nd)  位置情報：当社は、お客様のデバイスの地理的位置に関する情報を、対象サービスのお客様による利用の都度、またはかかる情報の収集について他の何らかの方法によるお客様の同意があった都度、収集することがあります。お客様は、ご自身のデバイス上の設定を用いて、こうした位置情報の収集の同意を撤回（拒否）することができます。お客様の位置情報は、収集前に対象サービスにおいて指定された期間にわたり、保存されます。\ne)  クッキー（Cookie）その他のトラッキング技術により収集される情報：当社は、様々な技術を用いて情報（個人情報も含む）を収集しています。その例としては、お客様のデバイスへのクッキーの送信も含まれます。クッキーは、お客様のデバイスのハードドライブ上またはメモリー内に保存される小さなデータファイルであり、対象サービスおよびお客様の体験の向上、対象サービスにおいて人気のある領域および機能の特定、ならびに訪問数の算定に際し、当社の助けとなるものです。クッキーに関する詳細については、当社のクッキーポリシー（https://blue-protocol.com/privacy/cookies 及びhttps://blue-protocol.com/privacy/cookies_support） をご覧ください。\nf)  お客様の傾向分析情報：当社は、お客様の嗜好、特性、行動および本サービスの使用実績などの情報に基づいて傾向分析をし、お客様の同意を得て、その分析結果を他の情報と組み合わせて利用します。\n\n3. 当社が第三者から収集する情報\n当社は、対象サービスの実施に必要である限りにおいて、第三者からも情報を取得することがあり、また、当該情報同士を組み合わせたり、当該情報と対象サービスを通じて収集した情報とを組み合わせたりすることもあります。たとえば、当社は、ゲームコンソールまたはiOSもしくはAndroidその他のプラットフォームを提供する事業者（以下「プラットフォーマー」といいます）から、お客様のゲームランキングおよび達成状況を収集することがあります。お客様が第三者のプラットフォーム（FacebookやTwitterなど）を通じてアカウントを作成またはログインした場合、当社は、当該プラットフォームがお客様から得た同意に従って、お客様の名前、誕生日、プロフィール写真などの特定の情報にアクセスすることができます。また、お客様がソーシャルメディア上で対象サービスに関する感想や他の情報を公開した場合、当社は、当該公開情報（ただし、当該ソーシャルメディア上でお客様が使用しているユーザー名は含みません。）を収集することがあります。さらに、お客様がアプリ購入を完了した場合、当社は、お客様のデバイスのオペレーティングシステムを提供する事業者（以下「OSプロバイダー」といいます）が当社に代わって当該購入を処理する際に、当該OSプロバイダーからお客様に関する情報を収集することがあります。ただし、当社は、OSプロバイダーからお客様の支払方法に関する情報を受領することはありません。\n\nII. 情報の利用\n当社は、お客様の同意がある場合、または次のいずれかにとって必要な範囲である場合に限り、お客様の情報の収集、保管および利用を行います。(i) お客様と当社との間の契約を履行するため、(ii) 当社の法的義務を遵守するため、または (iii) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため。当社は、当社の正当な事業上の利益とお客様の保護法益との衡量を慎重に行っています。この利益衡量に関してご不明な点がありましたら、後述の問い合わせ先宛てにご連絡ください。\n特に、当社（または当社の委託先）は、お客様に関する情報を、以下の目的のため、当該目的の達成に必要とされる期間にわたり、収集、保管および利用することがあります。\n\na)  お客様と当社との間の契約を履行するため\n-対象サービスの提供のため。\n-対象サービスに関するお客様からのコメント、問い合わせおよび依頼に対応し、関連情報を提供するため。\n-対象サービスにおいてお客様のアカウント登録を行うとともに、お客様のアカウント管理を支援するため。\n-その他対象サービスに限らずお客様からのコメント、問い合わせおよび依頼に対応し、カスタマーサービスを提供するため。\n-技術上の告知、アップデート、セキュリティアラートおよびサポートのほか、事務手続上のメッセージをお客様に送信するため。\n-当社の主催するコンテストへの参加の処理およびその懸賞金の提供のため。\nb) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため\n-当社の法律上および規制上の義務を遵守するために当社に必要であるまたは許可されている他の一切の目的のため。\n-対象サービスに関連する傾向、利用状況およびアクティビティのモニタリングと分析のため。\n-対象サービスに関連する詐欺的、不正または違法な活動を検出し、調査しかつ/または防止するため。\n-法定代理人の許可を取得するため。\n-サービス内においてコンテキスト広告（ターゲティング広告を除く）を提供するため。\nc) 同意がある場合\n-対象サービスに関連する傾向、利用状況およびアクティビティをモニタリング・分析し、お客様のニーズを把握して優れたサービスをお客様に提供するため。たとえば、当社は、お客様がソーシャルメディア上で公開した対象サービスに関する感想や他の情報を、第三者が提供する分析ツールを用いて単独で、またはゲームプレイ情報などの他の情報と組み合わせて分析し、お客様のニーズを把握して新たなサービスの提供に役立てることがあります。\n-当社または当社のグループ会社もしくは取引先により提供される製品、サービス、提案、プロモーション、報奨およびイベント・キャンペーンなどに関してお客様に告知や通知（イベント・キャンペーンなどの当選通知を含みます）を行うため。また、お客様の興味関心に合うと当社が判断する広告、ニュース、情報その他のマーケティング資料を提供するため。\n-当社が第三者から取得した情報を連携または組み合わせたりすることによって各対象サービスごとの収益傾向の分析、お客様の属性別統計データの作成、新しいゲームやサービスの創出、その他の分析を行うため。\n-対象サービス内のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の関心の高い広告の提供\n  ・広告および当社のサービスに関連するお客様の傾向、利用状況などのモニタリングおよび分析\n  ・他のお客様から収集した情報とリンクまたは組み合わせることでお客様のニーズを理解したうえで、よりパーソナライズされた広告の提供\n  ・第三者のサービスプロバイダーから提供される情報とお客様から収集する情報を組み合わせることによる、本サービスを利用するユーザーのカテゴリー別傾向分析\n-対象サービス外のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の情報を当社が提携する広告会社の情報と組み合わせ、お客様の属性別統計データを作成すること\n  ・当社（グループ会社含む）のゲーム・サービスの広告をご案内するため、お客様の情報を当社のグループ会社、広告代理店および配信広告プラットフォームへ広告出稿および分析を目的として提供すること\n  ・その他の広告分析やパフォーマンスの測定を実施すること\n\nIII. 情報の共有\n当社は、第三者（国内外のグループ会社を含む当社の委託先を除きます）との間においてお客様の個人情報の共有、転送および交換を行いません。ただし、法律により許容されている場合、またはお客様から当社への同意がある場合は、この限りではありません。その場合でも、当社は、お客様の個人情報を第三者に販売することはありません。以上を遵守したうえで、当社は、以下のとおり、または本プライバシーポリシーの他の規定に基づいて、お客様に関する個人情報に当たらない情報（当社内でお客様を識別できない情報）を共有することがあります。\na) 他のユーザーとの間での対象サービスにおけるインタラクティブ形式の領域（マルチプレイヤー、チャットまたは共有機能など）への参加をお客様が選択することで、お客様に関する情報を、他のユーザーとの間で共有する場合。尚、個人を識別できるデータ（お客様の氏名など）を対象サービスにおけるユーザー名として使用することは、禁止します。\nb) 当社の従業員、グループ会社、ベンダー、コンサルタント、その他の外部サービスプロバイダーであって当社のための業務遂行に際し当該情報へのアクセスを必要とするもの（たとえば、開発者、支払処理業者、ウェブサイトホスティングサービス業者、または情報ストレージおよび処理サービス業者も含みます）との間で、必要な限度でお客様に関する情報を共有する場合。\nc) 法的手続または情報提供要請への応答に際し、その開示が、適用のある法律、規則もしくは規制（たとえば、政府当局、規制機関または司法裁判所も含みます）に従ったものであるかまたは他の何らかの態様でかかる法律、規則もしくは規制により義務付けられている場合。\nd) お客様の保護法益と当社の正当な利益を比較衡量したうえで、お客様の行為が当社のユーザー契約もしくはポリシーに反していると認めるに足る、または当社、当社ユーザーもしくは他者の権利、財産および安全を保護するに足る合理的根拠がある場合。\ne) 当社事業の全部もしくは一部の合併、会社資産の売却、資金調達、または他の会社による買収に関連してお客様に関する情報を共有する法的根拠がある場合。\nf) お客様の同意または指示に基づく場合。\n\nIV. 第三者により提供される広告・分析サービス\n当社は、第三者による分析サービスの提供および対象サービス内での広告の配信を許可することがあります。これらの者は、お客様のデバイスおよびお客様による対象サービスの利用に関する情報を自動的に収集するテクノロジーを用いることがあります。かかる情報には、IPアドレス、デバイス識別子、対象サービス内のページでの滞在時間、および対象サービス内でクリックされたリンクも含まれます。かかる情報は、対象サービスの機能の維持、改善および分析など、ならびにお客様の興味関心に合う可能性のあるコンテキスト広告およびターゲティング広告の配信などのために、当社および当該第三者により利用されることがあります。かかる第三者によるお客様の情報の利用には、当該第三者各自のプライバシーポリシーが適用されることとなり、当社は、第三者のプライバシーポリシーについて管理権を有しないとともに責任を負いません。\n対象サービスによっては、ゲームおよび収益化の傾向分析、プレイヤーのカテゴリー別の傾向分析、新たなゲームおよびサービスの作成、その他解析の実施のために、お客様の事前同意を得たうえで、対象サービスの利用状況に関する情報と、当社の他のゲームから収集された情報、当社グループ会社のゲームから収集された情報その他第三者から収集された情報とを組み合わせることがあります。また、当社は、 お客様の同意または指示に基づく場合、当社のゲームを通じてそのゲーム外で配信する広告のために一定の情報を利用することがあります。これには、お客様に関する情報と当社の広告パートナーから取得した情報との組み合わせによりプレイヤーのカテゴリー別の傾向分析を行うこと、当社（および当社のグループ会社）のゲームおよびサービスについての当該ゲーム外での広告配信のために、お客様に関する情報を当社の広告代理店および広告配信プラットフォームに提供すること、ならびに他の何らかの方法で広告解析およびパフォーマンスメトリックの解析を実施することも含まれます。\nインターネットを利用した広告の詳細、またはお客様のウェブ閲覧情報が行動ターゲティング広告の目的で使用されることのオプトアウトは、以下いずれかのURLからご利用できます：http://optout.networkadvertising.org\nhttp://www.aboutads.info/choices\nヨーロッパのユーザーは、以下URLにアクセスすることによりターゲット広告の受信をオプトアウトすることができます：\nhttp://www.youronlinechoices.eu/\n当社のサービスにアクセスするために使用する各デバイスおよびブラウザで選択を更新する必要があります。\n\nV. ソーシャル共有機能\n対象サービスにより、お客様におけるソーシャルメディアとの間での活動の共有または対象サービスのリンクを可能とするソーシャル共有機能その他のツールが提供されることがあります。かかる機能を利用することで、ソーシャルメディアプラットフォームにおけるお客様の設定内容に応じて、お客様の友だちまたは公衆との情報共有が可能となります。ソーシャル共有機能に関連するデータの収集および処理の目的ならびに範囲に関する詳細については、当該ソーシャルメディアプラットフォームのプライバシーポリシーをご確認ください。\n\nVI. セキュリティ\n当社は、お客様に関する情報の消失、盗難、不正なアクセス、開示、改変ならびに破損からの保護に資する技術上および組織上の合理的措置を講じています。ただし、インターネット上の伝送のいずれも、セキュアである旨を保証できるものではなく、当社は、お客様からインターネット上で当社に伝送されるいかなる個人情報についてもセキュリティを保証することはできません。\n\nVII. データの保管および削除\n対象サービスを通じて収集された個人情報その他のデータは、いずれも、上記II.の目的にとって必要がなくなった場合には、識別不能化または削除されます。ただし、さらなる保持が法律により義務付けられている場合は、この限りではありません。 \n\nVIII. 国外への転送\n当社がお客様から収集する個人情報の転送、保存および処理は、通常の場合、日本国内で行われますが、場合により、当社は、日本またはGDPRと同等のレベルの個人情報保護制度を有する外国や、その他お客様の国の法律と同一レベルでのデータ保護を提供できない外国の第三者に、お客様の個人情報を開示することがあります。また、当社は、お客様の個人情報を、当社（および当社のグループ会社）または外部事業者が日本国外に設置したサーバで保存する場合があります。ただし、当社は、国外を所在地とする第三者にお客様の個人情報を開示したり、国外でお客様の個人情報を保存したりする場合には、お客様の個人情報が保存され、または取り扱われる国または地域における個人情報の保護に関する制度を把握した上で、当該情報の利用が各地域の法律に従ったものとなる状況を確保するための合理的措置を講じます。\n当社は、以下の国・地域のいずれかに所在する第三者にお客様の情報を開示することがあります。\na) United States of America\nb) United Arab Emirates\nc) Republic of India\nd) Republik Indonesia\ne) Ukraine\nf) Commonwealth of Australia\ng) Canada\nh) Kingdom of Cambodia\ni) Republic of Singapore\nj) Swiss Confederation\nk) Kingdom of Thailand\nl) Republic of Korea\nm) Taiwan\nn) Republic of Turkey\no) New Zealand\np) Republic of the Philippines\nq) Federative Republic of Brazil\nr) Hong Kong\ns) Malaysia\nt) United Mexican States\nu) Lao People's Democratic Republic\nv) Argentine Republic\nw) Principality of Andorra\nx) State of Israel\ny) Oriental Republic of Uruguay\nz) United Kingdom of Great Britain and Northern Ireland\naa) Bailiwick of Jersey\nbb) Bailiwick of Guernsey\ncc) Isle of Man\ndd) Faroe Islands\nee) State of Qatar\nff) Republic of Costa Rica\ngg) Republic of Tunisia\nhh) Republic of Panama\nii) Republic of Peru\njj) Republic of South Africa\nkk) Kingdom of Morocco\nll) Mongolia\n\n前項の各国・地域における個人情報の保護に関する制度の概要は、以下をご参照ください。\na) 個人情報保護委員会 　https://www.ppc.go.jp/index.html\nb) 外国における個人情報の保護に関する制度等の調査 　https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/\nc) GDPR（一般データ保護規則）越境データ移転　https://www.ppc.go.jp/enforcement/infoprovision/laws/GDPR/\n\nIX. 第三者のサイト\n対象サービスには、第三者により運営されている他のウェブサイトまたはサービスへのリンクが含まれていることがあります。本プライバシーポリシーは対象サービスのみに適用されるものであり、第三者がそのウェブサイトを通じて収集、保管および利用することのある個人情報について当社が責任を負うことはできませんので、その旨ご留意ください。お客様において、訪問先の各ウェブサイトのプライバシーポリシーに必ず目を通す必要があります。\n\nX. プッシュ通知/アラート\n当社は、プッシュ通知またはアラートをお客様のデバイスに送信することがあります。お客様は、ご自身のデバイスの通知設定を変更することにより、かかるメッセージ送信をいつでも非アクティブ化することができます。プロモーション用コンテンツ付きのプッシュ通知またはアラートが当社から送信されるのは、当該メッセージの受領についてお客様のデバイスにおけるお客様による事前オプトインがあった後に限られます。\n\nXI. データ保護の権利\n当社は、お客様（お客様が未成年の場合においてはお客様の法定代理人も同様です）から請求があったときには、法令に従い、適切に対応いたします。適用法上のお客様の権利に含まれ得るものの例としては、以下が挙げられます。\na) お客様において、お客様の個人情報または当社によるその第三者への提供の記録の開示を当社に求める場合。\nb) 当社が保有するお客様の個人情報が事実でないために、お客様において当社にその訂正、追加または削除を求める場合。\nc) 当社が違法にお客様の個人情報を取得し、利用し、または第三者に提供しているとして、お客様において当社にその利用もしくは第三者への提供の停止または消去を求める場合。\nd) 当社においてお客様の個人情報を利用する必要がなくなった、または当社が保有するお客様の個人情報について漏えい・滅失・毀損などが生じた、その他当社によるお客様の個人情報の取扱いによってお客様の権利または正当な利益が害されるおそれがあるなどの理由により、お客様において当社に個人情報の利用もしくは第三者への提供の停止または消去を求める場合。\ne) また、お客様は、当社の正当な利益に基づくお客様の個人情報の処理について、いつでも異議申立ての権利を有します。\nf) 当社がお客様の個人情報をダイレクトマーケティングの目的で処理する場合、お客様は、いつでも当該処理について異議申立ての権利を有します。これには、ダイレクトマーケティングに関係する限りにおいてはお客様のカテゴリーの傾向分析目的も含みます。お客様がダイレクトマーケティング目的での処理に異議を申し立てた場合、その後、当社は、当該目的でのお客様の個人情報の処理を行いません。この場合においても、当社は、両者間で継続中の取引関係に関する限りにおいて、取引上または関係上のメッセージを引き続きお客様に送信することがあります。\ng) お客様はこれらの権利を行使することにより、当社から他のユーザーと区別および差別されることはありません。\nこれらの請求を行うには、下記XII.の当社問い合わせ窓口より、申請いただく必要があります。なお、法定代理人その他の代理人による請求の場合、別途当社の指定する代理権を証する資料を郵送または送信いただく必要があります。\nお客様に対する個人情報の利用目的の通知および個人情報またはその第三者への提供の記録の開示の請求につきましては、別途当社窓口よりご案内する金額の手数料をいただきます。\nお客様は、お客様からの依頼に対する当社の対応方法がお客様にとって満足のいくものではなかった場合には、お客様の居住国に不服を申し立てることのできる監督当局が存在する場合、当該監督当局に不服を申し立てることができます。当社は、かかる権利がお客様により行使された場合においても、異なるレベルのサービスを提供するわけではありません。ただし、お客様は、対象サービスの適切な機能の確保にとって必要となる情報の収集の削除または収集停止を依頼した場合には、対象サービスの全部または一部の利用ができなくなることがあります。\nお客様がバンダイナムコIDを有している場合においてご自身のアカウントの閲覧または削除を希望するときは、ご自身のバンダイナムコIDにサインインしたうえで、https://www.bandainamcoid.com/portal/resignの説明内容に沿って手続をお願いいたします。お客様がご自身のアカウントを削除した後においては、お客様のアカウントに関係する一切の個人情報が削除され、お客様はバンダイナムコIDサービスにアクセスできなくなります。\n\nXII. 問い合わせ先\n本プライバシーポリシーまたは当社の方針に関してご不明な点などがございましたら、以下の当社窓口までお問い合わせください。\n株式会社バンダイナムコオンライン\n担当部署：個人情報対外窓口\n〒108-0014 東京都港区芝5-37-8\nprivacy@bandainamco-ol.co.jp\n\n以上\n制定　2023年12月6日",
        "sort_id": 2
    },
    {
        "id": 7,
        "term_id": 2,
        "type": 1,
        "revision": 2,
        "platform": 3,
        "lang": "ja_JP",
        "title": "『BLUE PROTOCOL』プライバシーポリシー",
        "desc": "BLUE PROTOCOLをプレイするためには、以下の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "『BLUE PROTOCOL』プライバシーポリシー\n\n本プライバシーポリシーは、株式会社バンダイナムコオンライン（以下「当社」といいます）のウェブサイト、ゲーム、モバイルアプリケーションその他のオンライン製品およびサービス（総称して以下「対象サービス」といいます）をお客様が利用した場合または他の何らかの形にてお客様と当社との間でやり取りがあった場合におけるお客様に関する情報の当社による収集、保管、利用および開示の方法について、説明するものです。当社は、EU一般データ保護規則の目的上、お客様の個人情報のデータ管理者となります。\n当社は、本プライバシーポリシーを随時変更することがあります。当社は、何らかの変更を加えた場合には、本プライバシーポリシーの日付を更新することでその旨をお客様に告知するとともに、場合により追加的な告知（対象サービスのホームページへの告知文の追加またはお客様への通知の送付などによるもの）をお客様に対し行うことがあります。当社における情報の取扱方法、およびご自身のプライバシー保護に資する方法に関し、最新情報を得られるよう、対象サービスへのアクセスのたびにプライバシーポリシーを確認しておくことをお勧めします。\n\nI. 情報の収集\n当社がお客様から収集する情報は、対象サービスごとに異なります。 当社は、識別子、インターネットまたはその他類似のネットワーク活動、対象サービスの利用履歴、位置情報などを収集します。詳細は以下に記載されています。また、収集目的は、「II. 情報の利用」のセクションに記載されています。\n\n1. お客様から当社に提供される情報\n当社は、お客様から当社に直接提供される情報を収集します。たとえば、アカウントの作成、他のユーザーとのやり取り、当社サーバへの画像のアップロード、カスタマーサポートの依頼、ニュースレターの受信登録、アンケートへの参加その他の方法での当社とのやり取りがお客様によりなされた場合に、当社による情報収集が行われます。当社が収集することのある情報の種類には、お客様のユーザー名、パスワード、電子メールアドレス、写真その他お客様が提供を選択した一切の情報が含まれます。\n\n2. 対象サービスのお客様による利用時に当社が自動的に収集する情報\nお客様による対象サービスへのアクセスまたはその利用に際し、当社は、お客様に関する情報を自動的に収集します。その例としては、以下のものが挙げられます。\na)  利用状況に関する情報：当社は、お客様による対象サービスの利用に関する情報を収集します。これには、当社またはゲームコンソールを提供する事業者がゲーム開始時にお客様へ自動的に付与するゲーミングサービスID、コンプリート済みのレベル、ゲームスコア、対象サービスの利用に費やした時間その他のゲームプレイ情報も含まれます。\nb)  ログ情報：当社は、お客様による対象サービスの利用に関する情報をログに記録します。これには、お客様のブラウザの種別および言語、アクセス回数、閲覧ページ、お客様のIPアドレス、ならびに対象サービスへの移動前にお客様が訪問したウェブサイトも含まれます。\nc)  ハードウェア情報：当社は、お客様が対象サービスへのアクセスに用いたコンピュータ、スマートフォンその他のデバイス（以下「デバイス」といいます）に関する情報を収集します。これには、ハードウェアの型番、オペレーティングシステムおよびバージョン、ブラウザ、モバイルネットワーク情報、デバイスにインストールされている他の対象サービス（モバイルアプリケーション）、MACアドレス、IPアドレス、国際移動体装置識別番号（IMEI）その他の一意デバイス識別子であってお客様のデバイスのオペレーティングシステムにより提供されるものも含まれます。\nd)  位置情報：当社は、お客様のデバイスの地理的位置に関する情報を、対象サービスのお客様による利用の都度、またはかかる情報の収集について他の何らかの方法によるお客様の同意があった都度、収集することがあります。お客様は、ご自身のデバイス上の設定を用いて、こうした位置情報の収集の同意を撤回（拒否）することができます。お客様の位置情報は、収集前に対象サービスにおいて指定された期間にわたり、保存されます。\ne)  クッキー（Cookie）その他のトラッキング技術により収集される情報：当社は、様々な技術を用いて情報（個人情報も含む）を収集しています。その例としては、お客様のデバイスへのクッキーの送信も含まれます。クッキーは、お客様のデバイスのハードドライブ上またはメモリー内に保存される小さなデータファイルであり、対象サービスおよびお客様の体験の向上、対象サービスにおいて人気のある領域および機能の特定、ならびに訪問数の算定に際し、当社の助けとなるものです。クッキーに関する詳細については、当社のクッキーポリシー（https://blue-protocol.com/privacy/cookies 及びhttps://blue-protocol.com/privacy/cookies_support） をご覧ください。\nf)  お客様の傾向分析情報：当社は、お客様の嗜好、特性、行動および本サービスの使用実績などの情報に基づいて傾向分析をし、お客様の同意を得て、その分析結果を他の情報と組み合わせて利用します。\n\n3. 当社が第三者から収集する情報\n当社は、対象サービスの実施に必要である限りにおいて、第三者からも情報を取得することがあり、また、当該情報同士を組み合わせたり、当該情報と対象サービスを通じて収集した情報とを組み合わせたりすることもあります。たとえば、当社は、ゲームコンソールまたはiOSもしくはAndroidその他のプラットフォームを提供する事業者（以下「プラットフォーマー」といいます）から、お客様のゲームランキングおよび達成状況を収集することがあります。お客様が第三者のプラットフォーム（FacebookやTwitterなど）を通じてアカウントを作成またはログインした場合、当社は、当該プラットフォームがお客様から得た同意に従って、お客様の名前、誕生日、プロフィール写真などの特定の情報にアクセスすることができます。また、お客様がソーシャルメディア上で対象サービスに関する感想や他の情報を公開した場合、当社は、当該公開情報（ただし、当該ソーシャルメディア上でお客様が使用しているユーザー名は含みません。）を収集することがあります。さらに、お客様がアプリ購入を完了した場合、当社は、お客様のデバイスのオペレーティングシステムを提供する事業者（以下「OSプロバイダー」といいます）が当社に代わって当該購入を処理する際に、当該OSプロバイダーからお客様に関する情報を収集することがあります。ただし、当社は、OSプロバイダーからお客様の支払方法に関する情報を受領することはありません。\n\nII. 情報の利用\n当社は、お客様の同意がある場合、または次のいずれかにとって必要な範囲である場合に限り、お客様の情報の収集、保管および利用を行います。(i) お客様と当社との間の契約を履行するため、(ii) 当社の法的義務を遵守するため、または (iii) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため。当社は、当社の正当な事業上の利益とお客様の保護法益との衡量を慎重に行っています。この利益衡量に関してご不明な点がありましたら、後述の問い合わせ先宛てにご連絡ください。\n特に、当社（または当社の委託先）は、お客様に関する情報を、以下の目的のため、当該目的の達成に必要とされる期間にわたり、収集、保管および利用することがあります。\n\na)  お客様と当社との間の契約を履行するため\n-対象サービスの提供のため。\n-対象サービスに関するお客様からのコメント、問い合わせおよび依頼に対応し、関連情報を提供するため。\n-対象サービスにおいてお客様のアカウント登録を行うとともに、お客様のアカウント管理を支援するため。\n-その他対象サービスに限らずお客様からのコメント、問い合わせおよび依頼に対応し、カスタマーサービスを提供するため。\n-技術上の告知、アップデート、セキュリティアラートおよびサポートのほか、事務手続上のメッセージをお客様に送信するため。\n-当社の主催するコンテストへの参加の処理およびその懸賞金の提供のため。\nb) 当社の正当な利益（当社のグローバル事業の運営、評価および改善も含む）のため\n-当社の法律上および規制上の義務を遵守するために当社に必要であるまたは許可されている他の一切の目的のため。\n-対象サービスに関連する傾向、利用状況およびアクティビティのモニタリングと分析のため。\n-対象サービスに関連する詐欺的、不正または違法な活動を検出し、調査しかつ/または防止するため。\n-法定代理人の許可を取得するため。\n-サービス内においてコンテキスト広告（ターゲティング広告を除く）を提供するため。\nc) 同意がある場合\n-対象サービスに関連する傾向、利用状況およびアクティビティをモニタリング・分析し、お客様のニーズを把握して優れたサービスをお客様に提供するため。たとえば、当社は、お客様がソーシャルメディア上で公開した対象サービスに関する感想や他の情報を、第三者が提供する分析ツールを用いて単独で、またはゲームプレイ情報などの他の情報と組み合わせて分析し、お客様のニーズを把握して新たなサービスの提供に役立てることがあります。\n-当社または当社のグループ会社もしくは取引先により提供される製品、サービス、提案、プロモーション、報奨およびイベント・キャンペーンなどに関してお客様に告知や通知（イベント・キャンペーンなどの当選通知を含みます）を行うため。また、お客様の興味関心に合うと当社が判断する広告、ニュース、情報その他のマーケティング資料を提供するため。\n-当社が第三者から取得した情報を連携または組み合わせたりすることによって各対象サービスごとの収益傾向の分析、お客様の属性別統計データの作成、新しいゲームやサービスの創出、その他の分析を行うため。\n-対象サービス内のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の関心の高い広告の提供\n  ・広告および当社のサービスに関連するお客様の傾向、利用状況などのモニタリングおよび分析\n  ・他のお客様から収集した情報とリンクまたは組み合わせることでお客様のニーズを理解したうえで、よりパーソナライズされた広告の提供\n  ・第三者のサービスプロバイダーから提供される情報とお客様から収集する情報を組み合わせることによる、本サービスを利用するユーザーのカテゴリー別傾向分析\n-対象サービス外のターゲティング広告出稿のため（以下を含む）。\n  ・お客様の情報を当社が提携する広告会社の情報と組み合わせ、お客様の属性別統計データを作成すること\n  ・当社（グループ会社含む）のゲーム・サービスの広告をご案内するため、お客様の情報を当社のグループ会社、広告代理店および配信広告プラットフォームへ広告出稿および分析を目的として提供すること\n  ・その他の広告分析やパフォーマンスの測定を実施すること\n\nIII. 情報の共有\n当社は、第三者（国内外のグループ会社を含む当社の委託先を除きます）との間においてお客様の個人情報の共有、転送および交換を行いません。ただし、法律により許容されている場合、またはお客様から当社への同意がある場合は、この限りではありません。その場合でも、当社は、お客様の個人情報を第三者に販売することはありません。以上を遵守したうえで、当社は、以下のとおり、または本プライバシーポリシーの他の規定に基づいて、お客様に関する個人情報に当たらない情報（当社内でお客様を識別できない情報）を共有することがあります。\na) 他のユーザーとの間での対象サービスにおけるインタラクティブ形式の領域（マルチプレイヤー、チャットまたは共有機能など）への参加をお客様が選択することで、お客様に関する情報を、他のユーザーとの間で共有する場合。尚、個人を識別できるデータ（お客様の氏名など）を対象サービスにおけるユーザー名として使用することは、禁止します。\nb) 当社の従業員、グループ会社、ベンダー、コンサルタント、その他の外部サービスプロバイダーであって当社のための業務遂行に際し当該情報へのアクセスを必要とするもの（たとえば、開発者、支払処理業者、ウェブサイトホスティングサービス業者、または情報ストレージおよび処理サービス業者も含みます）との間で、必要な限度でお客様に関する情報を共有する場合。\nc) 法的手続または情報提供要請への応答に際し、その開示が、適用のある法律、規則もしくは規制（たとえば、政府当局、規制機関または司法裁判所も含みます）に従ったものであるかまたは他の何らかの態様でかかる法律、規則もしくは規制により義務付けられている場合。\nd) お客様の保護法益と当社の正当な利益を比較衡量したうえで、お客様の行為が当社のユーザー契約もしくはポリシーに反していると認めるに足る、または当社、当社ユーザーもしくは他者の権利、財産および安全を保護するに足る合理的根拠がある場合。\ne) 当社事業の全部もしくは一部の合併、会社資産の売却、資金調達、または他の会社による買収に関連してお客様に関する情報を共有する法的根拠がある場合。\nf) お客様の同意または指示に基づく場合。\n\nIV. 第三者により提供される広告・分析サービス\n当社は、第三者による分析サービスの提供および対象サービス内での広告の配信を許可することがあります。これらの者は、お客様のデバイスおよびお客様による対象サービスの利用に関する情報を自動的に収集するテクノロジーを用いることがあります。かかる情報には、IPアドレス、デバイス識別子、対象サービス内のページでの滞在時間、および対象サービス内でクリックされたリンクも含まれます。かかる情報は、対象サービスの機能の維持、改善および分析など、ならびにお客様の興味関心に合う可能性のあるコンテキスト広告およびターゲティング広告の配信などのために、当社および当該第三者により利用されることがあります。かかる第三者によるお客様の情報の利用には、当該第三者各自のプライバシーポリシーが適用されることとなり、当社は、第三者のプライバシーポリシーについて管理権を有しないとともに責任を負いません。\n対象サービスによっては、ゲームおよび収益化の傾向分析、プレイヤーのカテゴリー別の傾向分析、新たなゲームおよびサービスの作成、その他解析の実施のために、お客様の事前同意を得たうえで、対象サービスの利用状況に関する情報と、当社の他のゲームから収集された情報、当社グループ会社のゲームから収集された情報その他第三者から収集された情報とを組み合わせることがあります。また、当社は、 お客様の同意または指示に基づく場合、当社のゲームを通じてそのゲーム外で配信する広告のために一定の情報を利用することがあります。これには、お客様に関する情報と当社の広告パートナーから取得した情報との組み合わせによりプレイヤーのカテゴリー別の傾向分析を行うこと、当社（および当社のグループ会社）のゲームおよびサービスについての当該ゲーム外での広告配信のために、お客様に関する情報を当社の広告代理店および広告配信プラットフォームに提供すること、ならびに他の何らかの方法で広告解析およびパフォーマンスメトリックの解析を実施することも含まれます。\nインターネットを利用した広告の詳細、またはお客様のウェブ閲覧情報が行動ターゲティング広告の目的で使用されることのオプトアウトは、以下いずれかのURLからご利用できます：http://optout.networkadvertising.org\nhttp://www.aboutads.info/choices\nヨーロッパのユーザーは、以下URLにアクセスすることによりターゲット広告の受信をオプトアウトすることができます：\nhttp://www.youronlinechoices.eu/\n当社のサービスにアクセスするために使用する各デバイスおよびブラウザで選択を更新する必要があります。\n\nV. ソーシャル共有機能\n対象サービスにより、お客様におけるソーシャルメディアとの間での活動の共有または対象サービスのリンクを可能とするソーシャル共有機能その他のツールが提供されることがあります。かかる機能を利用することで、ソーシャルメディアプラットフォームにおけるお客様の設定内容に応じて、お客様の友だちまたは公衆との情報共有が可能となります。ソーシャル共有機能に関連するデータの収集および処理の目的ならびに範囲に関する詳細については、当該ソーシャルメディアプラットフォームのプライバシーポリシーをご確認ください。\n\nVI. セキュリティ\n当社は、お客様に関する情報の消失、盗難、不正なアクセス、開示、改変ならびに破損からの保護に資する技術上および組織上の合理的措置を講じています。ただし、インターネット上の伝送のいずれも、セキュアである旨を保証できるものではなく、当社は、お客様からインターネット上で当社に伝送されるいかなる個人情報についてもセキュリティを保証することはできません。\n\nVII. データの保管および削除\n対象サービスを通じて収集された個人情報その他のデータは、いずれも、上記II.の目的にとって必要がなくなった場合には、識別不能化または削除されます。ただし、さらなる保持が法律により義務付けられている場合は、この限りではありません。 \n\nVIII. 国外への転送\n当社がお客様から収集する個人情報の転送、保存および処理は、通常の場合、日本国内で行われますが、場合により、当社は、日本またはGDPRと同等のレベルの個人情報保護制度を有する外国や、その他お客様の国の法律と同一レベルでのデータ保護を提供できない外国の第三者に、お客様の個人情報を開示することがあります。また、当社は、お客様の個人情報を、当社（および当社のグループ会社）または外部事業者が日本国外に設置したサーバで保存する場合があります。ただし、当社は、国外を所在地とする第三者にお客様の個人情報を開示したり、国外でお客様の個人情報を保存したりする場合には、お客様の個人情報が保存され、または取り扱われる国または地域における個人情報の保護に関する制度を把握した上で、当該情報の利用が各地域の法律に従ったものとなる状況を確保するための合理的措置を講じます。\n当社は、以下の国・地域のいずれかに所在する第三者にお客様の情報を開示することがあります。\na) United States of America\nb) United Arab Emirates\nc) Republic of India\nd) Republik Indonesia\ne) Ukraine\nf) Commonwealth of Australia\ng) Canada\nh) Kingdom of Cambodia\ni) Republic of Singapore\nj) Swiss Confederation\nk) Kingdom of Thailand\nl) Republic of Korea\nm) Taiwan\nn) Republic of Turkey\no) New Zealand\np) Republic of the Philippines\nq) Federative Republic of Brazil\nr) Hong Kong\ns) Malaysia\nt) United Mexican States\nu) Lao People's Democratic Republic\nv) Argentine Republic\nw) Principality of Andorra\nx) State of Israel\ny) Oriental Republic of Uruguay\nz) United Kingdom of Great Britain and Northern Ireland\naa) Bailiwick of Jersey\nbb) Bailiwick of Guernsey\ncc) Isle of Man\ndd) Faroe Islands\nee) State of Qatar\nff) Republic of Costa Rica\ngg) Republic of Tunisia\nhh) Republic of Panama\nii) Republic of Peru\njj) Republic of South Africa\nkk) Kingdom of Morocco\nll) Mongolia\n\n前項の各国・地域における個人情報の保護に関する制度の概要は、以下をご参照ください。\na) 個人情報保護委員会 　https://www.ppc.go.jp/index.html\nb) 外国における個人情報の保護に関する制度等の調査 　https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/\nc) GDPR（一般データ保護規則）越境データ移転　https://www.ppc.go.jp/enforcement/infoprovision/laws/GDPR/\n\nIX. 第三者のサイト\n対象サービスには、第三者により運営されている他のウェブサイトまたはサービスへのリンクが含まれていることがあります。本プライバシーポリシーは対象サービスのみに適用されるものであり、第三者がそのウェブサイトを通じて収集、保管および利用することのある個人情報について当社が責任を負うことはできませんので、その旨ご留意ください。お客様において、訪問先の各ウェブサイトのプライバシーポリシーに必ず目を通す必要があります。\n\nX. プッシュ通知/アラート\n当社は、プッシュ通知またはアラートをお客様のデバイスに送信することがあります。お客様は、ご自身のデバイスの通知設定を変更することにより、かかるメッセージ送信をいつでも非アクティブ化することができます。プロモーション用コンテンツ付きのプッシュ通知またはアラートが当社から送信されるのは、当該メッセージの受領についてお客様のデバイスにおけるお客様による事前オプトインがあった後に限られます。\n\nXI. データ保護の権利\n当社は、お客様（お客様が未成年の場合においてはお客様の法定代理人も同様です）から請求があったときには、法令に従い、適切に対応いたします。適用法上のお客様の権利に含まれ得るものの例としては、以下が挙げられます。\na) お客様において、お客様の個人情報または当社によるその第三者への提供の記録の開示を当社に求める場合。\nb) 当社が保有するお客様の個人情報が事実でないために、お客様において当社にその訂正、追加または削除を求める場合。\nc) 当社が違法にお客様の個人情報を取得し、利用し、または第三者に提供しているとして、お客様において当社にその利用もしくは第三者への提供の停止または消去を求める場合。\nd) 当社においてお客様の個人情報を利用する必要がなくなった、または当社が保有するお客様の個人情報について漏えい・滅失・毀損などが生じた、その他当社によるお客様の個人情報の取扱いによってお客様の権利または正当な利益が害されるおそれがあるなどの理由により、お客様において当社に個人情報の利用もしくは第三者への提供の停止または消去を求める場合。\ne) また、お客様は、当社の正当な利益に基づくお客様の個人情報の処理について、いつでも異議申立ての権利を有します。\nf) 当社がお客様の個人情報をダイレクトマーケティングの目的で処理する場合、お客様は、いつでも当該処理について異議申立ての権利を有します。これには、ダイレクトマーケティングに関係する限りにおいてはお客様のカテゴリーの傾向分析目的も含みます。お客様がダイレクトマーケティング目的での処理に異議を申し立てた場合、その後、当社は、当該目的でのお客様の個人情報の処理を行いません。この場合においても、当社は、両者間で継続中の取引関係に関する限りにおいて、取引上または関係上のメッセージを引き続きお客様に送信することがあります。\ng) お客様はこれらの権利を行使することにより、当社から他のユーザーと区別および差別されることはありません。\nこれらの請求を行うには、下記XII.の当社問い合わせ窓口より、申請いただく必要があります。なお、法定代理人その他の代理人による請求の場合、別途当社の指定する代理権を証する資料を郵送または送信いただく必要があります。\nお客様に対する個人情報の利用目的の通知および個人情報またはその第三者への提供の記録の開示の請求につきましては、別途当社窓口よりご案内する金額の手数料をいただきます。\nお客様は、お客様からの依頼に対する当社の対応方法がお客様にとって満足のいくものではなかった場合には、お客様の居住国に不服を申し立てることのできる監督当局が存在する場合、当該監督当局に不服を申し立てることができます。当社は、かかる権利がお客様により行使された場合においても、異なるレベルのサービスを提供するわけではありません。ただし、お客様は、対象サービスの適切な機能の確保にとって必要となる情報の収集の削除または収集停止を依頼した場合には、対象サービスの全部または一部の利用ができなくなることがあります。\nお客様がバンダイナムコIDを有している場合においてご自身のアカウントの閲覧または削除を希望するときは、ご自身のバンダイナムコIDにサインインしたうえで、https://www.bandainamcoid.com/portal/resignの説明内容に沿って手続をお願いいたします。お客様がご自身のアカウントを削除した後においては、お客様のアカウントに関係する一切の個人情報が削除され、お客様はバンダイナムコIDサービスにアクセスできなくなります。\n\nXII. 問い合わせ先\n本プライバシーポリシーまたは当社の方針に関してご不明な点などがございましたら、以下の当社窓口までお問い合わせください。\n株式会社バンダイナムコオンライン\n担当部署：個人情報対外窓口\n〒108-0014 東京都港区芝5-37-8\nprivacy@bandainamco-ol.co.jp\n\n以上\n制定　2023年12月6日",
        "sort_id": 2
    },
    {
        "id": 1001,
        "term_id": 1001,
        "type": 2,
        "revision": 1,
        "platform": 1,
        "lang": "ja_JP",
        "title": "プレミアムバンダイ　会員規約",
        "desc": "リアルグッズの購入にあたり、以下の「プレミアムバンダイ」会員規約の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "プレミアムバンダイ　会員規約\n株式会社BANDAI SPIRITS（以下「弊社」といいます。）の運営するサイト、プレミアムバンダイ（以下「本サービス」といいます。）の会員規約（以下｢本規約｣といいます。）を以下の通り定めます。会員に登録していただくには、以下の条項をよくお読みのうえ、同意していただくことが必要です。また、未成年者の場合は、保護者の同意を得る必要があります。\n\n第１章　総則\n第１条　定義\n「会員」とは、本規約に同意いただいた上、弊社所定の手続に従い会員登録を申請し、弊社がこれを承認した方をいいます。\n「本サービス」とは、弊社が運営するショッピングポータルサイト『プレミアムバンダイ』における、会員に向けた商品の販売、会員特典の提供その他のサービス全般を指します。\n「プレミアムポイント」（以下「ポイント」といいます。）とは、本規約 第3章で定めるルールに基づき、会員に付与されるポイントをいいます。\n第２条　会員登録\n1. 入会希望者は、本サービスの会員登録ページから、別途弊社の指定する方法に従い会員登録申請を行い、お一人につき、一つの会員IDを無料にて取得することができるものとします。また、弊社からの登録完了のメールの到着をもって登録の承認とさせていただきます。尚、登録完了までにはお時間がかかる場合がございます。\n2. 会員登録および本サービスの利用は、日本に住所登録もしくは居住地登録をしている方に限ります。\n3. 弊社は、以下の各号のいずれかに該当する場合、会員登録の承認を拒み又は取消すことができるものとします。\n尚、必要に応じて、公的証明（マイナンバーカード・免許証・保険証・パスポート等）による申請内容又は会員登録情報の確認をさせていただく場合があります。\n(1). 入会希望者が過去に本規約等に反する行為をしたことなどにより、会員登録の取消などの処分を受けていることが判明した場合\n(2). 入会希望者の申請内容に事実に反する事項が含まれている場合\n(3). 公的証明の提示にご協力いただけない場合\n(4). 営利目的・転売目的で本サービスの利用をし又は利用しようとしていると弊社が判断した場合\n(5).　反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者）とのいずれかとの何らかの交流若しくは関与があると弊社が判断した場合\n(6). その他登録申請を承認することが不適当であると弊社が判断する場合\n第３条　本サービスの利用\n会員は、本規約又は弊社が別途定めるルール等に従い、本サービスを利用することができるものとします。\n\n第２章 商品購入\n第４条　商品の購入\n1. 会員は、本サービスを利用して、商品またはサービス（以下「商品等」といいます。）を購入することができます。\n2. 会員は、商品等の購入を希望する場合、弊社が指定する方法に従って商品の購入を申込むものとします。\n3. 商品購入に関する売買契約は、商品の注文が完了した時点（会員により登録されたメールアドレス宛に「注文内容のご確認」メールが送られます。別途弊社が売買契約の成立時期を定めた場合はこの限りではありません。）で成立することとします。但し、弊社は、商品の生産中止等、やむを得ない事情がある場合は、会員に通知することにより既に成立した売買契約を取り消すことができるものとします。\n4. 弊社は、個々の注文画面又はご利用ガイドその他の本サービス上の画面において定めがある場合を除き、会員都合での商品等の購入申込の撤回は一切受け付けないものとします。\n5. 弊社では、正確な商品情報を掲載するよう最善の努力をしますが、万が一誤った価格表記がされており、それに基づいた注文をいただいた場合は、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。\n6. 本サービス利用に関して会員による不正行為もしくは不適当な行為があった場合、または弊社が配送した商品を、理由の如何を問わず会員が受領しなかった場合、弊社は売買契約の解除、その他適切な措置を取ることができる（会員が商品代金を支払い済みの場合を含みます。）ものとします。 この場合に弊社に生じた費用（商品の配送料その他手数料を含みますが、これらに限りません。）は会員の負担とします。\n7. 弊社は、一定期間におけるお取引額が高額となる場合、ご連絡をさせていただくことがございます。会員本人へのご連絡がつかない場合、弊社は商品等の購入申込の取消、売買契約の解除その他適切な措置を取ることができるものとします。\n8. 本サービスによる商品等の配送先は、日本国内に限ります。\n9. インターネット上の障害、その他弊社に責任のない原因により、商品等購入の申込みが受理できなかった場合、弊社はその責任を負いません。\n第５条　商品の配送\n1. 商品の配送は、弊社が指定する配送業者による配送便で行います。なお、配送料は、商品の注文画面の指定に従い会員のご負担となります。\n2. 弊社は、会員の申込を受け、配送準備開始時点の配送先や配送日時の指定等を配送業者に取り次ぐこととします。\n3. 商品によっては、諸般の事情で、あらかじめご案内した納期が変更される場合や品切れ等により納期が遅れる場合、また注文に応じられない場合もあります。これらの場合でも、弊社は何ら賠償の責任を負わないものとします。\n4. 弊社が発送した商品が会員により受領されなかった場合（受取拒否又は長期不在等により受け取られなかった場合を含みます。）、弊社は、これによって弊社に生じた費用（再配達費用等）を当該会員に請求できるものとします。\n5. 弊社は、会員により受領されなかった商品を一定期間保管後に廃棄その他の処分をすることができるものとします。\n第６条　決済方法\n1. 商品等のお支払い金額は、商品購入代金、送料、決済手数料および消費税等の合計となります。\n2. 本サービスによって購入された商品等のお支払いに関しては、会員本人名義のクレジットカード（弊社が承諾するものに限ります。）によるお支払い、その他弊社が別途認めるお支払方法によるものとします。\n3. クレジットカードでのお支払いの場合は、会員がカード会社との間で別途契約する条件に従うものとします。また、会員と当該クレジットカード会社等の間で紛争が発生した場合は、当該当事者双方で解決するものとし、弊社には一切責任はないものとします。\n4. クレジットカードでお支払いの場合、商品等購入の申込時にカード会社へご利用可能の問い合わせを行います。なお、購入申込から商品発送までに一定の期間を要する場合、再度クレジットカード会社へご利用可能の問い合わせをさせていただく場合がございます。問い合わせの結果、カード会社よりご利用不可との連絡が入った場合、ご購入いただけない場合がございます。\n第７条　商品のキャンセル・返品等\n1. 会員は、原則として、商品等の注文をキャンセルすることは出来ません。但し、発送前の商品等に関しては、弊社が別途定める事由に該当する場合に限り、キャンセルすることができます。\n2. 商品等の返品及び交換等は、商品不良、品違い又は数量違い等の弊社の責めに帰すべき場合にのみ承ります。但し、商品の返品については、弊社が商品の交換品を準備できない場合に限られるものとします。\n第８条　サービスに関する免責\n1. 商品等の色合い、形状については、モニターの設定等により、画面表示と実物とで異なる場合があります。\n2. 弊社は、会員が入力した連絡先へ連絡すること、および商品等購入の際指示した発送先に商品を配送等することにより免責されるものとします。\n3. 弊社は、本サービス上での商品説明あるいは表記については、正確性、完全性、最新性等に関し最善を尽くしますが、一切誤りがないことを保証するものではありません。\n4. 弊社は、法律上の請求原因の如何を問わず、本サービスの利用から生じる如何なる損害、損失、不利益に関して責任を負わないものとします。また、本サービスにおいて売買される商品から生じた損害、損失、不利益に関して責任を負わないものとします。\n\n第３章　プレミアムポイント\n第９条　ポイントの付与\n1. ポイントの付与対象は、原則として商品代金（税込）となりますが、対象となる商品の新規設定、変更、終了等は全て弊社の判断にて行います。\n2. ポイントの付与率・付与額は、キャンペーン、商品、ショップにより異なり、当該付与ポイントはサイト上に明記されます。ポイントの付与率・付与額は予告なく変更となる場合があります。\n3. ポイントの付与、利用可能時期は、付与対象となる商品の配送完了が確認された日の翌日以降、あるいは付与対象となるキャンペーン等への当選が確認された日の翌日以降とし、かつ当社が別途定めるルールに従い付与されることとなります。\n第１０条　ポイントの管理\n1. 弊社は、弊社所定の方法により、会員が獲得したポイント数、会員が利用したポイント数および、ポイント残高を、会員に告知します。\n2. 第1項のポイント数に関する最終的な決定は弊社が行うものとし、会員はこれに従うものとします。\n第１１条　ポイントの譲渡禁止\n付与されたポイントは、いかなる場合にも、会員間での移動、譲渡、貸与、累積等はできません。\n第１２条　決済におけるポイントの利用\n1. 会員は、保有するポイントを、本サービスでの商品等の購入ならびに、商品等の購入に伴い発生する送料、決済手数料、消費税にご利用いただけます。\n2. 会員が、ポイントを使用する場合の換価率は、原則として1ポイント＝1円とします。\n第１３条　キャンセル時のポイントの取扱いについて\n1. 会員が、商品代金の一部または全部の決済にポイントを利用し、その後対象となる売買契約を、第７条によりキャンセル等をした場合、当該ポイントは会員に返還されます。なお、返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n2.(1). 第７条によりキャンセル等された売買契約に基づいてポイントの付与がなされている場合には、当該ポイントの付与はキャンセル等と同時に取り消しとさせていただきます。\n(2). キャンセル等に伴って商品等代金をお返しする場合、お返しする金額は実際にお支払頂いた金額とし、ポイント充当額は含まないものとします。ただし、取り消し前に、前項の取り消し対象のポイントをご利用している場合には、別途弊社の定める方法にて精算させていただきます。\n第１４条　商品代金変更等の場合のポイントの取扱いについて\n1. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品代金が何らかの事情で減額になった場合は、以下の対応を行うものとします。なお、ポイントの返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n(1). 会員が、商品代金の一部についてポイントを利用した場合、まず他の支払方法による代金返還が行われ、それでも返還を必要とする金額に不足がある場合には、当該不足額についてポイントの返還が行われます。\n(2). 会員が、商品代金の全部についてポイントを利用した場合、差額分のポイントを返還します。\n2. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品等代金が何らかの事情で増額になった場合、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。会員が変更後の価格での購入申込みをしない場合、利用ポイントを返還致します。\n第１５条　ポイントの失効\n1. 最後にポイントの変動（ポイントの利用または付与）があった日の翌日から起算して一年間（以下本条において「ポイント有効期間」といいます。）、ポイントの変動及び商品等のお申込のいずれも生じなかったときは、ポイント有効期間の満了を以って、その時点で有効な累積ポイントは失効するものとします。\n2. 会員が、退会した場合、その時点でポイントは失効します。\n3. 弊社は、失効したポイントについて何らの補償も行わず、一切の責任を負いません。\n第１６条　第三者による使用\n1. ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはできません。\n2. 弊社は、ポイント利用時に入力された会員IDおよびパスワードが、会員登録されたものと一致することを弊社が所定の方法により確認した場合には、当該会員による利用とみなします。それが第三者による不正利用であった場合でも、弊社は利用されたポイントを返還しません。会員に生じた損害についても一切責任を負いません。\n\n第４章　その他\n第１７条　本サービスの利用停止、会員登録の取消、ポイントの抹消\n1. 弊社は、会員が以下の各号のいずれかに該当する場合、会員に事前通知することなく本サービスの利用停止（商品等の購入申込の取消、売買契約の解除を含みます）、会員登録の取消またはポイントの一部もしくは全部を抹消することができるものとします。\n(1). 第２条（会員登録）第２項各号の事由に該当する場合\n(2). 本サービスに関する料金などの支払債務の履行遅延、その他の不履行があった場合\n(3). 第１８条（禁止事項）の行為を行った場合\n(4). 本サービスを1年以上ご利用されなかった場合\n(5). 会員が死亡した場合\n(6). その他本規約または別途定めるルール等に違反した場合\n2. 前項により会員登録が取消された場合、それ以降、本サービスは利用することができなくなります。\n第１８条　禁止事項\n会員は以下の行為を行ってはならないものとします。\n(1). 本サービス利用の際に虚偽の登録内容を申請する行為\n(2). 本サービスの運営を妨げ、その他本サービスに支障をきたすおそれのある行為\n(3). クレジットカードを不正に使用して本サービスを利用する行為\n(4). 会員IDおよびパスワードを不正に使用する行為\n(5). 法的な責任を超えた不当な要求行為\n(6). 他の会員、第三者もしくは弊社に迷惑、不利益もしくは損害を与える行為、またはそれらのおそれのある行為\n(7). 他の会員、第三者もしくは弊社の著作権等の知的財産権、プライバシーその他の権利を侵害する行為、またはそれらのおそれのある行為\n(8). 本規約に違反する行為、公序良俗に反する行為その他法令に違反する行為、またはそれらのおそれのあると弊社が判断した行為\n(9). その他、弊社が不適当と判断する行為\n第１９条　会員IDおよびパスワードの管理\n1. 会員は、会員自身で設定した会員IDおよびパスワードの管理責任を負うものとします。 また、会員IDおよびパスワードを用いて弊社に対して行われた意思表示は、その会員IDおよびパスワードに該当する会員の有効な意思表示とみなし、これにより生ずる支払い等はすべてその会員の責任となります。\n2. 会員は、会員IDおよびパスワードを第三者に譲渡、貸与、開示してはならないものとします。\n3. 会員は、会員IDおよびパスワードの管理不十分、使用上の過誤、第三者の使用などに起因する損害につき自ら責任を負うものとします。\n4. 会員は、会員IDおよびパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに弊社に連絡するものとします。\n第２０条　変更の届出\n会員は、住所、氏名、電話番号、eメールアドレスその他弊社に届出ている事項に変更が生じた場合には、弊社が別途定める方法により、すみやかに弊社に届け出るものとします。\n第２１条　退会\n会員は、都合により退会する場合は、弊社が別途定める方法により、いつでも退会できます。なお、未発送商品がある場合は、弊社による当該商品の発送及びこれに対する会員のお支払いを全て終えるまで、本規約に基づく会員の義務は存続するものとします。会員IＤ、パスワードを忘れ、退会できない方は、弊社所定の方法にてパスワードの再発行を受けるものとします。\n第２２条　著作権\n1. 会員は、権利者の許諾を得ないで、本サービスを通じて提供されるいかなる情報も、著作権法で認められる個人の私的複製等著作権の制限規定範囲外での使用をすることはできません。\n2. 本条の規定に違反して問題が生じた場合、会員は自己の責任と費用においてかかる問題を解決するとともに、弊社に何等の迷惑または損害を与えないものとします。\n第２３条　本サービス内容の変更、停止、終了等\n1. 弊社が必要と判断した場合には、会員に事前に通知することなく、いつでも本サービス内容について変更することができ、およびポイントの停止、もしくは中止、中断、終了または付与条件の変更等（以下「変更等」といいます。）を行うことができるものとします。ただし、本サービスに関して会員の権利や義務に重大な影響が生じる変更等については、合理的な予告期間を設けた上で、変更等を行うものとします。\n2. 前項のような変更を行った場合であっても、弊社は会員に対しては一切責任を負わないものとします。\n3. 第1項のような変更を行った場合であっても、変更前に成立した本サービスに基づく売買契約及びすでに行われているポイントの利用には影響しないものとします。\n4. 弊社が必要と判断した場合には、サイト上に告知することで、いつでも本サービスを廃止することができるものとします。\n5. 本サービス廃止の場合、会員のポイント残高は無効となり、現金等への交換その他の精算はいたしません。\n第２４条　個人情報\n1. 弊社は、会員情報に含まれる個人を識別できる情報（以下「個人情報」といいます。）を厳重に管理の上、弊社が提供する本サービス（ご注文された商品や景品等をお届けする上で必要な業務、顧客管理および、各種お問い合わせ対応）及び弊社が提供する他の顧客サービス（ダイレクトメール等会員に有益かつ必要と思われる情報の送付、商品等の広告、本サービスサイト上で開催されるキャンペーン企画、アンケート等における応募者の認証等）の円滑な運営、業務遂行上で必要となる弊社からの問い合わせ、確認、サービス向上のための意見収集およびマーケティングを目的として、その範囲内においてのみ、収集・利用するものとします。なお、顧客管理には、本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行うことを含みます。\n2. 当サイトによる個人情報の収集・利用は、会員の自発的な提供によるものであり、会員が個人情報を提供した場合は、弊社が別途定める＜個人情報保護方針（プライバシーポリシー）＞（以下「本方針」といいます。）に則って個人情報を利用することを会員が許諾したものとします。\n3. 弊社は、以下の場合を除き、会員の個人情報を第三者に一切提供又は開示しません。個人情報の提供を行う場合、必要な範囲を超えて個人情報を提供することはありません。\n(1)．会員に対し商品等又はキャンペーンの広告やアンケート等を行う場合。この場合、広告媒体を運営する第三者に対し、当社が取得した会員の個人情報を提供する場合があります。これにより、会員が当該第三者のサービスを利用する際に商品等やキャンペーンに関する広告が表示されることがあります。（※運営会社及び提携会社が日本国外にある場合の外国の名称等は以下をご確認ください。）\n日本国外への個人情報の提供について\n個人情報の提供先となり得る国外の国における個人情報の保護に関する制度等については、個人情報保護委員会のウェブサイトにてご参照ください。\n個人情報保護委員会　外国における個人情報の保護に関する制度等の調査\n（https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/#gaikoku）\n\n■広告配信サービス等を提供する提携会社と所在国・地域名\nGoogle LLC [アメリカ合衆国]\nTwitter, Inc. [アメリカ合衆国]\nMicrosoft Corporation[アメリカ合衆国]\nMeta Platforms Inc.[アメリカ合衆国]\n\n■国外個人情報提供先について\n提供先の講じている個人情報保護措置：日本国内の個人情報取扱事業者に求められる措置と同水準の措置を講じています。\n(2)．マーケティングを行う場合（分析、及び弊社公式アカウントでの広告用メール配信・SNSでのメッセージ配信・アプリでのメッセージ配信等）\n(3). 予め会員の同意を得ている場合\n(4). 法令等に基づき認められる場合又は正当な開示の要求がある場合\n(5). 弊社の業務委託先に対して、委託業務以外に個人情報を利用しないよう予め契約を締結した上で提供する場合\n(6). 決済会社での本人確認、請求先確認及び与信調査を行う場合\n(7). 商品等の販売に付随する対応を、商品製造元・グループ会社等と共同で行う場合\n(8). 会員が本サービスとSNSアカウント・外部サイトアカウントとの連携を行う場合\n(9). 本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行う場合\n4. 弊社は、販売促進等を目的として、個人を識別できない統計データの形式で会員情報を第三者に提供又は開示することがあります。\n5. 本サービスでは、以下に記載する目的で、「クッキー(cookie)」機能を使用することがあります。\n(1) 会員が本サービスに再訪問する際、より便利に本サービスをご利用いただくため\n(2) 本サービスの利用状況を計測・解析するため\n6. 会員がクッキーを発行するコンテンツを訪問した場合、会員のコンピュータにクッキーが記録されますが、記録される情報には、会員個人を識別できる情報は含まれていません。\n7.会員自らブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本サービスの一部がご利用できなくなることがあります。\n8. 第１項のキャンペーン企画、アンケート等において、会員の判断により会員の情報を入力しないという選択をすることもできますが、その結果、本サービスの一部がご利用できなくなる場合があります。\n9. 本条に定めなき個人情報に関する事由は、本方針に従うものとします。\n第２５条　　その他免責事項\n1. 弊社は、以下の場合に一時的に本サービスの提供を停止、中止、中断等の措置を行うことがあります。これにより会員が本サービスの全部又は一部をご利用になれず、会員に損害が生じた場合においても、弊社は当該損害についていかなる責任も負わないものとします。\n(1)本サービスの障害、保守又はメンテナンスを緊急に行う必要がある場合。\n(2)天災地変、自然災害、停電等の不可抗力により本サービスの運営が出来なくなった場合。\n(3)通信回線等の事故により本サービスが停止した場合。\n2. 弊社は、会員の登録内容に従い事務を処理することにより免責されるものとします。\n3. 会員が、本サービスをご利用になることにより、他の会員または第三者に対して損害等を与えた場合には、当該会員は自己の責任と費用において解決し、弊社には一切迷惑を与えないものとします。\n第２６条　　損害賠償の範囲\n1.　本規約の規定にかかわらず、会員による本サービスの利用に関し、消費者契約法が適用される場合、かつ会員に生じた損害に弊社の責めに帰すべき事由がある場合、弊社は、以下の区分に従い、賠償するものとします。\n（1）会員に生じた損害が弊社の故意又は重過失に起因する場合は、民法等の規定に基づく責任\n（2）会員に生じた損害が弊社の故意又は重過失に起因しない場合は、会員が直接かつ現実に被った損害を上限とした責任（付随的損害、間接損害、特別損害及び逸失利益に関する損害については、責任を負わないものとします。）\n2. 会員が被った損害が、会員が本規約に違反する等、会員の責に帰すべき事由（当該事由に基づく弊社の作為又は不作為を含みます。）に起因する場合、弊社は当該損害について責任を負わないものとします。\n第２７条　　連絡方法\n会員から弊社への連絡は、弊社指定の問合せフォームによるものとします。\n第２８条　　本規約の範囲及び変更\n1. 本規約は本サービスの利用に関し、本サービスを利用される会員に適用されるものとします。 ただし、本サービス利用において、本規約と異なる別段の条件がある場合には、本規約に優先してその条件が適用されるものとします。\n2. 弊社は、会員に事前の承諾を得ることなく、弊社が適当と判断する方法（ｅメール、サイト上への掲載等）で、予め合理的な告知期間をもって会員に通知することにより本規約を変更できるものとします。本規約の変更後の本サービスのご利用については、変更後の規約が適用されます。\n第２９条　分離可能性\n本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効とされた場合であっても、本規約の残りの規定及び一部が無効と判断された規定の残りの部分は、継続して完全に効力を有するものとします。\n第３０条　準拠法および合意管轄\n1. 本サービスは、日本法に準拠して解釈されるものとします。\n2. 本サービスにおいて紛争が発生した場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n2009年4月1日　制定\n2017年12月12日　改訂\n2018年4月1日　改訂\n2020年3月26日　改訂\n2020年11月25日　改訂\n2021年9月28日　改訂\n2022年4月28日　改訂\n2022年9月27日　改訂\n2023年6月28日　改訂\n2024年1月5日　改訂",
        "sort_id": 1
    },
    {
        "id": 1002,
        "term_id": 1001,
        "type": 2,
        "revision": 1,
        "platform": 2,
        "lang": "ja_JP",
        "title": "プレミアムバンダイ　会員規約",
        "desc": "リアルグッズの購入にあたり、以下の「プレミアムバンダイ」会員規約の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "\nプレミアムバンダイ　会員規約\n株式会社BANDAI SPIRITS（以下「弊社」といいます。）の運営するサイト、プレミアムバンダイ（以下「本サービス」といいます。）の会員規約（以下｢本規約｣といいます。）を以下の通り定めます。会員に登録していただくには、以下の条項をよくお読みのうえ、同意していただくことが必要です。また、未成年者の場合は、保護者の同意を得る必要があります。\n\n第１章　総則\n第１条　定義\n「会員」とは、本規約に同意いただいた上、弊社所定の手続に従い会員登録を申請し、弊社がこれを承認した方をいいます。\n「本サービス」とは、弊社が運営するショッピングポータルサイト『プレミアムバンダイ』における、会員に向けた商品の販売、会員特典の提供その他のサービス全般を指します。\n「プレミアムポイント」（以下「ポイント」といいます。）とは、本規約 第3章で定めるルールに基づき、会員に付与されるポイントをいいます。\n第２条　会員登録\n1. 入会希望者は、本サービスの会員登録ページから、別途弊社の指定する方法に従い会員登録申請を行い、お一人につき、一つの会員IDを無料にて取得することができるものとします。また、弊社からの登録完了のメールの到着をもって登録の承認とさせていただきます。尚、登録完了までにはお時間がかかる場合がございます。\n2. 会員登録および本サービスの利用は、日本に住所登録もしくは居住地登録をしている方に限ります。\n3. 弊社は、以下の各号のいずれかに該当する場合、会員登録の承認を拒み又は取消すことができるものとします。\n尚、必要に応じて、公的証明（マイナンバーカード・免許証・保険証・パスポート等）による申請内容又は会員登録情報の確認をさせていただく場合があります。\n(1). 入会希望者が過去に本規約等に反する行為をしたことなどにより、会員登録の取消などの処分を受けていることが判明した場合\n(2). 入会希望者の申請内容に事実に反する事項が含まれている場合\n(3). 公的証明の提示にご協力いただけない場合\n(4). 営利目的・転売目的で本サービスの利用をし又は利用しようとしていると弊社が判断した場合\n(5).　反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者）とのいずれかとの何らかの交流若しくは関与があると弊社が判断した場合\n(6). その他登録申請を承認することが不適当であると弊社が判断する場合\n第３条　本サービスの利用\n会員は、本規約又は弊社が別途定めるルール等に従い、本サービスを利用することができるものとします。\n\n第２章 商品購入\n第４条　商品の購入\n1. 会員は、本サービスを利用して、商品またはサービス（以下「商品等」といいます。）を購入することができます。\n2. 会員は、商品等の購入を希望する場合、弊社が指定する方法に従って商品の購入を申込むものとします。\n3. 商品購入に関する売買契約は、商品の注文が完了した時点（会員により登録されたメールアドレス宛に「注文内容のご確認」メールが送られます。別途弊社が売買契約の成立時期を定めた場合はこの限りではありません。）で成立することとします。但し、弊社は、商品の生産中止等、やむを得ない事情がある場合は、会員に通知することにより既に成立した売買契約を取り消すことができるものとします。\n4. 弊社は、個々の注文画面又はご利用ガイドその他の本サービス上の画面において定めがある場合を除き、会員都合での商品等の購入申込の撤回は一切受け付けないものとします。\n5. 弊社では、正確な商品情報を掲載するよう最善の努力をしますが、万が一誤った価格表記がされており、それに基づいた注文をいただいた場合は、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。\n6. 本サービス利用に関して会員による不正行為もしくは不適当な行為があった場合、または弊社が配送した商品を、理由の如何を問わず会員が受領しなかった場合、弊社は売買契約の解除、その他適切な措置を取ることができる（会員が商品代金を支払い済みの場合を含みます。）ものとします。 この場合に弊社に生じた費用（商品の配送料その他手数料を含みますが、これらに限りません。）は会員の負担とします。\n7. 弊社は、一定期間におけるお取引額が高額となる場合、ご連絡をさせていただくことがございます。会員本人へのご連絡がつかない場合、弊社は商品等の購入申込の取消、売買契約の解除その他適切な措置を取ることができるものとします。\n8. 本サービスによる商品等の配送先は、日本国内に限ります。\n9. インターネット上の障害、その他弊社に責任のない原因により、商品等購入の申込みが受理できなかった場合、弊社はその責任を負いません。\n第５条　商品の配送\n1. 商品の配送は、弊社が指定する配送業者による配送便で行います。なお、配送料は、商品の注文画面の指定に従い会員のご負担となります。\n2. 弊社は、会員の申込を受け、配送準備開始時点の配送先や配送日時の指定等を配送業者に取り次ぐこととします。\n3. 商品によっては、諸般の事情で、あらかじめご案内した納期が変更される場合や品切れ等により納期が遅れる場合、また注文に応じられない場合もあります。これらの場合でも、弊社は何ら賠償の責任を負わないものとします。\n4. 弊社が発送した商品が会員により受領されなかった場合（受取拒否又は長期不在等により受け取られなかった場合を含みます。）、弊社は、これによって弊社に生じた費用（再配達費用等）を当該会員に請求できるものとします。\n5. 弊社は、会員により受領されなかった商品を一定期間保管後に廃棄その他の処分をすることができるものとします。\n第６条　決済方法\n1. 商品等のお支払い金額は、商品購入代金、送料、決済手数料および消費税等の合計となります。\n2. 本サービスによって購入された商品等のお支払いに関しては、会員本人名義のクレジットカード（弊社が承諾するものに限ります。）によるお支払い、その他弊社が別途認めるお支払方法によるものとします。\n3. クレジットカードでのお支払いの場合は、会員がカード会社との間で別途契約する条件に従うものとします。また、会員と当該クレジットカード会社等の間で紛争が発生した場合は、当該当事者双方で解決するものとし、弊社には一切責任はないものとします。\n4. クレジットカードでお支払いの場合、商品等購入の申込時にカード会社へご利用可能の問い合わせを行います。なお、購入申込から商品発送までに一定の期間を要する場合、再度クレジットカード会社へご利用可能の問い合わせをさせていただく場合がございます。問い合わせの結果、カード会社よりご利用不可との連絡が入った場合、ご購入いただけない場合がございます。\n第７条　商品のキャンセル・返品等\n1. 会員は、原則として、商品等の注文をキャンセルすることは出来ません。但し、発送前の商品等に関しては、弊社が別途定める事由に該当する場合に限り、キャンセルすることができます。\n2. 商品等の返品及び交換等は、商品不良、品違い又は数量違い等の弊社の責めに帰すべき場合にのみ承ります。但し、商品の返品については、弊社が商品の交換品を準備できない場合に限られるものとします。\n第８条　サービスに関する免責\n1. 商品等の色合い、形状については、モニターの設定等により、画面表示と実物とで異なる場合があります。\n2. 弊社は、会員が入力した連絡先へ連絡すること、および商品等購入の際指示した発送先に商品を配送等することにより免責されるものとします。\n3. 弊社は、本サービス上での商品説明あるいは表記については、正確性、完全性、最新性等に関し最善を尽くしますが、一切誤りがないことを保証するものではありません。\n4. 弊社は、法律上の請求原因の如何を問わず、本サービスの利用から生じる如何なる損害、損失、不利益に関して責任を負わないものとします。また、本サービスにおいて売買される商品から生じた損害、損失、不利益に関して責任を負わないものとします。\n\n第３章　プレミアムポイント\n第９条　ポイントの付与\n1. ポイントの付与対象は、原則として商品代金（税込）となりますが、対象となる商品の新規設定、変更、終了等は全て弊社の判断にて行います。\n2. ポイントの付与率・付与額は、キャンペーン、商品、ショップにより異なり、当該付与ポイントはサイト上に明記されます。ポイントの付与率・付与額は予告なく変更となる場合があります。\n3. ポイントの付与、利用可能時期は、付与対象となる商品の配送完了が確認された日の翌日以降、あるいは付与対象となるキャンペーン等への当選が確認された日の翌日以降とし、かつ当社が別途定めるルールに従い付与されることとなります。\n第１０条　ポイントの管理\n1. 弊社は、弊社所定の方法により、会員が獲得したポイント数、会員が利用したポイント数および、ポイント残高を、会員に告知します。\n2. 第1項のポイント数に関する最終的な決定は弊社が行うものとし、会員はこれに従うものとします。\n第１１条　ポイントの譲渡禁止\n付与されたポイントは、いかなる場合にも、会員間での移動、譲渡、貸与、累積等はできません。\n第１２条　決済におけるポイントの利用\n1. 会員は、保有するポイントを、本サービスでの商品等の購入ならびに、商品等の購入に伴い発生する送料、決済手数料、消費税にご利用いただけます。\n2. 会員が、ポイントを使用する場合の換価率は、原則として1ポイント＝1円とします。\n第１３条　キャンセル時のポイントの取扱いについて\n1. 会員が、商品代金の一部または全部の決済にポイントを利用し、その後対象となる売買契約を、第７条によりキャンセル等をした場合、当該ポイントは会員に返還されます。なお、返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n2.(1). 第７条によりキャンセル等された売買契約に基づいてポイントの付与がなされている場合には、当該ポイントの付与はキャンセル等と同時に取り消しとさせていただきます。\n(2). キャンセル等に伴って商品等代金をお返しする場合、お返しする金額は実際にお支払頂いた金額とし、ポイント充当額は含まないものとします。ただし、取り消し前に、前項の取り消し対象のポイントをご利用している場合には、別途弊社の定める方法にて精算させていただきます。\n第１４条　商品代金変更等の場合のポイントの取扱いについて\n1. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品代金が何らかの事情で減額になった場合は、以下の対応を行うものとします。なお、ポイントの返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n(1). 会員が、商品代金の一部についてポイントを利用した場合、まず他の支払方法による代金返還が行われ、それでも返還を必要とする金額に不足がある場合には、当該不足額についてポイントの返還が行われます。\n(2). 会員が、商品代金の全部についてポイントを利用した場合、差額分のポイントを返還します。\n2. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品等代金が何らかの事情で増額になった場合、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。会員が変更後の価格での購入申込みをしない場合、利用ポイントを返還致します。\n第１５条　ポイントの失効\n1. 最後にポイントの変動（ポイントの利用または付与）があった日の翌日から起算して一年間（以下本条において「ポイント有効期間」といいます。）、ポイントの変動及び商品等のお申込のいずれも生じなかったときは、ポイント有効期間の満了を以って、その時点で有効な累積ポイントは失効するものとします。\n2. 会員が、退会した場合、その時点でポイントは失効します。\n3. 弊社は、失効したポイントについて何らの補償も行わず、一切の責任を負いません。\n第１６条　第三者による使用\n1. ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはできません。\n2. 弊社は、ポイント利用時に入力された会員IDおよびパスワードが、会員登録されたものと一致することを弊社が所定の方法により確認した場合には、当該会員による利用とみなします。それが第三者による不正利用であった場合でも、弊社は利用されたポイントを返還しません。会員に生じた損害についても一切責任を負いません。\n\n第４章　その他\n第１７条　本サービスの利用停止、会員登録の取消、ポイントの抹消\n1. 弊社は、会員が以下の各号のいずれかに該当する場合、会員に事前通知することなく本サービスの利用停止（商品等の購入申込の取消、売買契約の解除を含みます）、会員登録の取消またはポイントの一部もしくは全部を抹消することができるものとします。\n(1). 第２条（会員登録）第２項各号の事由に該当する場合\n(2). 本サービスに関する料金などの支払債務の履行遅延、その他の不履行があった場合\n(3). 第１８条（禁止事項）の行為を行った場合\n(4). 本サービスを1年以上ご利用されなかった場合\n(5). 会員が死亡した場合\n(6). その他本規約または別途定めるルール等に違反した場合\n2. 前項により会員登録が取消された場合、それ以降、本サービスは利用することができなくなります。\n第１８条　禁止事項\n会員は以下の行為を行ってはならないものとします。\n(1). 本サービス利用の際に虚偽の登録内容を申請する行為\n(2). 本サービスの運営を妨げ、その他本サービスに支障をきたすおそれのある行為\n(3). クレジットカードを不正に使用して本サービスを利用する行為\n(4). 会員IDおよびパスワードを不正に使用する行為\n(5). 法的な責任を超えた不当な要求行為\n(6). 他の会員、第三者もしくは弊社に迷惑、不利益もしくは損害を与える行為、またはそれらのおそれのある行為\n(7). 他の会員、第三者もしくは弊社の著作権等の知的財産権、プライバシーその他の権利を侵害する行為、またはそれらのおそれのある行為\n(8). 本規約に違反する行為、公序良俗に反する行為その他法令に違反する行為、またはそれらのおそれのあると弊社が判断した行為\n(9). その他、弊社が不適当と判断する行為\n第１９条　会員IDおよびパスワードの管理\n1. 会員は、会員自身で設定した会員IDおよびパスワードの管理責任を負うものとします。 また、会員IDおよびパスワードを用いて弊社に対して行われた意思表示は、その会員IDおよびパスワードに該当する会員の有効な意思表示とみなし、これにより生ずる支払い等はすべてその会員の責任となります。\n2. 会員は、会員IDおよびパスワードを第三者に譲渡、貸与、開示してはならないものとします。\n3. 会員は、会員IDおよびパスワードの管理不十分、使用上の過誤、第三者の使用などに起因する損害につき自ら責任を負うものとします。\n4. 会員は、会員IDおよびパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに弊社に連絡するものとします。\n第２０条　変更の届出\n会員は、住所、氏名、電話番号、eメールアドレスその他弊社に届出ている事項に変更が生じた場合には、弊社が別途定める方法により、すみやかに弊社に届け出るものとします。\n第２１条　退会\n会員は、都合により退会する場合は、弊社が別途定める方法により、いつでも退会できます。なお、未発送商品がある場合は、弊社による当該商品の発送及びこれに対する会員のお支払いを全て終えるまで、本規約に基づく会員の義務は存続するものとします。会員IＤ、パスワードを忘れ、退会できない方は、弊社所定の方法にてパスワードの再発行を受けるものとします。\n第２２条　著作権\n1. 会員は、権利者の許諾を得ないで、本サービスを通じて提供されるいかなる情報も、著作権法で認められる個人の私的複製等著作権の制限規定範囲外での使用をすることはできません。\n2. 本条の規定に違反して問題が生じた場合、会員は自己の責任と費用においてかかる問題を解決するとともに、弊社に何等の迷惑または損害を与えないものとします。\n第２３条　本サービス内容の変更、停止、終了等\n1. 弊社が必要と判断した場合には、会員に事前に通知することなく、いつでも本サービス内容について変更することができ、およびポイントの停止、もしくは中止、中断、終了または付与条件の変更等（以下「変更等」といいます。）を行うことができるものとします。ただし、本サービスに関して会員の権利や義務に重大な影響が生じる変更等については、合理的な予告期間を設けた上で、変更等を行うものとします。\n2. 前項のような変更を行った場合であっても、弊社は会員に対しては一切責任を負わないものとします。\n3. 第1項のような変更を行った場合であっても、変更前に成立した本サービスに基づく売買契約及びすでに行われているポイントの利用には影響しないものとします。\n4. 弊社が必要と判断した場合には、サイト上に告知することで、いつでも本サービスを廃止することができるものとします。\n5. 本サービス廃止の場合、会員のポイント残高は無効となり、現金等への交換その他の精算はいたしません。\n第２４条　個人情報\n1. 弊社は、会員情報に含まれる個人を識別できる情報（以下「個人情報」といいます。）を厳重に管理の上、弊社が提供する本サービス（ご注文された商品や景品等をお届けする上で必要な業務、顧客管理および、各種お問い合わせ対応）及び弊社が提供する他の顧客サービス（ダイレクトメール等会員に有益かつ必要と思われる情報の送付、商品等の広告、本サービスサイト上で開催されるキャンペーン企画、アンケート等における応募者の認証等）の円滑な運営、業務遂行上で必要となる弊社からの問い合わせ、確認、サービス向上のための意見収集およびマーケティングを目的として、その範囲内においてのみ、収集・利用するものとします。なお、顧客管理には、本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行うことを含みます。\n2. 当サイトによる個人情報の収集・利用は、会員の自発的な提供によるものであり、会員が個人情報を提供した場合は、弊社が別途定める＜個人情報保護方針（プライバシーポリシー）＞（以下「本方針」といいます。）に則って個人情報を利用することを会員が許諾したものとします。\n3. 弊社は、以下の場合を除き、会員の個人情報を第三者に一切提供又は開示しません。個人情報の提供を行う場合、必要な範囲を超えて個人情報を提供することはありません。\n(1)．会員に対し商品等又はキャンペーンの広告やアンケート等を行う場合。この場合、広告媒体を運営する第三者に対し、当社が取得した会員の個人情報を提供する場合があります。これにより、会員が当該第三者のサービスを利用する際に商品等やキャンペーンに関する広告が表示されることがあります。（※運営会社及び提携会社が日本国外にある場合の外国の名称等は以下をご確認ください。）\n日本国外への個人情報の提供について\n個人情報の提供先となり得る国外の国における個人情報の保護に関する制度等については、個人情報保護委員会のウェブサイトにてご参照ください。\n個人情報保護委員会　外国における個人情報の保護に関する制度等の調査\n（https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/#gaikoku）\n\n■広告配信サービス等を提供する提携会社と所在国・地域名\nGoogle LLC [アメリカ合衆国]\nTwitter, Inc. [アメリカ合衆国]\nMicrosoft Corporation[アメリカ合衆国]\nMeta Platforms Inc.[アメリカ合衆国]\n\n■国外個人情報提供先について\n提供先の講じている個人情報保護措置：日本国内の個人情報取扱事業者に求められる措置と同水準の措置を講じています。\n(2)．マーケティングを行う場合（分析、及び弊社公式アカウントでの広告用メール配信・SNSでのメッセージ配信・アプリでのメッセージ配信等）\n(3). 予め会員の同意を得ている場合\n(4). 法令等に基づき認められる場合又は正当な開示の要求がある場合\n(5). 弊社の業務委託先に対して、委託業務以外に個人情報を利用しないよう予め契約を締結した上で提供する場合\n(6). 決済会社での本人確認、請求先確認及び与信調査を行う場合\n(7). 商品等の販売に付随する対応を、商品製造元・グループ会社等と共同で行う場合\n(8). 会員が本サービスとSNSアカウント・外部サイトアカウントとの連携を行う場合\n(9). 本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行う場合\n4. 弊社は、販売促進等を目的として、個人を識別できない統計データの形式で会員情報を第三者に提供又は開示することがあります。\n5. 本サービスでは、以下に記載する目的で、「クッキー(cookie)」機能を使用することがあります。\n(1) 会員が本サービスに再訪問する際、より便利に本サービスをご利用いただくため\n(2) 本サービスの利用状況を計測・解析するため\n6. 会員がクッキーを発行するコンテンツを訪問した場合、会員のコンピュータにクッキーが記録されますが、記録される情報には、会員個人を識別できる情報は含まれていません。\n7.会員自らブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本サービスの一部がご利用できなくなることがあります。\n8. 第１項のキャンペーン企画、アンケート等において、会員の判断により会員の情報を入力しないという選択をすることもできますが、その結果、本サービスの一部がご利用できなくなる場合があります。\n9. 本条に定めなき個人情報に関する事由は、本方針に従うものとします。\n第２５条　　その他免責事項\n1. 弊社は、以下の場合に一時的に本サービスの提供を停止、中止、中断等の措置を行うことがあります。これにより会員が本サービスの全部又は一部をご利用になれず、会員に損害が生じた場合においても、弊社は当該損害についていかなる責任も負わないものとします。\n(1)本サービスの障害、保守又はメンテナンスを緊急に行う必要がある場合。\n(2)天災地変、自然災害、停電等の不可抗力により本サービスの運営が出来なくなった場合。\n(3)通信回線等の事故により本サービスが停止した場合。\n2. 弊社は、会員の登録内容に従い事務を処理することにより免責されるものとします。\n3. 会員が、本サービスをご利用になることにより、他の会員または第三者に対して損害等を与えた場合には、当該会員は自己の責任と費用において解決し、弊社には一切迷惑を与えないものとします。\n第２６条　　損害賠償の範囲\n1.　本規約の規定にかかわらず、会員による本サービスの利用に関し、消費者契約法が適用される場合、かつ会員に生じた損害に弊社の責めに帰すべき事由がある場合、弊社は、以下の区分に従い、賠償するものとします。\n（1）会員に生じた損害が弊社の故意又は重過失に起因する場合は、民法等の規定に基づく責任\n（2）会員に生じた損害が弊社の故意又は重過失に起因しない場合は、会員が直接かつ現実に被った損害を上限とした責任（付随的損害、間接損害、特別損害及び逸失利益に関する損害については、責任を負わないものとします。）\n2. 会員が被った損害が、会員が本規約に違反する等、会員の責に帰すべき事由（当該事由に基づく弊社の作為又は不作為を含みます。）に起因する場合、弊社は当該損害について責任を負わないものとします。\n第２７条　　連絡方法\n会員から弊社への連絡は、弊社指定の問合せフォームによるものとします。\n第２８条　　本規約の範囲及び変更\n1. 本規約は本サービスの利用に関し、本サービスを利用される会員に適用されるものとします。 ただし、本サービス利用において、本規約と異なる別段の条件がある場合には、本規約に優先してその条件が適用されるものとします。\n2. 弊社は、会員に事前の承諾を得ることなく、弊社が適当と判断する方法（ｅメール、サイト上への掲載等）で、予め合理的な告知期間をもって会員に通知することにより本規約を変更できるものとします。本規約の変更後の本サービスのご利用については、変更後の規約が適用されます。\n第２９条　分離可能性\n本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効とされた場合であっても、本規約の残りの規定及び一部が無効と判断された規定の残りの部分は、継続して完全に効力を有するものとします。\n第３０条　準拠法および合意管轄\n1. 本サービスは、日本法に準拠して解釈されるものとします。\n2. 本サービスにおいて紛争が発生した場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n2009年4月1日　制定\n2017年12月12日　改訂\n2018年4月1日　改訂\n2020年3月26日　改訂\n2020年11月25日　改訂\n2021年9月28日　改訂\n2022年4月28日　改訂\n2022年9月27日　改訂\n2023年6月28日　改訂\n2024年1月5日　改訂",
        "sort_id": 1
    },
    {
        "id": 1003,
        "term_id": 1001,
        "type": 2,
        "revision": 1,
        "platform": 3,
        "lang": "ja_JP",
        "title": "プレミアムバンダイ　会員規約",
        "desc": "リアルグッズの購入にあたり、以下の「プレミアムバンダイ」会員規約の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "\nプレミアムバンダイ　会員規約\n株式会社BANDAI SPIRITS（以下「弊社」といいます。）の運営するサイト、プレミアムバンダイ（以下「本サービス」といいます。）の会員規約（以下｢本規約｣といいます。）を以下の通り定めます。会員に登録していただくには、以下の条項をよくお読みのうえ、同意していただくことが必要です。また、未成年者の場合は、保護者の同意を得る必要があります。\n\n第１章　総則\n第１条　定義\n「会員」とは、本規約に同意いただいた上、弊社所定の手続に従い会員登録を申請し、弊社がこれを承認した方をいいます。\n「本サービス」とは、弊社が運営するショッピングポータルサイト『プレミアムバンダイ』における、会員に向けた商品の販売、会員特典の提供その他のサービス全般を指します。\n「プレミアムポイント」（以下「ポイント」といいます。）とは、本規約 第3章で定めるルールに基づき、会員に付与されるポイントをいいます。\n第２条　会員登録\n1. 入会希望者は、本サービスの会員登録ページから、別途弊社の指定する方法に従い会員登録申請を行い、お一人につき、一つの会員IDを無料にて取得することができるものとします。また、弊社からの登録完了のメールの到着をもって登録の承認とさせていただきます。尚、登録完了までにはお時間がかかる場合がございます。\n2. 会員登録および本サービスの利用は、日本に住所登録もしくは居住地登録をしている方に限ります。\n3. 弊社は、以下の各号のいずれかに該当する場合、会員登録の承認を拒み又は取消すことができるものとします。\n尚、必要に応じて、公的証明（マイナンバーカード・免許証・保険証・パスポート等）による申請内容又は会員登録情報の確認をさせていただく場合があります。\n(1). 入会希望者が過去に本規約等に反する行為をしたことなどにより、会員登録の取消などの処分を受けていることが判明した場合\n(2). 入会希望者の申請内容に事実に反する事項が含まれている場合\n(3). 公的証明の提示にご協力いただけない場合\n(4). 営利目的・転売目的で本サービスの利用をし又は利用しようとしていると弊社が判断した場合\n(5).　反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者）とのいずれかとの何らかの交流若しくは関与があると弊社が判断した場合\n(6). その他登録申請を承認することが不適当であると弊社が判断する場合\n第３条　本サービスの利用\n会員は、本規約又は弊社が別途定めるルール等に従い、本サービスを利用することができるものとします。\n\n第２章 商品購入\n第４条　商品の購入\n1. 会員は、本サービスを利用して、商品またはサービス（以下「商品等」といいます。）を購入することができます。\n2. 会員は、商品等の購入を希望する場合、弊社が指定する方法に従って商品の購入を申込むものとします。\n3. 商品購入に関する売買契約は、商品の注文が完了した時点（会員により登録されたメールアドレス宛に「注文内容のご確認」メールが送られます。別途弊社が売買契約の成立時期を定めた場合はこの限りではありません。）で成立することとします。但し、弊社は、商品の生産中止等、やむを得ない事情がある場合は、会員に通知することにより既に成立した売買契約を取り消すことができるものとします。\n4. 弊社は、個々の注文画面又はご利用ガイドその他の本サービス上の画面において定めがある場合を除き、会員都合での商品等の購入申込の撤回は一切受け付けないものとします。\n5. 弊社では、正確な商品情報を掲載するよう最善の努力をしますが、万が一誤った価格表記がされており、それに基づいた注文をいただいた場合は、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。\n6. 本サービス利用に関して会員による不正行為もしくは不適当な行為があった場合、または弊社が配送した商品を、理由の如何を問わず会員が受領しなかった場合、弊社は売買契約の解除、その他適切な措置を取ることができる（会員が商品代金を支払い済みの場合を含みます。）ものとします。 この場合に弊社に生じた費用（商品の配送料その他手数料を含みますが、これらに限りません。）は会員の負担とします。\n7. 弊社は、一定期間におけるお取引額が高額となる場合、ご連絡をさせていただくことがございます。会員本人へのご連絡がつかない場合、弊社は商品等の購入申込の取消、売買契約の解除その他適切な措置を取ることができるものとします。\n8. 本サービスによる商品等の配送先は、日本国内に限ります。\n9. インターネット上の障害、その他弊社に責任のない原因により、商品等購入の申込みが受理できなかった場合、弊社はその責任を負いません。\n第５条　商品の配送\n1. 商品の配送は、弊社が指定する配送業者による配送便で行います。なお、配送料は、商品の注文画面の指定に従い会員のご負担となります。\n2. 弊社は、会員の申込を受け、配送準備開始時点の配送先や配送日時の指定等を配送業者に取り次ぐこととします。\n3. 商品によっては、諸般の事情で、あらかじめご案内した納期が変更される場合や品切れ等により納期が遅れる場合、また注文に応じられない場合もあります。これらの場合でも、弊社は何ら賠償の責任を負わないものとします。\n4. 弊社が発送した商品が会員により受領されなかった場合（受取拒否又は長期不在等により受け取られなかった場合を含みます。）、弊社は、これによって弊社に生じた費用（再配達費用等）を当該会員に請求できるものとします。\n5. 弊社は、会員により受領されなかった商品を一定期間保管後に廃棄その他の処分をすることができるものとします。\n第６条　決済方法\n1. 商品等のお支払い金額は、商品購入代金、送料、決済手数料および消費税等の合計となります。\n2. 本サービスによって購入された商品等のお支払いに関しては、会員本人名義のクレジットカード（弊社が承諾するものに限ります。）によるお支払い、その他弊社が別途認めるお支払方法によるものとします。\n3. クレジットカードでのお支払いの場合は、会員がカード会社との間で別途契約する条件に従うものとします。また、会員と当該クレジットカード会社等の間で紛争が発生した場合は、当該当事者双方で解決するものとし、弊社には一切責任はないものとします。\n4. クレジットカードでお支払いの場合、商品等購入の申込時にカード会社へご利用可能の問い合わせを行います。なお、購入申込から商品発送までに一定の期間を要する場合、再度クレジットカード会社へご利用可能の問い合わせをさせていただく場合がございます。問い合わせの結果、カード会社よりご利用不可との連絡が入った場合、ご購入いただけない場合がございます。\n第７条　商品のキャンセル・返品等\n1. 会員は、原則として、商品等の注文をキャンセルすることは出来ません。但し、発送前の商品等に関しては、弊社が別途定める事由に該当する場合に限り、キャンセルすることができます。\n2. 商品等の返品及び交換等は、商品不良、品違い又は数量違い等の弊社の責めに帰すべき場合にのみ承ります。但し、商品の返品については、弊社が商品の交換品を準備できない場合に限られるものとします。\n第８条　サービスに関する免責\n1. 商品等の色合い、形状については、モニターの設定等により、画面表示と実物とで異なる場合があります。\n2. 弊社は、会員が入力した連絡先へ連絡すること、および商品等購入の際指示した発送先に商品を配送等することにより免責されるものとします。\n3. 弊社は、本サービス上での商品説明あるいは表記については、正確性、完全性、最新性等に関し最善を尽くしますが、一切誤りがないことを保証するものではありません。\n4. 弊社は、法律上の請求原因の如何を問わず、本サービスの利用から生じる如何なる損害、損失、不利益に関して責任を負わないものとします。また、本サービスにおいて売買される商品から生じた損害、損失、不利益に関して責任を負わないものとします。\n\n第３章　プレミアムポイント\n第９条　ポイントの付与\n1. ポイントの付与対象は、原則として商品代金（税込）となりますが、対象となる商品の新規設定、変更、終了等は全て弊社の判断にて行います。\n2. ポイントの付与率・付与額は、キャンペーン、商品、ショップにより異なり、当該付与ポイントはサイト上に明記されます。ポイントの付与率・付与額は予告なく変更となる場合があります。\n3. ポイントの付与、利用可能時期は、付与対象となる商品の配送完了が確認された日の翌日以降、あるいは付与対象となるキャンペーン等への当選が確認された日の翌日以降とし、かつ当社が別途定めるルールに従い付与されることとなります。\n第１０条　ポイントの管理\n1. 弊社は、弊社所定の方法により、会員が獲得したポイント数、会員が利用したポイント数および、ポイント残高を、会員に告知します。\n2. 第1項のポイント数に関する最終的な決定は弊社が行うものとし、会員はこれに従うものとします。\n第１１条　ポイントの譲渡禁止\n付与されたポイントは、いかなる場合にも、会員間での移動、譲渡、貸与、累積等はできません。\n第１２条　決済におけるポイントの利用\n1. 会員は、保有するポイントを、本サービスでの商品等の購入ならびに、商品等の購入に伴い発生する送料、決済手数料、消費税にご利用いただけます。\n2. 会員が、ポイントを使用する場合の換価率は、原則として1ポイント＝1円とします。\n第１３条　キャンセル時のポイントの取扱いについて\n1. 会員が、商品代金の一部または全部の決済にポイントを利用し、その後対象となる売買契約を、第７条によりキャンセル等をした場合、当該ポイントは会員に返還されます。なお、返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n2.(1). 第７条によりキャンセル等された売買契約に基づいてポイントの付与がなされている場合には、当該ポイントの付与はキャンセル等と同時に取り消しとさせていただきます。\n(2). キャンセル等に伴って商品等代金をお返しする場合、お返しする金額は実際にお支払頂いた金額とし、ポイント充当額は含まないものとします。ただし、取り消し前に、前項の取り消し対象のポイントをご利用している場合には、別途弊社の定める方法にて精算させていただきます。\n第１４条　商品代金変更等の場合のポイントの取扱いについて\n1. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品代金が何らかの事情で減額になった場合は、以下の対応を行うものとします。なお、ポイントの返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n(1). 会員が、商品代金の一部についてポイントを利用した場合、まず他の支払方法による代金返還が行われ、それでも返還を必要とする金額に不足がある場合には、当該不足額についてポイントの返還が行われます。\n(2). 会員が、商品代金の全部についてポイントを利用した場合、差額分のポイントを返還します。\n2. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品等代金が何らかの事情で増額になった場合、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。会員が変更後の価格での購入申込みをしない場合、利用ポイントを返還致します。\n第１５条　ポイントの失効\n1. 最後にポイントの変動（ポイントの利用または付与）があった日の翌日から起算して一年間（以下本条において「ポイント有効期間」といいます。）、ポイントの変動及び商品等のお申込のいずれも生じなかったときは、ポイント有効期間の満了を以って、その時点で有効な累積ポイントは失効するものとします。\n2. 会員が、退会した場合、その時点でポイントは失効します。\n3. 弊社は、失効したポイントについて何らの補償も行わず、一切の責任を負いません。\n第１６条　第三者による使用\n1. ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはできません。\n2. 弊社は、ポイント利用時に入力された会員IDおよびパスワードが、会員登録されたものと一致することを弊社が所定の方法により確認した場合には、当該会員による利用とみなします。それが第三者による不正利用であった場合でも、弊社は利用されたポイントを返還しません。会員に生じた損害についても一切責任を負いません。\n\n第４章　その他\n第１７条　本サービスの利用停止、会員登録の取消、ポイントの抹消\n1. 弊社は、会員が以下の各号のいずれかに該当する場合、会員に事前通知することなく本サービスの利用停止（商品等の購入申込の取消、売買契約の解除を含みます）、会員登録の取消またはポイントの一部もしくは全部を抹消することができるものとします。\n(1). 第２条（会員登録）第２項各号の事由に該当する場合\n(2). 本サービスに関する料金などの支払債務の履行遅延、その他の不履行があった場合\n(3). 第１８条（禁止事項）の行為を行った場合\n(4). 本サービスを1年以上ご利用されなかった場合\n(5). 会員が死亡した場合\n(6). その他本規約または別途定めるルール等に違反した場合\n2. 前項により会員登録が取消された場合、それ以降、本サービスは利用することができなくなります。\n第１８条　禁止事項\n会員は以下の行為を行ってはならないものとします。\n(1). 本サービス利用の際に虚偽の登録内容を申請する行為\n(2). 本サービスの運営を妨げ、その他本サービスに支障をきたすおそれのある行為\n(3). クレジットカードを不正に使用して本サービスを利用する行為\n(4). 会員IDおよびパスワードを不正に使用する行為\n(5). 法的な責任を超えた不当な要求行為\n(6). 他の会員、第三者もしくは弊社に迷惑、不利益もしくは損害を与える行為、またはそれらのおそれのある行為\n(7). 他の会員、第三者もしくは弊社の著作権等の知的財産権、プライバシーその他の権利を侵害する行為、またはそれらのおそれのある行為\n(8). 本規約に違反する行為、公序良俗に反する行為その他法令に違反する行為、またはそれらのおそれのあると弊社が判断した行為\n(9). その他、弊社が不適当と判断する行為\n第１９条　会員IDおよびパスワードの管理\n1. 会員は、会員自身で設定した会員IDおよびパスワードの管理責任を負うものとします。 また、会員IDおよびパスワードを用いて弊社に対して行われた意思表示は、その会員IDおよびパスワードに該当する会員の有効な意思表示とみなし、これにより生ずる支払い等はすべてその会員の責任となります。\n2. 会員は、会員IDおよびパスワードを第三者に譲渡、貸与、開示してはならないものとします。\n3. 会員は、会員IDおよびパスワードの管理不十分、使用上の過誤、第三者の使用などに起因する損害につき自ら責任を負うものとします。\n4. 会員は、会員IDおよびパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに弊社に連絡するものとします。\n第２０条　変更の届出\n会員は、住所、氏名、電話番号、eメールアドレスその他弊社に届出ている事項に変更が生じた場合には、弊社が別途定める方法により、すみやかに弊社に届け出るものとします。\n第２１条　退会\n会員は、都合により退会する場合は、弊社が別途定める方法により、いつでも退会できます。なお、未発送商品がある場合は、弊社による当該商品の発送及びこれに対する会員のお支払いを全て終えるまで、本規約に基づく会員の義務は存続するものとします。会員IＤ、パスワードを忘れ、退会できない方は、弊社所定の方法にてパスワードの再発行を受けるものとします。\n第２２条　著作権\n1. 会員は、権利者の許諾を得ないで、本サービスを通じて提供されるいかなる情報も、著作権法で認められる個人の私的複製等著作権の制限規定範囲外での使用をすることはできません。\n2. 本条の規定に違反して問題が生じた場合、会員は自己の責任と費用においてかかる問題を解決するとともに、弊社に何等の迷惑または損害を与えないものとします。\n第２３条　本サービス内容の変更、停止、終了等\n1. 弊社が必要と判断した場合には、会員に事前に通知することなく、いつでも本サービス内容について変更することができ、およびポイントの停止、もしくは中止、中断、終了または付与条件の変更等（以下「変更等」といいます。）を行うことができるものとします。ただし、本サービスに関して会員の権利や義務に重大な影響が生じる変更等については、合理的な予告期間を設けた上で、変更等を行うものとします。\n2. 前項のような変更を行った場合であっても、弊社は会員に対しては一切責任を負わないものとします。\n3. 第1項のような変更を行った場合であっても、変更前に成立した本サービスに基づく売買契約及びすでに行われているポイントの利用には影響しないものとします。\n4. 弊社が必要と判断した場合には、サイト上に告知することで、いつでも本サービスを廃止することができるものとします。\n5. 本サービス廃止の場合、会員のポイント残高は無効となり、現金等への交換その他の精算はいたしません。\n第２４条　個人情報\n1. 弊社は、会員情報に含まれる個人を識別できる情報（以下「個人情報」といいます。）を厳重に管理の上、弊社が提供する本サービス（ご注文された商品や景品等をお届けする上で必要な業務、顧客管理および、各種お問い合わせ対応）及び弊社が提供する他の顧客サービス（ダイレクトメール等会員に有益かつ必要と思われる情報の送付、商品等の広告、本サービスサイト上で開催されるキャンペーン企画、アンケート等における応募者の認証等）の円滑な運営、業務遂行上で必要となる弊社からの問い合わせ、確認、サービス向上のための意見収集およびマーケティングを目的として、その範囲内においてのみ、収集・利用するものとします。なお、顧客管理には、本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行うことを含みます。\n2. 当サイトによる個人情報の収集・利用は、会員の自発的な提供によるものであり、会員が個人情報を提供した場合は、弊社が別途定める＜個人情報保護方針（プライバシーポリシー）＞（以下「本方針」といいます。）に則って個人情報を利用することを会員が許諾したものとします。\n3. 弊社は、以下の場合を除き、会員の個人情報を第三者に一切提供又は開示しません。個人情報の提供を行う場合、必要な範囲を超えて個人情報を提供することはありません。\n(1)．会員に対し商品等又はキャンペーンの広告やアンケート等を行う場合。この場合、広告媒体を運営する第三者に対し、当社が取得した会員の個人情報を提供する場合があります。これにより、会員が当該第三者のサービスを利用する際に商品等やキャンペーンに関する広告が表示されることがあります。（※運営会社及び提携会社が日本国外にある場合の外国の名称等は以下をご確認ください。）\n日本国外への個人情報の提供について\n個人情報の提供先となり得る国外の国における個人情報の保護に関する制度等については、個人情報保護委員会のウェブサイトにてご参照ください。\n個人情報保護委員会　外国における個人情報の保護に関する制度等の調査\n（https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/#gaikoku）\n\n■広告配信サービス等を提供する提携会社と所在国・地域名\nGoogle LLC [アメリカ合衆国]\nTwitter, Inc. [アメリカ合衆国]\nMicrosoft Corporation[アメリカ合衆国]\nMeta Platforms Inc.[アメリカ合衆国]\n\n■国外個人情報提供先について\n提供先の講じている個人情報保護措置：日本国内の個人情報取扱事業者に求められる措置と同水準の措置を講じています。\n(2)．マーケティングを行う場合（分析、及び弊社公式アカウントでの広告用メール配信・SNSでのメッセージ配信・アプリでのメッセージ配信等）\n(3). 予め会員の同意を得ている場合\n(4). 法令等に基づき認められる場合又は正当な開示の要求がある場合\n(5). 弊社の業務委託先に対して、委託業務以外に個人情報を利用しないよう予め契約を締結した上で提供する場合\n(6). 決済会社での本人確認、請求先確認及び与信調査を行う場合\n(7). 商品等の販売に付随する対応を、商品製造元・グループ会社等と共同で行う場合\n(8). 会員が本サービスとSNSアカウント・外部サイトアカウントとの連携を行う場合\n(9). 本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行う場合\n4. 弊社は、販売促進等を目的として、個人を識別できない統計データの形式で会員情報を第三者に提供又は開示することがあります。\n5. 本サービスでは、以下に記載する目的で、「クッキー(cookie)」機能を使用することがあります。\n(1) 会員が本サービスに再訪問する際、より便利に本サービスをご利用いただくため\n(2) 本サービスの利用状況を計測・解析するため\n6. 会員がクッキーを発行するコンテンツを訪問した場合、会員のコンピュータにクッキーが記録されますが、記録される情報には、会員個人を識別できる情報は含まれていません。\n7.会員自らブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本サービスの一部がご利用できなくなることがあります。\n8. 第１項のキャンペーン企画、アンケート等において、会員の判断により会員の情報を入力しないという選択をすることもできますが、その結果、本サービスの一部がご利用できなくなる場合があります。\n9. 本条に定めなき個人情報に関する事由は、本方針に従うものとします。\n第２５条　　その他免責事項\n1. 弊社は、以下の場合に一時的に本サービスの提供を停止、中止、中断等の措置を行うことがあります。これにより会員が本サービスの全部又は一部をご利用になれず、会員に損害が生じた場合においても、弊社は当該損害についていかなる責任も負わないものとします。\n(1)本サービスの障害、保守又はメンテナンスを緊急に行う必要がある場合。\n(2)天災地変、自然災害、停電等の不可抗力により本サービスの運営が出来なくなった場合。\n(3)通信回線等の事故により本サービスが停止した場合。\n2. 弊社は、会員の登録内容に従い事務を処理することにより免責されるものとします。\n3. 会員が、本サービスをご利用になることにより、他の会員または第三者に対して損害等を与えた場合には、当該会員は自己の責任と費用において解決し、弊社には一切迷惑を与えないものとします。\n第２６条　　損害賠償の範囲\n1.　本規約の規定にかかわらず、会員による本サービスの利用に関し、消費者契約法が適用される場合、かつ会員に生じた損害に弊社の責めに帰すべき事由がある場合、弊社は、以下の区分に従い、賠償するものとします。\n（1）会員に生じた損害が弊社の故意又は重過失に起因する場合は、民法等の規定に基づく責任\n（2）会員に生じた損害が弊社の故意又は重過失に起因しない場合は、会員が直接かつ現実に被った損害を上限とした責任（付随的損害、間接損害、特別損害及び逸失利益に関する損害については、責任を負わないものとします。）\n2. 会員が被った損害が、会員が本規約に違反する等、会員の責に帰すべき事由（当該事由に基づく弊社の作為又は不作為を含みます。）に起因する場合、弊社は当該損害について責任を負わないものとします。\n第２７条　　連絡方法\n会員から弊社への連絡は、弊社指定の問合せフォームによるものとします。\n第２８条　　本規約の範囲及び変更\n1. 本規約は本サービスの利用に関し、本サービスを利用される会員に適用されるものとします。 ただし、本サービス利用において、本規約と異なる別段の条件がある場合には、本規約に優先してその条件が適用されるものとします。\n2. 弊社は、会員に事前の承諾を得ることなく、弊社が適当と判断する方法（ｅメール、サイト上への掲載等）で、予め合理的な告知期間をもって会員に通知することにより本規約を変更できるものとします。本規約の変更後の本サービスのご利用については、変更後の規約が適用されます。\n第２９条　分離可能性\n本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効とされた場合であっても、本規約の残りの規定及び一部が無効と判断された規定の残りの部分は、継続して完全に効力を有するものとします。\n第３０条　準拠法および合意管轄\n1. 本サービスは、日本法に準拠して解釈されるものとします。\n2. 本サービスにおいて紛争が発生した場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n2009年4月1日　制定\n2017年12月12日　改訂\n2018年4月1日　改訂\n2020年3月26日　改訂\n2020年11月25日　改訂\n2021年9月28日　改訂\n2022年4月28日　改訂\n2022年9月27日　改訂\n2023年6月28日　改訂\n2024年1月5日　改訂",
        "sort_id": 1
    },
    {
        "id": 1004,
        "term_id": 1001,
        "type": 2,
        "revision": 2,
        "platform": 1,
        "lang": "ja_JP",
        "title": "プレミアムバンダイ　会員規約",
        "desc": "リアルグッズの購入にあたり、以下の「プレミアムバンダイ」会員規約の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "\nプレミアムバンダイ　会員規約\n株式会社BANDAI SPIRITS（以下「弊社」といいます。）の運営するサイト、プレミアムバンダイ（以下「本サービス」といいます。）の会員規約（以下｢本規約｣といいます。）を以下の通り定めます。会員に登録していただくには、以下の条項をよくお読みのうえ、同意していただくことが必要です。また、未成年者の場合は、保護者の同意を得る必要があります。\n\n第１章　総則\n第１条　定義\n「会員」とは、本規約に同意いただいた上、弊社所定の手続に従い会員登録を申請し、弊社がこれを承認した方をいいます。\n「本サービス」とは、弊社が運営するショッピングポータルサイト『プレミアムバンダイ』における、会員に向けた商品の販売、会員特典の提供その他のサービス全般を指します。\n「プレミアムポイント」（以下「ポイント」といいます。）とは、本規約 第3章で定めるルールに基づき、会員に付与されるポイントをいいます。\n第２条　会員登録\n1. 入会希望者は、本サービスの会員登録ページから、別途弊社の指定する方法に従い会員登録申請を行い、お一人につき、一つの会員IDを無料にて取得することができるものとします。また、弊社からの登録完了のメールの到着をもって登録の承認とさせていただきます。尚、登録完了までにはお時間がかかる場合がございます。\n2. 会員登録および本サービスの利用は、日本に住所登録もしくは居住地登録をしている方に限ります。\n3. 弊社は、以下の各号のいずれかに該当する場合、会員登録の承認を拒み又は取消すことができるものとします。\n尚、必要に応じて、公的証明（マイナンバーカード・免許証・保険証・パスポート等）による申請内容又は会員登録情報の確認をさせていただく場合があります。\n(1). 入会希望者が過去に本規約等に反する行為をしたことなどにより、会員登録の取消などの処分を受けていることが判明した場合\n(2). 入会希望者の申請内容に事実に反する事項が含まれている場合\n(3). 公的証明の提示にご協力いただけない場合\n(4). 営利目的・転売目的で本サービスの利用をし又は利用しようとしていると弊社が判断した場合\n(5).　反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者）とのいずれかとの何らかの交流若しくは関与があると弊社が判断した場合\n(6). その他登録申請を承認することが不適当であると弊社が判断する場合\n第３条　本サービスの利用\n会員は、本規約又は弊社が別途定めるルール等に従い、本サービスを利用することができるものとします。\n\n第２章 商品購入\n第４条　商品の購入\n1. 会員は、本サービスを利用して、商品またはサービス（以下「商品等」といいます。）を購入することができます。\n2. 会員は、商品等の購入を希望する場合、弊社が指定する方法に従って商品の購入を申込むものとします。\n3. 商品購入に関する売買契約は、商品の注文が完了した時点（会員により登録されたメールアドレス宛に「注文内容のご確認」メールが送られます。別途弊社が売買契約の成立時期を定めた場合はこの限りではありません。）で成立することとします。但し、弊社は、商品の生産中止等、やむを得ない事情がある場合は、会員に通知することにより既に成立した売買契約を取り消すことができるものとします。\n4. 弊社は、個々の注文画面又はご利用ガイドその他の本サービス上の画面において定めがある場合を除き、会員都合での商品等の購入申込の撤回は一切受け付けないものとします。\n5. 弊社では、正確な商品情報を掲載するよう最善の努力をしますが、万が一誤った価格表記がされており、それに基づいた注文をいただいた場合は、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。\n6. 本サービス利用に関して会員による不正行為もしくは不適当な行為があった場合、または弊社が配送した商品を、理由の如何を問わず会員が受領しなかった場合、弊社は売買契約の解除、その他適切な措置を取ることができる（会員が商品代金を支払い済みの場合を含みます。）ものとします。 この場合に弊社に生じた費用（商品の配送料その他手数料を含みますが、これらに限りません。）は会員の負担とします。\n7. 弊社は、一定期間におけるお取引額が高額となる場合、ご連絡をさせていただくことがございます。会員本人へのご連絡がつかない場合、弊社は商品等の購入申込の取消、売買契約の解除その他適切な措置を取ることができるものとします。\n8. 本サービスによる商品等の配送先は、日本国内に限ります。\n9. インターネット上の障害、その他弊社に責任のない原因により、商品等購入の申込みが受理できなかった場合、弊社はその責任を負いません。\n第５条　商品の配送\n1. 商品の配送は、弊社が指定する配送業者による配送便で行います。なお、配送料は、商品の注文画面の指定に従い会員のご負担となります。\n2. 弊社は、会員の申込を受け、配送準備開始時点の配送先や配送日時の指定等を配送業者に取り次ぐこととします。\n3. 商品によっては、諸般の事情で、あらかじめご案内した納期が変更される場合や品切れ等により納期が遅れる場合、また注文に応じられない場合もあります。これらの場合でも、弊社は何ら賠償の責任を負わないものとします。\n4. 弊社が発送した商品が会員により受領されなかった場合（受取拒否又は長期不在等により受け取られなかった場合を含みます。）、弊社は、これによって弊社に生じた費用（再配達費用等）を当該会員に請求できるものとします。\n5. 弊社は、会員により受領されなかった商品を一定期間保管後に廃棄その他の処分をすることができるものとします。\n第６条　決済方法\n1. 商品等のお支払い金額は、商品購入代金、送料、決済手数料および消費税等の合計となります。\n2. 本サービスによって購入された商品等のお支払いに関しては、会員本人名義のクレジットカード（弊社が承諾するものに限ります。）によるお支払い、その他弊社が別途認めるお支払方法によるものとします。\n3. クレジットカードでのお支払いの場合は、会員がカード会社との間で別途契約する条件に従うものとします。また、会員と当該クレジットカード会社等の間で紛争が発生した場合は、当該当事者双方で解決するものとし、弊社には一切責任はないものとします。\n4. クレジットカードでお支払いの場合、商品等購入の申込時にカード会社へご利用可能の問い合わせを行います。なお、購入申込から商品発送までに一定の期間を要する場合、再度クレジットカード会社へご利用可能の問い合わせをさせていただく場合がございます。問い合わせの結果、カード会社よりご利用不可との連絡が入った場合、ご購入いただけない場合がございます。\n第７条　商品のキャンセル・返品等\n1. 会員は、原則として、商品等の注文をキャンセルすることは出来ません。但し、発送前の商品等に関しては、弊社が別途定める事由に該当する場合に限り、キャンセルすることができます。\n2. 商品等の返品及び交換等は、商品不良、品違い又は数量違い等の弊社の責めに帰すべき場合にのみ承ります。但し、商品の返品については、弊社が商品の交換品を準備できない場合に限られるものとします。\n第８条　サービスに関する免責\n1. 商品等の色合い、形状については、モニターの設定等により、画面表示と実物とで異なる場合があります。\n2. 弊社は、会員が入力した連絡先へ連絡すること、および商品等購入の際指示した発送先に商品を配送等することにより免責されるものとします。\n3. 弊社は、本サービス上での商品説明あるいは表記については、正確性、完全性、最新性等に関し最善を尽くしますが、一切誤りがないことを保証するものではありません。\n4. 弊社は、法律上の請求原因の如何を問わず、本サービスの利用から生じる如何なる損害、損失、不利益に関して責任を負わないものとします。また、本サービスにおいて売買される商品から生じた損害、損失、不利益に関して責任を負わないものとします。\n\n第３章　プレミアムポイント\n第９条　ポイントの付与\n1. ポイントの付与対象は、原則として商品代金（税込）となりますが、対象となる商品の新規設定、変更、終了等は全て弊社の判断にて行います。\n2. ポイントの付与率・付与額は、キャンペーン、商品、ショップにより異なり、当該付与ポイントはサイト上に明記されます。ポイントの付与率・付与額は予告なく変更となる場合があります。\n3. ポイントの付与、利用可能時期は、付与対象となる商品の配送完了が確認された日の翌日以降、あるいは付与対象となるキャンペーン等への当選が確認された日の翌日以降とし、かつ当社が別途定めるルールに従い付与されることとなります。\n第１０条　ポイントの管理\n1. 弊社は、弊社所定の方法により、会員が獲得したポイント数、会員が利用したポイント数および、ポイント残高を、会員に告知します。\n2. 第1項のポイント数に関する最終的な決定は弊社が行うものとし、会員はこれに従うものとします。\n第１１条　ポイントの譲渡禁止\n付与されたポイントは、いかなる場合にも、会員間での移動、譲渡、貸与、累積等はできません。\n第１２条　決済におけるポイントの利用\n1. 会員は、保有するポイントを、本サービスでの商品等の購入ならびに、商品等の購入に伴い発生する送料、決済手数料、消費税にご利用いただけます。\n2. 会員が、ポイントを使用する場合の換価率は、原則として1ポイント＝1円とします。\n第１３条　キャンセル時のポイントの取扱いについて\n1. 会員が、商品代金の一部または全部の決済にポイントを利用し、その後対象となる売買契約を、第７条によりキャンセル等をした場合、当該ポイントは会員に返還されます。なお、返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n2.(1). 第７条によりキャンセル等された売買契約に基づいてポイントの付与がなされている場合には、当該ポイントの付与はキャンセル等と同時に取り消しとさせていただきます。\n(2). キャンセル等に伴って商品等代金をお返しする場合、お返しする金額は実際にお支払頂いた金額とし、ポイント充当額は含まないものとします。ただし、取り消し前に、前項の取り消し対象のポイントをご利用している場合には、別途弊社の定める方法にて精算させていただきます。\n第１４条　商品代金変更等の場合のポイントの取扱いについて\n1. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品代金が何らかの事情で減額になった場合は、以下の対応を行うものとします。なお、ポイントの返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n(1). 会員が、商品代金の一部についてポイントを利用した場合、まず他の支払方法による代金返還が行われ、それでも返還を必要とする金額に不足がある場合には、当該不足額についてポイントの返還が行われます。\n(2). 会員が、商品代金の全部についてポイントを利用した場合、差額分のポイントを返還します。\n2. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品等代金が何らかの事情で増額になった場合、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。会員が変更後の価格での購入申込みをしない場合、利用ポイントを返還致します。\n第１５条　ポイントの失効\n1. 最後にポイントの変動（ポイントの利用または付与）があった日の翌日から起算して一年間（以下本条において「ポイント有効期間」といいます。）、ポイントの変動及び商品等のお申込のいずれも生じなかったときは、ポイント有効期間の満了を以って、その時点で有効な累積ポイントは失効するものとします。\n2. 会員が、退会した場合、その時点でポイントは失効します。\n3. 弊社は、失効したポイントについて何らの補償も行わず、一切の責任を負いません。\n第１６条　第三者による使用\n1. ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはできません。\n2. 弊社は、ポイント利用時に入力された会員IDおよびパスワードが、会員登録されたものと一致することを弊社が所定の方法により確認した場合には、当該会員による利用とみなします。それが第三者による不正利用であった場合でも、弊社は利用されたポイントを返還しません。会員に生じた損害についても一切責任を負いません。\n\n第４章　その他\n第１７条　本サービスの利用停止、会員登録の取消、ポイントの抹消\n1. 弊社は、会員が以下の各号のいずれかに該当する場合、会員に事前通知することなく本サービスの利用停止（商品等の購入申込の取消、売買契約の解除を含みます）、会員登録の取消またはポイントの一部もしくは全部を抹消することができるものとします。\n(1). 第２条（会員登録）第２項各号の事由に該当する場合\n(2). 本サービスに関する料金などの支払債務の履行遅延、その他の不履行があった場合\n(3). 第１８条（禁止事項）の行為を行った場合\n(4). 本サービスを1年以上ご利用されなかった場合\n(5). 会員が死亡した場合\n(6). その他本規約または別途定めるルール等に違反した場合\n2. 前項により会員登録が取消された場合、それ以降、本サービスは利用することができなくなります。\n第１８条　禁止事項\n会員は以下の行為を行ってはならないものとします。\n(1). 本サービス利用の際に虚偽の登録内容を申請する行為\n(2). 本サービスの運営を妨げ、その他本サービスに支障をきたすおそれのある行為\n(3). クレジットカードを不正に使用して本サービスを利用する行為\n(4). 会員IDおよびパスワードを不正に使用する行為\n(5). 法的な責任を超えた不当な要求行為\n(6). 他の会員、第三者もしくは弊社に迷惑、不利益もしくは損害を与える行為、またはそれらのおそれのある行為\n(7). 他の会員、第三者もしくは弊社の著作権等の知的財産権、プライバシーその他の権利を侵害する行為、またはそれらのおそれのある行為\n(8). 本規約に違反する行為、公序良俗に反する行為その他法令に違反する行為、またはそれらのおそれのあると弊社が判断した行為\n(9). その他、弊社が不適当と判断する行為\n第１９条　会員IDおよびパスワードの管理\n1. 会員は、会員自身で設定した会員IDおよびパスワードの管理責任を負うものとします。 また、会員IDおよびパスワードを用いて弊社に対して行われた意思表示は、その会員IDおよびパスワードに該当する会員の有効な意思表示とみなし、これにより生ずる支払い等はすべてその会員の責任となります。\n2. 会員は、会員IDおよびパスワードを第三者に譲渡、貸与、開示してはならないものとします。\n3. 会員は、会員IDおよびパスワードの管理不十分、使用上の過誤、第三者の使用などに起因する損害につき自ら責任を負うものとします。\n4. 会員は、会員IDおよびパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに弊社に連絡するものとします。\n第２０条　変更の届出\n会員は、住所、氏名、電話番号、eメールアドレスその他弊社に届出ている事項に変更が生じた場合には、弊社が別途定める方法により、すみやかに弊社に届け出るものとします。\n第２１条　退会\n会員は、都合により退会する場合は、弊社が別途定める方法により、いつでも退会できます。なお、未発送商品がある場合は、弊社による当該商品の発送及びこれに対する会員のお支払いを全て終えるまで、本規約に基づく会員の義務は存続するものとします。会員IＤ、パスワードを忘れ、退会できない方は、弊社所定の方法にてパスワードの再発行を受けるものとします。\n第２２条　著作権\n1. 会員は、権利者の許諾を得ないで、本サービスを通じて提供されるいかなる情報も、著作権法で認められる個人の私的複製等著作権の制限規定範囲外での使用をすることはできません。\n2. 本条の規定に違反して問題が生じた場合、会員は自己の責任と費用においてかかる問題を解決するとともに、弊社に何等の迷惑または損害を与えないものとします。\n第２３条　本サービス内容の変更、停止、終了等\n1. 弊社が必要と判断した場合には、会員に事前に通知することなく、いつでも本サービス内容について変更することができ、およびポイントの停止、もしくは中止、中断、終了または付与条件の変更等（以下「変更等」といいます。）を行うことができるものとします。ただし、本サービスに関して会員の権利や義務に重大な影響が生じる変更等については、合理的な予告期間を設けた上で、変更等を行うものとします。\n2. 前項のような変更を行った場合であっても、弊社は会員に対しては一切責任を負わないものとします。\n3. 第1項のような変更を行った場合であっても、変更前に成立した本サービスに基づく売買契約及びすでに行われているポイントの利用には影響しないものとします。\n4. 弊社が必要と判断した場合には、サイト上に告知することで、いつでも本サービスを廃止することができるものとします。\n5. 本サービス廃止の場合、会員のポイント残高は無効となり、現金等への交換その他の精算はいたしません。\n第２４条　個人情報\n1. 弊社は、会員情報に含まれる個人を識別できる情報（以下「個人情報」といいます。）を厳重に管理の上、弊社が提供する本サービス（ご注文された商品や景品等をお届けする上で必要な業務、顧客管理および、各種お問い合わせ対応）及び弊社が提供する他の顧客サービス（ダイレクトメール等会員に有益かつ必要と思われる情報の送付、商品等の広告、本サービスサイト上で開催されるキャンペーン企画、アンケート等における応募者の認証等）の円滑な運営、業務遂行上で必要となる弊社からの問い合わせ、確認、サービス向上のための意見収集およびマーケティングを目的として、その範囲内においてのみ、収集・利用するものとします。なお、顧客管理には、本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行うことを含みます。\n2. 当サイトによる個人情報の収集・利用は、会員の自発的な提供によるものであり、会員が個人情報を提供した場合は、弊社が別途定める＜個人情報保護方針（プライバシーポリシー）＞（以下「本方針」といいます。）に則って個人情報を利用することを会員が許諾したものとします。\n3. 弊社は、以下の場合を除き、会員の個人情報を第三者に一切提供又は開示しません。個人情報の提供を行う場合、必要な範囲を超えて個人情報を提供することはありません。\n(1)．会員に対し商品等又はキャンペーンの広告やアンケート等を行う場合。この場合、広告媒体を運営する第三者に対し、当社が取得した会員の個人情報を提供する場合があります。これにより、会員が当該第三者のサービスを利用する際に商品等やキャンペーンに関する広告が表示されることがあります。（※運営会社及び提携会社が日本国外にある場合の外国の名称等は以下をご確認ください。）\n日本国外への個人情報の提供について\n個人情報の提供先となり得る国外の国における個人情報の保護に関する制度等については、個人情報保護委員会のウェブサイトにてご参照ください。\n個人情報保護委員会　外国における個人情報の保護に関する制度等の調査\n（https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/#gaikoku）\n\n■広告配信サービス等を提供する提携会社と所在国・地域名\nGoogle LLC [アメリカ合衆国]\nX Corp.[アメリカ合衆国]\nMicrosoft Corporation[アメリカ合衆国]\nMeta Platforms Inc.[アメリカ合衆国]\nByteDance, Ltd[シンガポール]\nリンクシェア・ジャパン株式会社[アメリカ合衆国]\n\n■国外個人情報提供先について\n提供先の講じている個人情報保護措置：日本国内の個人情報取扱事業者に求められる措置と同水準の措置を講じています。\n(2)．マーケティングを行う場合（分析、及び弊社公式アカウントでの広告用メール配信・SNSでのメッセージ配信・アプリでのメッセージ配信等）\n(3). 予め会員の同意を得ている場合\n(4). 法令等に基づき認められる場合又は正当な開示の要求がある場合\n(5). 弊社の業務委託先に対して、委託業務以外に個人情報を利用しないよう予め契約を締結した上で提供する場合\n(6). 決済会社での本人確認、請求先確認及び与信調査を行う場合\n(7). 商品等の販売に付随する対応を、商品製造元・グループ会社等と共同で行う場合\n(8). 会員が本サービスとSNSアカウント・外部サイトアカウントとの連携を行う場合\n(9). 本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行う場合\n4. 弊社は、販売促進等を目的として、個人を識別できない統計データの形式で会員情報を第三者に提供又は開示することがあります。\n5. 本サービスでは、以下に記載する目的で、「クッキー(cookie)」機能を使用することがあります。\n(1) 会員が本サービスに再訪問する際、より便利に本サービスをご利用いただくため\n(2) 本サービスの利用状況を計測・解析するため\n6. 会員がクッキーを発行するコンテンツを訪問した場合、会員のコンピュータにクッキーが記録されますが、記録される情報には、会員個人を識別できる情報は含まれていません。\n7.会員自らブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本サービスの一部がご利用できなくなることがあります。\n8. 第１項のキャンペーン企画、アンケート等において、会員の判断により会員の情報を入力しないという選択をすることもできますが、その結果、本サービスの一部がご利用できなくなる場合があります。\n9. 本条に定めなき個人情報に関する事由は、本方針に従うものとします。\n第２５条　　その他免責事項\n1. 弊社は、以下の場合に一時的に本サービスの提供を停止、中止、中断等の措置を行うことがあります。これにより会員が本サービスの全部又は一部をご利用になれず、会員に損害が生じた場合においても、弊社は当該損害についていかなる責任も負わないものとします。\n(1)本サービスの障害、保守又はメンテナンスを緊急に行う必要がある場合。\n(2)天災地変、自然災害、停電等の不可抗力により本サービスの運営が出来なくなった場合。\n(3)通信回線等の事故により本サービスが停止した場合。\n2. 弊社は、会員の登録内容に従い事務を処理することにより免責されるものとします。\n3. 会員が、本サービスをご利用になることにより、他の会員または第三者に対して損害等を与えた場合には、当該会員は自己の責任と費用において解決し、弊社には一切迷惑を与えないものとします。\n第２６条　　損害賠償の範囲\n1.　本規約の規定にかかわらず、会員による本サービスの利用に関し、消費者契約法が適用される場合、かつ会員に生じた損害に弊社の責めに帰すべき事由がある場合、弊社は、以下の区分に従い、賠償するものとします。\n（1）会員に生じた損害が弊社の故意又は重過失に起因する場合は、民法等の規定に基づく責任\n（2）会員に生じた損害が弊社の故意又は重過失に起因しない場合は、会員が直接かつ現実に被った損害を上限とした責任（付随的損害、間接損害、特別損害及び逸失利益に関する損害については、責任を負わないものとします。）\n2. 会員が被った損害が、会員が本規約に違反する等、会員の責に帰すべき事由（当該事由に基づく弊社の作為又は不作為を含みます。）に起因する場合、弊社は当該損害について責任を負わないものとします。\n第２７条　　連絡方法\n会員から弊社への連絡は、弊社指定の問合せフォームによるものとします。\n第２８条　　本規約の範囲及び変更\n1. 本規約は本サービスの利用に関し、本サービスを利用される会員に適用されるものとします。 ただし、本サービス利用において、本規約と異なる別段の条件がある場合には、本規約に優先してその条件が適用されるものとします。\n2. 弊社は、会員に事前の承諾を得ることなく、弊社が適当と判断する方法（ｅメール、サイト上への掲載等）で、予め合理的な告知期間をもって会員に通知することにより本規約を変更できるものとします。本規約の変更後の本サービスのご利用については、変更後の規約が適用されます。\n第２９条　分離可能性\n本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効とされた場合であっても、本規約の残りの規定及び一部が無効と判断された規定の残りの部分は、継続して完全に効力を有するものとします。\n第３０条　準拠法および合意管轄\n1. 本サービスは、日本法に準拠して解釈されるものとします。\n2. 本サービスにおいて紛争が発生した場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n2009年4月1日　制定\n2017年12月12日　改訂\n2018年4月1日　改訂\n2020年3月26日　改訂\n2020年11月25日　改訂\n2021年9月28日　改訂\n2022年4月28日　改訂\n2022年9月27日　改訂\n2023年6月28日　改訂\n2024年1月5日　改訂\n2024年4月1日　改訂",
        "sort_id": 1
    },
    {
        "id": 1005,
        "term_id": 1001,
        "type": 2,
        "revision": 2,
        "platform": 2,
        "lang": "ja_JP",
        "title": "プレミアムバンダイ　会員規約",
        "desc": "リアルグッズの購入にあたり、以下の「プレミアムバンダイ」会員規約の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "\nプレミアムバンダイ　会員規約\n株式会社BANDAI SPIRITS（以下「弊社」といいます。）の運営するサイト、プレミアムバンダイ（以下「本サービス」といいます。）の会員規約（以下｢本規約｣といいます。）を以下の通り定めます。会員に登録していただくには、以下の条項をよくお読みのうえ、同意していただくことが必要です。また、未成年者の場合は、保護者の同意を得る必要があります。\n\n第１章　総則\n第１条　定義\n「会員」とは、本規約に同意いただいた上、弊社所定の手続に従い会員登録を申請し、弊社がこれを承認した方をいいます。\n「本サービス」とは、弊社が運営するショッピングポータルサイト『プレミアムバンダイ』における、会員に向けた商品の販売、会員特典の提供その他のサービス全般を指します。\n「プレミアムポイント」（以下「ポイント」といいます。）とは、本規約 第3章で定めるルールに基づき、会員に付与されるポイントをいいます。\n第２条　会員登録\n1. 入会希望者は、本サービスの会員登録ページから、別途弊社の指定する方法に従い会員登録申請を行い、お一人につき、一つの会員IDを無料にて取得することができるものとします。また、弊社からの登録完了のメールの到着をもって登録の承認とさせていただきます。尚、登録完了までにはお時間がかかる場合がございます。\n2. 会員登録および本サービスの利用は、日本に住所登録もしくは居住地登録をしている方に限ります。\n3. 弊社は、以下の各号のいずれかに該当する場合、会員登録の承認を拒み又は取消すことができるものとします。\n尚、必要に応じて、公的証明（マイナンバーカード・免許証・保険証・パスポート等）による申請内容又は会員登録情報の確認をさせていただく場合があります。\n(1). 入会希望者が過去に本規約等に反する行為をしたことなどにより、会員登録の取消などの処分を受けていることが判明した場合\n(2). 入会希望者の申請内容に事実に反する事項が含まれている場合\n(3). 公的証明の提示にご協力いただけない場合\n(4). 営利目的・転売目的で本サービスの利用をし又は利用しようとしていると弊社が判断した場合\n(5).　反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者）とのいずれかとの何らかの交流若しくは関与があると弊社が判断した場合\n(6). その他登録申請を承認することが不適当であると弊社が判断する場合\n第３条　本サービスの利用\n会員は、本規約又は弊社が別途定めるルール等に従い、本サービスを利用することができるものとします。\n\n第２章 商品購入\n第４条　商品の購入\n1. 会員は、本サービスを利用して、商品またはサービス（以下「商品等」といいます。）を購入することができます。\n2. 会員は、商品等の購入を希望する場合、弊社が指定する方法に従って商品の購入を申込むものとします。\n3. 商品購入に関する売買契約は、商品の注文が完了した時点（会員により登録されたメールアドレス宛に「注文内容のご確認」メールが送られます。別途弊社が売買契約の成立時期を定めた場合はこの限りではありません。）で成立することとします。但し、弊社は、商品の生産中止等、やむを得ない事情がある場合は、会員に通知することにより既に成立した売買契約を取り消すことができるものとします。\n4. 弊社は、個々の注文画面又はご利用ガイドその他の本サービス上の画面において定めがある場合を除き、会員都合での商品等の購入申込の撤回は一切受け付けないものとします。\n5. 弊社では、正確な商品情報を掲載するよう最善の努力をしますが、万が一誤った価格表記がされており、それに基づいた注文をいただいた場合は、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。\n6. 本サービス利用に関して会員による不正行為もしくは不適当な行為があった場合、または弊社が配送した商品を、理由の如何を問わず会員が受領しなかった場合、弊社は売買契約の解除、その他適切な措置を取ることができる（会員が商品代金を支払い済みの場合を含みます。）ものとします。 この場合に弊社に生じた費用（商品の配送料その他手数料を含みますが、これらに限りません。）は会員の負担とします。\n7. 弊社は、一定期間におけるお取引額が高額となる場合、ご連絡をさせていただくことがございます。会員本人へのご連絡がつかない場合、弊社は商品等の購入申込の取消、売買契約の解除その他適切な措置を取ることができるものとします。\n8. 本サービスによる商品等の配送先は、日本国内に限ります。\n9. インターネット上の障害、その他弊社に責任のない原因により、商品等購入の申込みが受理できなかった場合、弊社はその責任を負いません。\n第５条　商品の配送\n1. 商品の配送は、弊社が指定する配送業者による配送便で行います。なお、配送料は、商品の注文画面の指定に従い会員のご負担となります。\n2. 弊社は、会員の申込を受け、配送準備開始時点の配送先や配送日時の指定等を配送業者に取り次ぐこととします。\n3. 商品によっては、諸般の事情で、あらかじめご案内した納期が変更される場合や品切れ等により納期が遅れる場合、また注文に応じられない場合もあります。これらの場合でも、弊社は何ら賠償の責任を負わないものとします。\n4. 弊社が発送した商品が会員により受領されなかった場合（受取拒否又は長期不在等により受け取られなかった場合を含みます。）、弊社は、これによって弊社に生じた費用（再配達費用等）を当該会員に請求できるものとします。\n5. 弊社は、会員により受領されなかった商品を一定期間保管後に廃棄その他の処分をすることができるものとします。\n第６条　決済方法\n1. 商品等のお支払い金額は、商品購入代金、送料、決済手数料および消費税等の合計となります。\n2. 本サービスによって購入された商品等のお支払いに関しては、会員本人名義のクレジットカード（弊社が承諾するものに限ります。）によるお支払い、その他弊社が別途認めるお支払方法によるものとします。\n3. クレジットカードでのお支払いの場合は、会員がカード会社との間で別途契約する条件に従うものとします。また、会員と当該クレジットカード会社等の間で紛争が発生した場合は、当該当事者双方で解決するものとし、弊社には一切責任はないものとします。\n4. クレジットカードでお支払いの場合、商品等購入の申込時にカード会社へご利用可能の問い合わせを行います。なお、購入申込から商品発送までに一定の期間を要する場合、再度クレジットカード会社へご利用可能の問い合わせをさせていただく場合がございます。問い合わせの結果、カード会社よりご利用不可との連絡が入った場合、ご購入いただけない場合がございます。\n第７条　商品のキャンセル・返品等\n1. 会員は、原則として、商品等の注文をキャンセルすることは出来ません。但し、発送前の商品等に関しては、弊社が別途定める事由に該当する場合に限り、キャンセルすることができます。\n2. 商品等の返品及び交換等は、商品不良、品違い又は数量違い等の弊社の責めに帰すべき場合にのみ承ります。但し、商品の返品については、弊社が商品の交換品を準備できない場合に限られるものとします。\n第８条　サービスに関する免責\n1. 商品等の色合い、形状については、モニターの設定等により、画面表示と実物とで異なる場合があります。\n2. 弊社は、会員が入力した連絡先へ連絡すること、および商品等購入の際指示した発送先に商品を配送等することにより免責されるものとします。\n3. 弊社は、本サービス上での商品説明あるいは表記については、正確性、完全性、最新性等に関し最善を尽くしますが、一切誤りがないことを保証するものではありません。\n4. 弊社は、法律上の請求原因の如何を問わず、本サービスの利用から生じる如何なる損害、損失、不利益に関して責任を負わないものとします。また、本サービスにおいて売買される商品から生じた損害、損失、不利益に関して責任を負わないものとします。\n\n第３章　プレミアムポイント\n第９条　ポイントの付与\n1. ポイントの付与対象は、原則として商品代金（税込）となりますが、対象となる商品の新規設定、変更、終了等は全て弊社の判断にて行います。\n2. ポイントの付与率・付与額は、キャンペーン、商品、ショップにより異なり、当該付与ポイントはサイト上に明記されます。ポイントの付与率・付与額は予告なく変更となる場合があります。\n3. ポイントの付与、利用可能時期は、付与対象となる商品の配送完了が確認された日の翌日以降、あるいは付与対象となるキャンペーン等への当選が確認された日の翌日以降とし、かつ当社が別途定めるルールに従い付与されることとなります。\n第１０条　ポイントの管理\n1. 弊社は、弊社所定の方法により、会員が獲得したポイント数、会員が利用したポイント数および、ポイント残高を、会員に告知します。\n2. 第1項のポイント数に関する最終的な決定は弊社が行うものとし、会員はこれに従うものとします。\n第１１条　ポイントの譲渡禁止\n付与されたポイントは、いかなる場合にも、会員間での移動、譲渡、貸与、累積等はできません。\n第１２条　決済におけるポイントの利用\n1. 会員は、保有するポイントを、本サービスでの商品等の購入ならびに、商品等の購入に伴い発生する送料、決済手数料、消費税にご利用いただけます。\n2. 会員が、ポイントを使用する場合の換価率は、原則として1ポイント＝1円とします。\n第１３条　キャンセル時のポイントの取扱いについて\n1. 会員が、商品代金の一部または全部の決済にポイントを利用し、その後対象となる売買契約を、第７条によりキャンセル等をした場合、当該ポイントは会員に返還されます。なお、返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n2.(1). 第７条によりキャンセル等された売買契約に基づいてポイントの付与がなされている場合には、当該ポイントの付与はキャンセル等と同時に取り消しとさせていただきます。\n(2). キャンセル等に伴って商品等代金をお返しする場合、お返しする金額は実際にお支払頂いた金額とし、ポイント充当額は含まないものとします。ただし、取り消し前に、前項の取り消し対象のポイントをご利用している場合には、別途弊社の定める方法にて精算させていただきます。\n第１４条　商品代金変更等の場合のポイントの取扱いについて\n1. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品代金が何らかの事情で減額になった場合は、以下の対応を行うものとします。なお、ポイントの返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n(1). 会員が、商品代金の一部についてポイントを利用した場合、まず他の支払方法による代金返還が行われ、それでも返還を必要とする金額に不足がある場合には、当該不足額についてポイントの返還が行われます。\n(2). 会員が、商品代金の全部についてポイントを利用した場合、差額分のポイントを返還します。\n2. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品等代金が何らかの事情で増額になった場合、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。会員が変更後の価格での購入申込みをしない場合、利用ポイントを返還致します。\n第１５条　ポイントの失効\n1. 最後にポイントの変動（ポイントの利用または付与）があった日の翌日から起算して一年間（以下本条において「ポイント有効期間」といいます。）、ポイントの変動及び商品等のお申込のいずれも生じなかったときは、ポイント有効期間の満了を以って、その時点で有効な累積ポイントは失効するものとします。\n2. 会員が、退会した場合、その時点でポイントは失効します。\n3. 弊社は、失効したポイントについて何らの補償も行わず、一切の責任を負いません。\n第１６条　第三者による使用\n1. ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはできません。\n2. 弊社は、ポイント利用時に入力された会員IDおよびパスワードが、会員登録されたものと一致することを弊社が所定の方法により確認した場合には、当該会員による利用とみなします。それが第三者による不正利用であった場合でも、弊社は利用されたポイントを返還しません。会員に生じた損害についても一切責任を負いません。\n\n第４章　その他\n第１７条　本サービスの利用停止、会員登録の取消、ポイントの抹消\n1. 弊社は、会員が以下の各号のいずれかに該当する場合、会員に事前通知することなく本サービスの利用停止（商品等の購入申込の取消、売買契約の解除を含みます）、会員登録の取消またはポイントの一部もしくは全部を抹消することができるものとします。\n(1). 第２条（会員登録）第２項各号の事由に該当する場合\n(2). 本サービスに関する料金などの支払債務の履行遅延、その他の不履行があった場合\n(3). 第１８条（禁止事項）の行為を行った場合\n(4). 本サービスを1年以上ご利用されなかった場合\n(5). 会員が死亡した場合\n(6). その他本規約または別途定めるルール等に違反した場合\n2. 前項により会員登録が取消された場合、それ以降、本サービスは利用することができなくなります。\n第１８条　禁止事項\n会員は以下の行為を行ってはならないものとします。\n(1). 本サービス利用の際に虚偽の登録内容を申請する行為\n(2). 本サービスの運営を妨げ、その他本サービスに支障をきたすおそれのある行為\n(3). クレジットカードを不正に使用して本サービスを利用する行為\n(4). 会員IDおよびパスワードを不正に使用する行為\n(5). 法的な責任を超えた不当な要求行為\n(6). 他の会員、第三者もしくは弊社に迷惑、不利益もしくは損害を与える行為、またはそれらのおそれのある行為\n(7). 他の会員、第三者もしくは弊社の著作権等の知的財産権、プライバシーその他の権利を侵害する行為、またはそれらのおそれのある行為\n(8). 本規約に違反する行為、公序良俗に反する行為その他法令に違反する行為、またはそれらのおそれのあると弊社が判断した行為\n(9). その他、弊社が不適当と判断する行為\n第１９条　会員IDおよびパスワードの管理\n1. 会員は、会員自身で設定した会員IDおよびパスワードの管理責任を負うものとします。 また、会員IDおよびパスワードを用いて弊社に対して行われた意思表示は、その会員IDおよびパスワードに該当する会員の有効な意思表示とみなし、これにより生ずる支払い等はすべてその会員の責任となります。\n2. 会員は、会員IDおよびパスワードを第三者に譲渡、貸与、開示してはならないものとします。\n3. 会員は、会員IDおよびパスワードの管理不十分、使用上の過誤、第三者の使用などに起因する損害につき自ら責任を負うものとします。\n4. 会員は、会員IDおよびパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに弊社に連絡するものとします。\n第２０条　変更の届出\n会員は、住所、氏名、電話番号、eメールアドレスその他弊社に届出ている事項に変更が生じた場合には、弊社が別途定める方法により、すみやかに弊社に届け出るものとします。\n第２１条　退会\n会員は、都合により退会する場合は、弊社が別途定める方法により、いつでも退会できます。なお、未発送商品がある場合は、弊社による当該商品の発送及びこれに対する会員のお支払いを全て終えるまで、本規約に基づく会員の義務は存続するものとします。会員IＤ、パスワードを忘れ、退会できない方は、弊社所定の方法にてパスワードの再発行を受けるものとします。\n第２２条　著作権\n1. 会員は、権利者の許諾を得ないで、本サービスを通じて提供されるいかなる情報も、著作権法で認められる個人の私的複製等著作権の制限規定範囲外での使用をすることはできません。\n2. 本条の規定に違反して問題が生じた場合、会員は自己の責任と費用においてかかる問題を解決するとともに、弊社に何等の迷惑または損害を与えないものとします。\n第２３条　本サービス内容の変更、停止、終了等\n1. 弊社が必要と判断した場合には、会員に事前に通知することなく、いつでも本サービス内容について変更することができ、およびポイントの停止、もしくは中止、中断、終了または付与条件の変更等（以下「変更等」といいます。）を行うことができるものとします。ただし、本サービスに関して会員の権利や義務に重大な影響が生じる変更等については、合理的な予告期間を設けた上で、変更等を行うものとします。\n2. 前項のような変更を行った場合であっても、弊社は会員に対しては一切責任を負わないものとします。\n3. 第1項のような変更を行った場合であっても、変更前に成立した本サービスに基づく売買契約及びすでに行われているポイントの利用には影響しないものとします。\n4. 弊社が必要と判断した場合には、サイト上に告知することで、いつでも本サービスを廃止することができるものとします。\n5. 本サービス廃止の場合、会員のポイント残高は無効となり、現金等への交換その他の精算はいたしません。\n第２４条　個人情報\n1. 弊社は、会員情報に含まれる個人を識別できる情報（以下「個人情報」といいます。）を厳重に管理の上、弊社が提供する本サービス（ご注文された商品や景品等をお届けする上で必要な業務、顧客管理および、各種お問い合わせ対応）及び弊社が提供する他の顧客サービス（ダイレクトメール等会員に有益かつ必要と思われる情報の送付、商品等の広告、本サービスサイト上で開催されるキャンペーン企画、アンケート等における応募者の認証等）の円滑な運営、業務遂行上で必要となる弊社からの問い合わせ、確認、サービス向上のための意見収集およびマーケティングを目的として、その範囲内においてのみ、収集・利用するものとします。なお、顧客管理には、本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行うことを含みます。\n2. 当サイトによる個人情報の収集・利用は、会員の自発的な提供によるものであり、会員が個人情報を提供した場合は、弊社が別途定める＜個人情報保護方針（プライバシーポリシー）＞（以下「本方針」といいます。）に則って個人情報を利用することを会員が許諾したものとします。\n3. 弊社は、以下の場合を除き、会員の個人情報を第三者に一切提供又は開示しません。個人情報の提供を行う場合、必要な範囲を超えて個人情報を提供することはありません。\n(1)．会員に対し商品等又はキャンペーンの広告やアンケート等を行う場合。この場合、広告媒体を運営する第三者に対し、当社が取得した会員の個人情報を提供する場合があります。これにより、会員が当該第三者のサービスを利用する際に商品等やキャンペーンに関する広告が表示されることがあります。（※運営会社及び提携会社が日本国外にある場合の外国の名称等は以下をご確認ください。）\n日本国外への個人情報の提供について\n個人情報の提供先となり得る国外の国における個人情報の保護に関する制度等については、個人情報保護委員会のウェブサイトにてご参照ください。\n個人情報保護委員会　外国における個人情報の保護に関する制度等の調査\n（https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/#gaikoku）\n\n■広告配信サービス等を提供する提携会社と所在国・地域名\nGoogle LLC [アメリカ合衆国]\nX Corp.[アメリカ合衆国]\nMicrosoft Corporation[アメリカ合衆国]\nMeta Platforms Inc.[アメリカ合衆国]\nByteDance, Ltd[シンガポール]\nリンクシェア・ジャパン株式会社[アメリカ合衆国]\n\n■国外個人情報提供先について\n提供先の講じている個人情報保護措置：日本国内の個人情報取扱事業者に求められる措置と同水準の措置を講じています。\n(2)．マーケティングを行う場合（分析、及び弊社公式アカウントでの広告用メール配信・SNSでのメッセージ配信・アプリでのメッセージ配信等）\n(3). 予め会員の同意を得ている場合\n(4). 法令等に基づき認められる場合又は正当な開示の要求がある場合\n(5). 弊社の業務委託先に対して、委託業務以外に個人情報を利用しないよう予め契約を締結した上で提供する場合\n(6). 決済会社での本人確認、請求先確認及び与信調査を行う場合\n(7). 商品等の販売に付随する対応を、商品製造元・グループ会社等と共同で行う場合\n(8). 会員が本サービスとSNSアカウント・外部サイトアカウントとの連携を行う場合\n(9). 本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行う場合\n4. 弊社は、販売促進等を目的として、個人を識別できない統計データの形式で会員情報を第三者に提供又は開示することがあります。\n5. 本サービスでは、以下に記載する目的で、「クッキー(cookie)」機能を使用することがあります。\n(1) 会員が本サービスに再訪問する際、より便利に本サービスをご利用いただくため\n(2) 本サービスの利用状況を計測・解析するため\n6. 会員がクッキーを発行するコンテンツを訪問した場合、会員のコンピュータにクッキーが記録されますが、記録される情報には、会員個人を識別できる情報は含まれていません。\n7.会員自らブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本サービスの一部がご利用できなくなることがあります。\n8. 第１項のキャンペーン企画、アンケート等において、会員の判断により会員の情報を入力しないという選択をすることもできますが、その結果、本サービスの一部がご利用できなくなる場合があります。\n9. 本条に定めなき個人情報に関する事由は、本方針に従うものとします。\n第２５条　　その他免責事項\n1. 弊社は、以下の場合に一時的に本サービスの提供を停止、中止、中断等の措置を行うことがあります。これにより会員が本サービスの全部又は一部をご利用になれず、会員に損害が生じた場合においても、弊社は当該損害についていかなる責任も負わないものとします。\n(1)本サービスの障害、保守又はメンテナンスを緊急に行う必要がある場合。\n(2)天災地変、自然災害、停電等の不可抗力により本サービスの運営が出来なくなった場合。\n(3)通信回線等の事故により本サービスが停止した場合。\n2. 弊社は、会員の登録内容に従い事務を処理することにより免責されるものとします。\n3. 会員が、本サービスをご利用になることにより、他の会員または第三者に対して損害等を与えた場合には、当該会員は自己の責任と費用において解決し、弊社には一切迷惑を与えないものとします。\n第２６条　　損害賠償の範囲\n1.　本規約の規定にかかわらず、会員による本サービスの利用に関し、消費者契約法が適用される場合、かつ会員に生じた損害に弊社の責めに帰すべき事由がある場合、弊社は、以下の区分に従い、賠償するものとします。\n（1）会員に生じた損害が弊社の故意又は重過失に起因する場合は、民法等の規定に基づく責任\n（2）会員に生じた損害が弊社の故意又は重過失に起因しない場合は、会員が直接かつ現実に被った損害を上限とした責任（付随的損害、間接損害、特別損害及び逸失利益に関する損害については、責任を負わないものとします。）\n2. 会員が被った損害が、会員が本規約に違反する等、会員の責に帰すべき事由（当該事由に基づく弊社の作為又は不作為を含みます。）に起因する場合、弊社は当該損害について責任を負わないものとします。\n第２７条　　連絡方法\n会員から弊社への連絡は、弊社指定の問合せフォームによるものとします。\n第２８条　　本規約の範囲及び変更\n1. 本規約は本サービスの利用に関し、本サービスを利用される会員に適用されるものとします。 ただし、本サービス利用において、本規約と異なる別段の条件がある場合には、本規約に優先してその条件が適用されるものとします。\n2. 弊社は、会員に事前の承諾を得ることなく、弊社が適当と判断する方法（ｅメール、サイト上への掲載等）で、予め合理的な告知期間をもって会員に通知することにより本規約を変更できるものとします。本規約の変更後の本サービスのご利用については、変更後の規約が適用されます。\n第２９条　分離可能性\n本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効とされた場合であっても、本規約の残りの規定及び一部が無効と判断された規定の残りの部分は、継続して完全に効力を有するものとします。\n第３０条　準拠法および合意管轄\n1. 本サービスは、日本法に準拠して解釈されるものとします。\n2. 本サービスにおいて紛争が発生した場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n2009年4月1日　制定\n2017年12月12日　改訂\n2018年4月1日　改訂\n2020年3月26日　改訂\n2020年11月25日　改訂\n2021年9月28日　改訂\n2022年4月28日　改訂\n2022年9月27日　改訂\n2023年6月28日　改訂\n2024年1月5日　改訂\n2024年4月1日　改訂",
        "sort_id": 1
    },
    {
        "id": 1006,
        "term_id": 1001,
        "type": 2,
        "revision": 2,
        "platform": 3,
        "lang": "ja_JP",
        "title": "プレミアムバンダイ　会員規約",
        "desc": "リアルグッズの購入にあたり、以下の「プレミアムバンダイ」会員規約の内容に同意していただく必要があります。\n内容をご確認のうえ、チェックをして「同意する」ボタンを押してください。",
        "content": "\nプレミアムバンダイ　会員規約\n株式会社BANDAI SPIRITS（以下「弊社」といいます。）の運営するサイト、プレミアムバンダイ（以下「本サービス」といいます。）の会員規約（以下｢本規約｣といいます。）を以下の通り定めます。会員に登録していただくには、以下の条項をよくお読みのうえ、同意していただくことが必要です。また、未成年者の場合は、保護者の同意を得る必要があります。\n\n第１章　総則\n第１条　定義\n「会員」とは、本規約に同意いただいた上、弊社所定の手続に従い会員登録を申請し、弊社がこれを承認した方をいいます。\n「本サービス」とは、弊社が運営するショッピングポータルサイト『プレミアムバンダイ』における、会員に向けた商品の販売、会員特典の提供その他のサービス全般を指します。\n「プレミアムポイント」（以下「ポイント」といいます。）とは、本規約 第3章で定めるルールに基づき、会員に付与されるポイントをいいます。\n第２条　会員登録\n1. 入会希望者は、本サービスの会員登録ページから、別途弊社の指定する方法に従い会員登録申請を行い、お一人につき、一つの会員IDを無料にて取得することができるものとします。また、弊社からの登録完了のメールの到着をもって登録の承認とさせていただきます。尚、登録完了までにはお時間がかかる場合がございます。\n2. 会員登録および本サービスの利用は、日本に住所登録もしくは居住地登録をしている方に限ります。\n3. 弊社は、以下の各号のいずれかに該当する場合、会員登録の承認を拒み又は取消すことができるものとします。\n尚、必要に応じて、公的証明（マイナンバーカード・免許証・保険証・パスポート等）による申請内容又は会員登録情報の確認をさせていただく場合があります。\n(1). 入会希望者が過去に本規約等に反する行為をしたことなどにより、会員登録の取消などの処分を受けていることが判明した場合\n(2). 入会希望者の申請内容に事実に反する事項が含まれている場合\n(3). 公的証明の提示にご協力いただけない場合\n(4). 営利目的・転売目的で本サービスの利用をし又は利用しようとしていると弊社が判断した場合\n(5).　反社会的勢力等（暴力団、暴力団員、暴力団準構成員、暴力団関係企業、総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者）とのいずれかとの何らかの交流若しくは関与があると弊社が判断した場合\n(6). その他登録申請を承認することが不適当であると弊社が判断する場合\n第３条　本サービスの利用\n会員は、本規約又は弊社が別途定めるルール等に従い、本サービスを利用することができるものとします。\n\n第２章 商品購入\n第４条　商品の購入\n1. 会員は、本サービスを利用して、商品またはサービス（以下「商品等」といいます。）を購入することができます。\n2. 会員は、商品等の購入を希望する場合、弊社が指定する方法に従って商品の購入を申込むものとします。\n3. 商品購入に関する売買契約は、商品の注文が完了した時点（会員により登録されたメールアドレス宛に「注文内容のご確認」メールが送られます。別途弊社が売買契約の成立時期を定めた場合はこの限りではありません。）で成立することとします。但し、弊社は、商品の生産中止等、やむを得ない事情がある場合は、会員に通知することにより既に成立した売買契約を取り消すことができるものとします。\n4. 弊社は、個々の注文画面又はご利用ガイドその他の本サービス上の画面において定めがある場合を除き、会員都合での商品等の購入申込の撤回は一切受け付けないものとします。\n5. 弊社では、正確な商品情報を掲載するよう最善の努力をしますが、万が一誤った価格表記がされており、それに基づいた注文をいただいた場合は、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。\n6. 本サービス利用に関して会員による不正行為もしくは不適当な行為があった場合、または弊社が配送した商品を、理由の如何を問わず会員が受領しなかった場合、弊社は売買契約の解除、その他適切な措置を取ることができる（会員が商品代金を支払い済みの場合を含みます。）ものとします。 この場合に弊社に生じた費用（商品の配送料その他手数料を含みますが、これらに限りません。）は会員の負担とします。\n7. 弊社は、一定期間におけるお取引額が高額となる場合、ご連絡をさせていただくことがございます。会員本人へのご連絡がつかない場合、弊社は商品等の購入申込の取消、売買契約の解除その他適切な措置を取ることができるものとします。\n8. 本サービスによる商品等の配送先は、日本国内に限ります。\n9. インターネット上の障害、その他弊社に責任のない原因により、商品等購入の申込みが受理できなかった場合、弊社はその責任を負いません。\n第５条　商品の配送\n1. 商品の配送は、弊社が指定する配送業者による配送便で行います。なお、配送料は、商品の注文画面の指定に従い会員のご負担となります。\n2. 弊社は、会員の申込を受け、配送準備開始時点の配送先や配送日時の指定等を配送業者に取り次ぐこととします。\n3. 商品によっては、諸般の事情で、あらかじめご案内した納期が変更される場合や品切れ等により納期が遅れる場合、また注文に応じられない場合もあります。これらの場合でも、弊社は何ら賠償の責任を負わないものとします。\n4. 弊社が発送した商品が会員により受領されなかった場合（受取拒否又は長期不在等により受け取られなかった場合を含みます。）、弊社は、これによって弊社に生じた費用（再配達費用等）を当該会員に請求できるものとします。\n5. 弊社は、会員により受領されなかった商品を一定期間保管後に廃棄その他の処分をすることができるものとします。\n第６条　決済方法\n1. 商品等のお支払い金額は、商品購入代金、送料、決済手数料および消費税等の合計となります。\n2. 本サービスによって購入された商品等のお支払いに関しては、会員本人名義のクレジットカード（弊社が承諾するものに限ります。）によるお支払い、その他弊社が別途認めるお支払方法によるものとします。\n3. クレジットカードでのお支払いの場合は、会員がカード会社との間で別途契約する条件に従うものとします。また、会員と当該クレジットカード会社等の間で紛争が発生した場合は、当該当事者双方で解決するものとし、弊社には一切責任はないものとします。\n4. クレジットカードでお支払いの場合、商品等購入の申込時にカード会社へご利用可能の問い合わせを行います。なお、購入申込から商品発送までに一定の期間を要する場合、再度クレジットカード会社へご利用可能の問い合わせをさせていただく場合がございます。問い合わせの結果、カード会社よりご利用不可との連絡が入った場合、ご購入いただけない場合がございます。\n第７条　商品のキャンセル・返品等\n1. 会員は、原則として、商品等の注文をキャンセルすることは出来ません。但し、発送前の商品等に関しては、弊社が別途定める事由に該当する場合に限り、キャンセルすることができます。\n2. 商品等の返品及び交換等は、商品不良、品違い又は数量違い等の弊社の責めに帰すべき場合にのみ承ります。但し、商品の返品については、弊社が商品の交換品を準備できない場合に限られるものとします。\n第８条　サービスに関する免責\n1. 商品等の色合い、形状については、モニターの設定等により、画面表示と実物とで異なる場合があります。\n2. 弊社は、会員が入力した連絡先へ連絡すること、および商品等購入の際指示した発送先に商品を配送等することにより免責されるものとします。\n3. 弊社は、本サービス上での商品説明あるいは表記については、正確性、完全性、最新性等に関し最善を尽くしますが、一切誤りがないことを保証するものではありません。\n4. 弊社は、法律上の請求原因の如何を問わず、本サービスの利用から生じる如何なる損害、損失、不利益に関して責任を負わないものとします。また、本サービスにおいて売買される商品から生じた損害、損失、不利益に関して責任を負わないものとします。\n\n第３章　プレミアムポイント\n第９条　ポイントの付与\n1. ポイントの付与対象は、原則として商品代金（税込）となりますが、対象となる商品の新規設定、変更、終了等は全て弊社の判断にて行います。\n2. ポイントの付与率・付与額は、キャンペーン、商品、ショップにより異なり、当該付与ポイントはサイト上に明記されます。ポイントの付与率・付与額は予告なく変更となる場合があります。\n3. ポイントの付与、利用可能時期は、付与対象となる商品の配送完了が確認された日の翌日以降、あるいは付与対象となるキャンペーン等への当選が確認された日の翌日以降とし、かつ当社が別途定めるルールに従い付与されることとなります。\n第１０条　ポイントの管理\n1. 弊社は、弊社所定の方法により、会員が獲得したポイント数、会員が利用したポイント数および、ポイント残高を、会員に告知します。\n2. 第1項のポイント数に関する最終的な決定は弊社が行うものとし、会員はこれに従うものとします。\n第１１条　ポイントの譲渡禁止\n付与されたポイントは、いかなる場合にも、会員間での移動、譲渡、貸与、累積等はできません。\n第１２条　決済におけるポイントの利用\n1. 会員は、保有するポイントを、本サービスでの商品等の購入ならびに、商品等の購入に伴い発生する送料、決済手数料、消費税にご利用いただけます。\n2. 会員が、ポイントを使用する場合の換価率は、原則として1ポイント＝1円とします。\n第１３条　キャンセル時のポイントの取扱いについて\n1. 会員が、商品代金の一部または全部の決済にポイントを利用し、その後対象となる売買契約を、第７条によりキャンセル等をした場合、当該ポイントは会員に返還されます。なお、返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n2.(1). 第７条によりキャンセル等された売買契約に基づいてポイントの付与がなされている場合には、当該ポイントの付与はキャンセル等と同時に取り消しとさせていただきます。\n(2). キャンセル等に伴って商品等代金をお返しする場合、お返しする金額は実際にお支払頂いた金額とし、ポイント充当額は含まないものとします。ただし、取り消し前に、前項の取り消し対象のポイントをご利用している場合には、別途弊社の定める方法にて精算させていただきます。\n第１４条　商品代金変更等の場合のポイントの取扱いについて\n1. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品代金が何らかの事情で減額になった場合は、以下の対応を行うものとします。なお、ポイントの返還処理にはシステム処理の都合で、一定の日数を頂戴します。\n(1). 会員が、商品代金の一部についてポイントを利用した場合、まず他の支払方法による代金返還が行われ、それでも返還を必要とする金額に不足がある場合には、当該不足額についてポイントの返還が行われます。\n(2). 会員が、商品代金の全部についてポイントを利用した場合、差額分のポイントを返還します。\n2. 会員が、ポイントを利用して商品等の購入申込みをし、商品発送手続前に商品等代金が何らかの事情で増額になった場合、売買契約成立までに弊社から変更の通知を行い、改めて変更後の価格でその注文の意思を確認させていただきます。会員が変更後の価格での購入申込みをしない場合、利用ポイントを返還致します。\n第１５条　ポイントの失効\n1. 最後にポイントの変動（ポイントの利用または付与）があった日の翌日から起算して一年間（以下本条において「ポイント有効期間」といいます。）、ポイントの変動及び商品等のお申込のいずれも生じなかったときは、ポイント有効期間の満了を以って、その時点で有効な累積ポイントは失効するものとします。\n2. 会員が、退会した場合、その時点でポイントは失効します。\n3. 弊社は、失効したポイントについて何らの補償も行わず、一切の責任を負いません。\n第１６条　第三者による使用\n1. ポイントの利用は、会員本人が行うものとし、当該会員以外の第三者が行うことはできません。\n2. 弊社は、ポイント利用時に入力された会員IDおよびパスワードが、会員登録されたものと一致することを弊社が所定の方法により確認した場合には、当該会員による利用とみなします。それが第三者による不正利用であった場合でも、弊社は利用されたポイントを返還しません。会員に生じた損害についても一切責任を負いません。\n\n第４章　その他\n第１７条　本サービスの利用停止、会員登録の取消、ポイントの抹消\n1. 弊社は、会員が以下の各号のいずれかに該当する場合、会員に事前通知することなく本サービスの利用停止（商品等の購入申込の取消、売買契約の解除を含みます）、会員登録の取消またはポイントの一部もしくは全部を抹消することができるものとします。\n(1). 第２条（会員登録）第２項各号の事由に該当する場合\n(2). 本サービスに関する料金などの支払債務の履行遅延、その他の不履行があった場合\n(3). 第１８条（禁止事項）の行為を行った場合\n(4). 本サービスを1年以上ご利用されなかった場合\n(5). 会員が死亡した場合\n(6). その他本規約または別途定めるルール等に違反した場合\n2. 前項により会員登録が取消された場合、それ以降、本サービスは利用することができなくなります。\n第１８条　禁止事項\n会員は以下の行為を行ってはならないものとします。\n(1). 本サービス利用の際に虚偽の登録内容を申請する行為\n(2). 本サービスの運営を妨げ、その他本サービスに支障をきたすおそれのある行為\n(3). クレジットカードを不正に使用して本サービスを利用する行為\n(4). 会員IDおよびパスワードを不正に使用する行為\n(5). 法的な責任を超えた不当な要求行為\n(6). 他の会員、第三者もしくは弊社に迷惑、不利益もしくは損害を与える行為、またはそれらのおそれのある行為\n(7). 他の会員、第三者もしくは弊社の著作権等の知的財産権、プライバシーその他の権利を侵害する行為、またはそれらのおそれのある行為\n(8). 本規約に違反する行為、公序良俗に反する行為その他法令に違反する行為、またはそれらのおそれのあると弊社が判断した行為\n(9). その他、弊社が不適当と判断する行為\n第１９条　会員IDおよびパスワードの管理\n1. 会員は、会員自身で設定した会員IDおよびパスワードの管理責任を負うものとします。 また、会員IDおよびパスワードを用いて弊社に対して行われた意思表示は、その会員IDおよびパスワードに該当する会員の有効な意思表示とみなし、これにより生ずる支払い等はすべてその会員の責任となります。\n2. 会員は、会員IDおよびパスワードを第三者に譲渡、貸与、開示してはならないものとします。\n3. 会員は、会員IDおよびパスワードの管理不十分、使用上の過誤、第三者の使用などに起因する損害につき自ら責任を負うものとします。\n4. 会員は、会員IDおよびパスワードが第三者によって不正に使用されていることが判明した場合には、直ちに弊社に連絡するものとします。\n第２０条　変更の届出\n会員は、住所、氏名、電話番号、eメールアドレスその他弊社に届出ている事項に変更が生じた場合には、弊社が別途定める方法により、すみやかに弊社に届け出るものとします。\n第２１条　退会\n会員は、都合により退会する場合は、弊社が別途定める方法により、いつでも退会できます。なお、未発送商品がある場合は、弊社による当該商品の発送及びこれに対する会員のお支払いを全て終えるまで、本規約に基づく会員の義務は存続するものとします。会員IＤ、パスワードを忘れ、退会できない方は、弊社所定の方法にてパスワードの再発行を受けるものとします。\n第２２条　著作権\n1. 会員は、権利者の許諾を得ないで、本サービスを通じて提供されるいかなる情報も、著作権法で認められる個人の私的複製等著作権の制限規定範囲外での使用をすることはできません。\n2. 本条の規定に違反して問題が生じた場合、会員は自己の責任と費用においてかかる問題を解決するとともに、弊社に何等の迷惑または損害を与えないものとします。\n第２３条　本サービス内容の変更、停止、終了等\n1. 弊社が必要と判断した場合には、会員に事前に通知することなく、いつでも本サービス内容について変更することができ、およびポイントの停止、もしくは中止、中断、終了または付与条件の変更等（以下「変更等」といいます。）を行うことができるものとします。ただし、本サービスに関して会員の権利や義務に重大な影響が生じる変更等については、合理的な予告期間を設けた上で、変更等を行うものとします。\n2. 前項のような変更を行った場合であっても、弊社は会員に対しては一切責任を負わないものとします。\n3. 第1項のような変更を行った場合であっても、変更前に成立した本サービスに基づく売買契約及びすでに行われているポイントの利用には影響しないものとします。\n4. 弊社が必要と判断した場合には、サイト上に告知することで、いつでも本サービスを廃止することができるものとします。\n5. 本サービス廃止の場合、会員のポイント残高は無効となり、現金等への交換その他の精算はいたしません。\n第２４条　個人情報\n1. 弊社は、会員情報に含まれる個人を識別できる情報（以下「個人情報」といいます。）を厳重に管理の上、弊社が提供する本サービス（ご注文された商品や景品等をお届けする上で必要な業務、顧客管理および、各種お問い合わせ対応）及び弊社が提供する他の顧客サービス（ダイレクトメール等会員に有益かつ必要と思われる情報の送付、商品等の広告、本サービスサイト上で開催されるキャンペーン企画、アンケート等における応募者の認証等）の円滑な運営、業務遂行上で必要となる弊社からの問い合わせ、確認、サービス向上のための意見収集およびマーケティングを目的として、その範囲内においてのみ、収集・利用するものとします。なお、顧客管理には、本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行うことを含みます。\n2. 当サイトによる個人情報の収集・利用は、会員の自発的な提供によるものであり、会員が個人情報を提供した場合は、弊社が別途定める＜個人情報保護方針（プライバシーポリシー）＞（以下「本方針」といいます。）に則って個人情報を利用することを会員が許諾したものとします。\n3. 弊社は、以下の場合を除き、会員の個人情報を第三者に一切提供又は開示しません。個人情報の提供を行う場合、必要な範囲を超えて個人情報を提供することはありません。\n(1)．会員に対し商品等又はキャンペーンの広告やアンケート等を行う場合。この場合、広告媒体を運営する第三者に対し、当社が取得した会員の個人情報を提供する場合があります。これにより、会員が当該第三者のサービスを利用する際に商品等やキャンペーンに関する広告が表示されることがあります。（※運営会社及び提携会社が日本国外にある場合の外国の名称等は以下をご確認ください。）\n日本国外への個人情報の提供について\n個人情報の提供先となり得る国外の国における個人情報の保護に関する制度等については、個人情報保護委員会のウェブサイトにてご参照ください。\n個人情報保護委員会　外国における個人情報の保護に関する制度等の調査\n（https://www.ppc.go.jp/personalinfo/legal/kaiseihogohou/#gaikoku）\n\n■広告配信サービス等を提供する提携会社と所在国・地域名\nGoogle LLC [アメリカ合衆国]\nX Corp.[アメリカ合衆国]\nMicrosoft Corporation[アメリカ合衆国]\nMeta Platforms Inc.[アメリカ合衆国]\nByteDance, Ltd[シンガポール]\nリンクシェア・ジャパン株式会社[アメリカ合衆国]\n\n■国外個人情報提供先について\n提供先の講じている個人情報保護措置：日本国内の個人情報取扱事業者に求められる措置と同水準の措置を講じています。\n(2)．マーケティングを行う場合（分析、及び弊社公式アカウントでの広告用メール配信・SNSでのメッセージ配信・アプリでのメッセージ配信等）\n(3). 予め会員の同意を得ている場合\n(4). 法令等に基づき認められる場合又は正当な開示の要求がある場合\n(5). 弊社の業務委託先に対して、委託業務以外に個人情報を利用しないよう予め契約を締結した上で提供する場合\n(6). 決済会社での本人確認、請求先確認及び与信調査を行う場合\n(7). 商品等の販売に付随する対応を、商品製造元・グループ会社等と共同で行う場合\n(8). 会員が本サービスとSNSアカウント・外部サイトアカウントとの連携を行う場合\n(9). 本サービスの利用停止事由又は本規約違反の有無を確認するため外部調査機関等での調査を行う場合\n4. 弊社は、販売促進等を目的として、個人を識別できない統計データの形式で会員情報を第三者に提供又は開示することがあります。\n5. 本サービスでは、以下に記載する目的で、「クッキー(cookie)」機能を使用することがあります。\n(1) 会員が本サービスに再訪問する際、より便利に本サービスをご利用いただくため\n(2) 本サービスの利用状況を計測・解析するため\n6. 会員がクッキーを発行するコンテンツを訪問した場合、会員のコンピュータにクッキーが記録されますが、記録される情報には、会員個人を識別できる情報は含まれていません。\n7.会員自らブラウザの設定を変更することにより、クッキーの受け取りを拒否することもできます。ただし、この場合には、本サービスの一部がご利用できなくなることがあります。\n8. 第１項のキャンペーン企画、アンケート等において、会員の判断により会員の情報を入力しないという選択をすることもできますが、その結果、本サービスの一部がご利用できなくなる場合があります。\n9. 本条に定めなき個人情報に関する事由は、本方針に従うものとします。\n第２５条　　その他免責事項\n1. 弊社は、以下の場合に一時的に本サービスの提供を停止、中止、中断等の措置を行うことがあります。これにより会員が本サービスの全部又は一部をご利用になれず、会員に損害が生じた場合においても、弊社は当該損害についていかなる責任も負わないものとします。\n(1)本サービスの障害、保守又はメンテナンスを緊急に行う必要がある場合。\n(2)天災地変、自然災害、停電等の不可抗力により本サービスの運営が出来なくなった場合。\n(3)通信回線等の事故により本サービスが停止した場合。\n2. 弊社は、会員の登録内容に従い事務を処理することにより免責されるものとします。\n3. 会員が、本サービスをご利用になることにより、他の会員または第三者に対して損害等を与えた場合には、当該会員は自己の責任と費用において解決し、弊社には一切迷惑を与えないものとします。\n第２６条　　損害賠償の範囲\n1.　本規約の規定にかかわらず、会員による本サービスの利用に関し、消費者契約法が適用される場合、かつ会員に生じた損害に弊社の責めに帰すべき事由がある場合、弊社は、以下の区分に従い、賠償するものとします。\n（1）会員に生じた損害が弊社の故意又は重過失に起因する場合は、民法等の規定に基づく責任\n（2）会員に生じた損害が弊社の故意又は重過失に起因しない場合は、会員が直接かつ現実に被った損害を上限とした責任（付随的損害、間接損害、特別損害及び逸失利益に関する損害については、責任を負わないものとします。）\n2. 会員が被った損害が、会員が本規約に違反する等、会員の責に帰すべき事由（当該事由に基づく弊社の作為又は不作為を含みます。）に起因する場合、弊社は当該損害について責任を負わないものとします。\n第２７条　　連絡方法\n会員から弊社への連絡は、弊社指定の問合せフォームによるものとします。\n第２８条　　本規約の範囲及び変更\n1. 本規約は本サービスの利用に関し、本サービスを利用される会員に適用されるものとします。 ただし、本サービス利用において、本規約と異なる別段の条件がある場合には、本規約に優先してその条件が適用されるものとします。\n2. 弊社は、会員に事前の承諾を得ることなく、弊社が適当と判断する方法（ｅメール、サイト上への掲載等）で、予め合理的な告知期間をもって会員に通知することにより本規約を変更できるものとします。本規約の変更後の本サービスのご利用については、変更後の規約が適用されます。\n第２９条　分離可能性\n本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効とされた場合であっても、本規約の残りの規定及び一部が無効と判断された規定の残りの部分は、継続して完全に効力を有するものとします。\n第３０条　準拠法および合意管轄\n1. 本サービスは、日本法に準拠して解釈されるものとします。\n2. 本サービスにおいて紛争が発生した場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。\n2009年4月1日　制定\n2017年12月12日　改訂\n2018年4月1日　改訂\n2020年3月26日　改訂\n2020年11月25日　改訂\n2021年9月28日　改訂\n2022年4月28日　改訂\n2022年9月27日　改訂\n2023年6月28日　改訂\n2024年1月5日　改訂\n2024年4月1日　改訂",
        "sort_id": 1
    }
]