#ifndef UE4SS_SDK_WBP_SkillTreeHorizon_HPP
#define UE4SS_SDK_WBP_SkillTreeHorizon_HPP

class UWBP_SkillTreeHorizon_C : public UUserWidget
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0278 (size: 0x8)
    class UWidgetAnimation* AnimIn_Datail;                                            // 0x0280 (size: 0x8)
    class UWidgetAnimation* AnimIn;                                                   // 0x0288 (size: 0x8)
    class UImage* abilityB_Icon_bg;                                                   // 0x0290 (size: 0x8)
    class UImage* abilityC_Icon_bg;                                                   // 0x0298 (size: 0x8)
    class UImage* Arrow01;                                                            // 0x02A0 (size: 0x8)
    class UImage* Arrow01_1;                                                          // 0x02A8 (size: 0x8)
    class UImage* Arrow01_2;                                                          // 0x02B0 (size: 0x8)
    class UImage* Arrow02;                                                            // 0x02B8 (size: 0x8)
    class UImage* Arrow02_1;                                                          // 0x02C0 (size: 0x8)
    class UImage* Arrow02_2;                                                          // 0x02C8 (size: 0x8)
    class UImage* Arrow02_3;                                                          // 0x02D0 (size: 0x8)
    class UImage* Arrow02_4;                                                          // 0x02D8 (size: 0x8)
    class UImage* Arrow02_5;                                                          // 0x02E0 (size: 0x8)
    class UImage* arrow_4_01;                                                         // 0x02E8 (size: 0x8)
    class UImage* arrow_4_02;                                                         // 0x02F0 (size: 0x8)
    class UImage* arrow_5_01;                                                         // 0x02F8 (size: 0x8)
    class UImage* arrow_5_02;                                                         // 0x0300 (size: 0x8)
    class UCanvasPanel* ArrowLv0;                                                     // 0x0308 (size: 0x8)
    class UCanvasPanel* ArrowLv0_1;                                                   // 0x0310 (size: 0x8)
    class UCanvasPanel* ArrowLv0_2;                                                   // 0x0318 (size: 0x8)
    class UCanvasPanel* ArrowLv0_3;                                                   // 0x0320 (size: 0x8)
    class UCanvasPanel* ArrowLv1;                                                     // 0x0328 (size: 0x8)
    class UCanvasPanel* ArrowLv1_1;                                                   // 0x0330 (size: 0x8)
    class UCanvasPanel* ArrowLv1_2;                                                   // 0x0338 (size: 0x8)
    class UCanvasPanel* ArrowLv2;                                                     // 0x0340 (size: 0x8)
    class UCanvasPanel* ArrowLv2_1;                                                   // 0x0348 (size: 0x8)
    class UCanvasPanel* ArrowLv2_2;                                                   // 0x0350 (size: 0x8)
    class UCanvasPanel* ArrowLv3;                                                     // 0x0358 (size: 0x8)
    class UCanvasPanel* ArrowLv3_1;                                                   // 0x0360 (size: 0x8)
    class UCanvasPanel* ArrowLv3_2;                                                   // 0x0368 (size: 0x8)
    class UCanvasPanel* ArrowLv3_3;                                                   // 0x0370 (size: 0x8)
    class UCanvasPanel* ArrowLv3_4;                                                   // 0x0378 (size: 0x8)
    class UImage* BG;                                                                 // 0x0380 (size: 0x8)
    class UImage* Bg01;                                                               // 0x0388 (size: 0x8)
    class UImage* BG02;                                                               // 0x0390 (size: 0x8)
    class UImage* Bg03;                                                               // 0x0398 (size: 0x8)
    class UClassIconL_C* ClassIcon;                                                   // 0x03A0 (size: 0x8)
    class UCmnBack01_C* CmnBack01;                                                    // 0x03A8 (size: 0x8)
    class UCanvasPanel* Detail;                                                       // 0x03B0 (size: 0x8)
    class UImage* DetailBG01;                                                         // 0x03B8 (size: 0x8)
    class UImage* DetailBG02;                                                         // 0x03C0 (size: 0x8)
    class UImage* Image_Icon;                                                         // 0x03C8 (size: 0x8)
    class UImage* Image_Normal;                                                       // 0x03D0 (size: 0x8)
    class UWidgetSwitcher* LevelArrow;                                                // 0x03D8 (size: 0x8)
    class UWidgetSwitcher* LevelArrow_1;                                              // 0x03E0 (size: 0x8)
    class UWidgetSwitcher* LevelArrow_2;                                              // 0x03E8 (size: 0x8)
    class UImage* Line01;                                                             // 0x03F0 (size: 0x8)
    class UImage* Line01_01;                                                          // 0x03F8 (size: 0x8)
    class UImage* Line02;                                                             // 0x0400 (size: 0x8)
    class UImage* Line03;                                                             // 0x0408 (size: 0x8)
    class UImage* Line03_1;                                                           // 0x0410 (size: 0x8)
    class UImage* Line03_2;                                                           // 0x0418 (size: 0x8)
    class UImage* Line03_01;                                                          // 0x0420 (size: 0x8)
    class UWBP_SkillTreeMediaPlayerEmbedded_C* Movie;                                 // 0x0428 (size: 0x8)
    class UCanvasPanel* NoMovie;                                                      // 0x0430 (size: 0x8)
    class UCanvasPanel* NoSelect;                                                     // 0x0438 (size: 0x8)
    class UCanvasPanel* RightWidgetsAnker;                                            // 0x0440 (size: 0x8)
    class USBRuntimeTextBlock* SBRuntimeTextBlock_130;                                // 0x0448 (size: 0x8)
    class USBRuntimeTextBlock* SBRuntimeTextBlock_248;                                // 0x0450 (size: 0x8)
    class USBRuntimeTextBlock* SBRuntimeTextBlock_Alpha;                              // 0x0458 (size: 0x8)
    class USBRuntimeTextBlock* SBRuntimeTextBlock_Level;                              // 0x0460 (size: 0x8)
    class USBRuntimeTextBlock* SBRuntimeTextBlock_Name;                               // 0x0468 (size: 0x8)
    class USBRuntimeTextBlock* SBRuntimeTextBlock_Type;                               // 0x0470 (size: 0x8)
    class UWidgetSwitcher* SW_AbilityIconBg;                                          // 0x0478 (size: 0x8)
    class UImage* TitleBg;                                                            // 0x0480 (size: 0x8)
    class UImage* TitleBg_1;                                                          // 0x0488 (size: 0x8)
    class UImage* TitleBg_2;                                                          // 0x0490 (size: 0x8)
    class UImage* TitleBg_3;                                                          // 0x0498 (size: 0x8)
    class UUIBlocker_C* UIBlocker;                                                    // 0x04A0 (size: 0x8)
    class UCanvasPanel* Unlearned;                                                    // 0x04A8 (size: 0x8)
    class UCanvasPanel* Unlearned_1;                                                  // 0x04B0 (size: 0x8)
    class UCanvasPanel* Unlearned_2;                                                  // 0x04B8 (size: 0x8)
    class UCanvasPanel* Unlearned_3;                                                  // 0x04C0 (size: 0x8)
    class UWBP_SkillDescriptionBasics_C* WBP_SkillDescriptionBasics;                  // 0x04C8 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_1;                // 0x04D0 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_2;                // 0x04D8 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_3;                // 0x04E0 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_4_1;              // 0x04E8 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_4_2;              // 0x04F0 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_4_3;              // 0x04F8 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_4_4;              // 0x0500 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_5_1;              // 0x0508 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_5_2;              // 0x0510 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_5_3;              // 0x0518 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_5_4;              // 0x0520 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIcon_5_5;              // 0x0528 (size: 0x8)
    class UWBP_SkillHorizonBranchIcon_C* WBP_SkillHorizonBranchIconOne;               // 0x0530 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_1;              // 0x0538 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_2;              // 0x0540 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_4_1;            // 0x0548 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_4_2;            // 0x0550 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_4_3;            // 0x0558 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_5_1;            // 0x0560 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_5_2;            // 0x0568 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_5_3;            // 0x0570 (size: 0x8)
    class UWBP_SkillTreeBranchSwitcher_C* WBP_SkillTreeBranchSwitcher_5_4;            // 0x0578 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG;                // 0x0580 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_1;              // 0x0588 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_2;              // 0x0590 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_3;              // 0x0598 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_4_1;            // 0x05A0 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_4_2;            // 0x05A8 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_4_3;            // 0x05B0 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_4_4;            // 0x05B8 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_5_1;            // 0x05C0 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_5_2;            // 0x05C8 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_5_3;            // 0x05D0 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_5_4;            // 0x05D8 (size: 0x8)
    class UWBP_SkillTreeHorizonLevelBG_C* WBP_SkillTreeHorizonLevelBG_5_5;            // 0x05E0 (size: 0x8)
    class UWidgetSwitcher* WidgetSwitcher_Image;                                      // 0x05E8 (size: 0x8)
    class UWidgetSwitcher* WidgetSwitcher_SkillTree;                                  // 0x05F0 (size: 0x8)
    class USBMasterDataManager* DataMaster;                                           // 0x05F8 (size: 0x8)
    TArray<FSBSkillTreeHorizonBranchData> SkillList;                                  // 0x0600 (size: 0x10)
    int32 CurrentLV;                                                                  // 0x0610 (size: 0x4)
    int32 MaxLv;                                                                      // 0x0614 (size: 0x4)
    FSBSkillDataMasterData Master;                                                    // 0x0618 (size: 0x58)
    TArray<class UWBP_SkillHorizonBranchIcon_C*> SkillIconArrayG3;                    // 0x0670 (size: 0x10)
    TArray<class UWBP_SkillHorizonBranchIcon_C*> SkillIconArrayG4;                    // 0x0680 (size: 0x10)
    TArray<class UWBP_SkillHorizonBranchIcon_C*> SkillIconArrayG5;                    // 0x0690 (size: 0x10)
    TArray<class UWBP_SkillTreeBranchSwitcher_C*> SkillBranchArrayG3;                 // 0x06A0 (size: 0x10)
    TArray<class UWBP_SkillTreeBranchSwitcher_C*> SkillBranchArrayG4;                 // 0x06B0 (size: 0x10)
    TArray<class UWBP_SkillTreeBranchSwitcher_C*> SkillBranchArrayG5;                 // 0x06C0 (size: 0x10)
    float AnkerPoint;                                                                 // 0x06D0 (size: 0x4)

    void OnLoaded_1DFBD8004EBCEB458BED0A99B7EBFC67(class UObject* Loaded);
    void OnLoaded_D391073141BB9F18836062A737A13918(class UObject* Loaded);
    void PreConstruct(bool IsDesignTime);
    void Construct();
    void Init(FSBSkillDataMasterData Skill, ESBClassType ClassType);
    void CustomEvent_0();
    void Close();
    void BndEvt__WBP_SkillTreeHorizon_CmnBack01_K2Node_ComponentBoundEvent_0_EventClicked__DelegateSignature();
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_79_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_177_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void SkillDetailsDisplay(int32 SkillId, int32 SkillLV);
    void SetISkillcon(int32 Index, const FSBSkillTreeHorizonBranchData& SBSkillTreeHorizonBranchData, TArray<class UWBP_SkillHorizonBranchIcon_C*>& InSkillIconArray);
    void SetSkillBrunch(int32 Index, const FSBSkillTreeHorizonBranchData& SBSkillTreeHorizonBranchData, TArray<class UWBP_SkillTreeBranchSwitcher_C*>& InSkillBranchArray);
    void TreeVisibleOff();
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIconOne_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void IconSelectUpdate();
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_1_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_2_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_3_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_4_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void UpdateRightWidgetsAnker();
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_1_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_2_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_3_K2Node_ComponentBoundEvent_11_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_4_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_5_K2Node_ComponentBoundEvent_13_OnClick__DelegateSignature(int32 SkillId, int32 SkillLV);
    void ExecuteUbergraph_WBP_SkillTreeHorizon(int32 EntryPoint);
}; // Size: 0x6D4

#endif
